import { defineComponent as f, ref as N, computed as I, watch as le, resolveComponent as q, createElementBlock as h, openBlock as m, createVNode as F, unref as x, isRef as Ce, withCtx as U, Fragment as ee, renderList as ue, createBlock as B, createElementVNode as c, getCurrentInstance as ht, inject as ct, readonly as V1, getCurrentScope as O1, onScopeDispose as B1, onMounted as Qe, nextTick as jl, warn as L1, provide as N1, mergeProps as _e, renderSlot as de, normalizeClass as be, Transition as ql, withDirectives as xo, normalizeStyle as St, createTextVNode as Fl, toDisplayString as se, vShow as Ul, shallowReactive as Wl, createCommentVNode as J, resolveDynamicComponent as me, withModifiers as an, isVNode as Eo, render as b2, useSlots as P1, useAttrs as j1, resolveDirective as q1 } from "vue";
const C2 = /* @__PURE__ */ JSON.parse('[{"code":"11","name":"北京市","children":[{"code":"1101","name":"市辖区","children":[{"code":"110101","name":"东城区"},{"code":"110102","name":"西城区"},{"code":"110105","name":"朝阳区"},{"code":"110106","name":"丰台区"},{"code":"110107","name":"石景山区"},{"code":"110108","name":"海淀区"},{"code":"110109","name":"门头沟区"},{"code":"110111","name":"房山区"},{"code":"110112","name":"通州区"},{"code":"110113","name":"顺义区"},{"code":"110114","name":"昌平区"},{"code":"110115","name":"大兴区"},{"code":"110116","name":"怀柔区"},{"code":"110117","name":"平谷区"},{"code":"110118","name":"密云区"},{"code":"110119","name":"延庆区"}]}]},{"code":"12","name":"天津市","children":[{"code":"1201","name":"市辖区","children":[{"code":"120101","name":"和平区"},{"code":"120102","name":"河东区"},{"code":"120103","name":"河西区"},{"code":"120104","name":"南开区"},{"code":"120105","name":"河北区"},{"code":"120106","name":"红桥区"},{"code":"120110","name":"东丽区"},{"code":"120111","name":"西青区"},{"code":"120112","name":"津南区"},{"code":"120113","name":"北辰区"},{"code":"120114","name":"武清区"},{"code":"120115","name":"宝坻区"},{"code":"120116","name":"滨海新区"},{"code":"120117","name":"宁河区"},{"code":"120118","name":"静海区"},{"code":"120119","name":"蓟州区"}]}]},{"code":"13","name":"河北省","children":[{"code":"1301","name":"石家庄市","children":[{"code":"130102","name":"长安区"},{"code":"130104","name":"桥西区"},{"code":"130105","name":"新华区"},{"code":"130107","name":"井陉矿区"},{"code":"130108","name":"裕华区"},{"code":"130109","name":"藁城区"},{"code":"130110","name":"鹿泉区"},{"code":"130111","name":"栾城区"},{"code":"130121","name":"井陉县"},{"code":"130123","name":"正定县"},{"code":"130125","name":"行唐县"},{"code":"130126","name":"灵寿县"},{"code":"130127","name":"高邑县"},{"code":"130128","name":"深泽县"},{"code":"130129","name":"赞皇县"},{"code":"130130","name":"无极县"},{"code":"130131","name":"平山县"},{"code":"130132","name":"元氏县"},{"code":"130133","name":"赵县"},{"code":"130171","name":"石家庄高新技术产业开发区"},{"code":"130172","name":"石家庄循环化工园区"},{"code":"130181","name":"辛集市"},{"code":"130183","name":"晋州市"},{"code":"130184","name":"新乐市"}]},{"code":"1302","name":"唐山市","children":[{"code":"130202","name":"路南区"},{"code":"130203","name":"路北区"},{"code":"130204","name":"古冶区"},{"code":"130205","name":"开平区"},{"code":"130207","name":"丰南区"},{"code":"130208","name":"丰润区"},{"code":"130209","name":"曹妃甸区"},{"code":"130224","name":"滦南县"},{"code":"130225","name":"乐亭县"},{"code":"130227","name":"迁西县"},{"code":"130229","name":"玉田县"},{"code":"130271","name":"河北唐山芦台经济开发区"},{"code":"130272","name":"唐山市汉沽管理区"},{"code":"130273","name":"唐山高新技术产业开发区"},{"code":"130274","name":"河北唐山海港经济开发区"},{"code":"130281","name":"遵化市"},{"code":"130283","name":"迁安市"},{"code":"130284","name":"滦州市"}]},{"code":"1303","name":"秦皇岛市","children":[{"code":"130302","name":"海港区"},{"code":"130303","name":"山海关区"},{"code":"130304","name":"北戴河区"},{"code":"130306","name":"抚宁区"},{"code":"130321","name":"青龙满族自治县"},{"code":"130322","name":"昌黎县"},{"code":"130324","name":"卢龙县"},{"code":"130371","name":"秦皇岛市经济技术开发区"},{"code":"130372","name":"北戴河新区"}]},{"code":"1304","name":"邯郸市","children":[{"code":"130402","name":"邯山区"},{"code":"130403","name":"丛台区"},{"code":"130404","name":"复兴区"},{"code":"130406","name":"峰峰矿区"},{"code":"130407","name":"肥乡区"},{"code":"130408","name":"永年区"},{"code":"130423","name":"临漳县"},{"code":"130424","name":"成安县"},{"code":"130425","name":"大名县"},{"code":"130426","name":"涉县"},{"code":"130427","name":"磁县"},{"code":"130430","name":"邱县"},{"code":"130431","name":"鸡泽县"},{"code":"130432","name":"广平县"},{"code":"130433","name":"馆陶县"},{"code":"130434","name":"魏县"},{"code":"130435","name":"曲周县"},{"code":"130471","name":"邯郸经济技术开发区"},{"code":"130473","name":"邯郸冀南新区"},{"code":"130481","name":"武安市"}]},{"code":"1305","name":"邢台市","children":[{"code":"130502","name":"襄都区"},{"code":"130503","name":"信都区"},{"code":"130505","name":"任泽区"},{"code":"130506","name":"南和区"},{"code":"130522","name":"临城县"},{"code":"130523","name":"内丘县"},{"code":"130524","name":"柏乡县"},{"code":"130525","name":"隆尧县"},{"code":"130528","name":"宁晋县"},{"code":"130529","name":"巨鹿县"},{"code":"130530","name":"新河县"},{"code":"130531","name":"广宗县"},{"code":"130532","name":"平乡县"},{"code":"130533","name":"威县"},{"code":"130534","name":"清河县"},{"code":"130535","name":"临西县"},{"code":"130571","name":"河北邢台经济开发区"},{"code":"130581","name":"南宫市"},{"code":"130582","name":"沙河市"}]},{"code":"1306","name":"保定市","children":[{"code":"130602","name":"竞秀区"},{"code":"130606","name":"莲池区"},{"code":"130607","name":"满城区"},{"code":"130608","name":"清苑区"},{"code":"130609","name":"徐水区"},{"code":"130623","name":"涞水县"},{"code":"130624","name":"阜平县"},{"code":"130626","name":"定兴县"},{"code":"130627","name":"唐县"},{"code":"130628","name":"高阳县"},{"code":"130629","name":"容城县"},{"code":"130630","name":"涞源县"},{"code":"130631","name":"望都县"},{"code":"130632","name":"安新县"},{"code":"130633","name":"易县"},{"code":"130634","name":"曲阳县"},{"code":"130635","name":"蠡县"},{"code":"130636","name":"顺平县"},{"code":"130637","name":"博野县"},{"code":"130638","name":"雄县"},{"code":"130671","name":"保定高新技术产业开发区"},{"code":"130672","name":"保定白沟新城"},{"code":"130681","name":"涿州市"},{"code":"130682","name":"定州市"},{"code":"130683","name":"安国市"},{"code":"130684","name":"高碑店市"}]},{"code":"1307","name":"张家口市","children":[{"code":"130702","name":"桥东区"},{"code":"130703","name":"桥西区"},{"code":"130705","name":"宣化区"},{"code":"130706","name":"下花园区"},{"code":"130708","name":"万全区"},{"code":"130709","name":"崇礼区"},{"code":"130722","name":"张北县"},{"code":"130723","name":"康保县"},{"code":"130724","name":"沽源县"},{"code":"130725","name":"尚义县"},{"code":"130726","name":"蔚县"},{"code":"130727","name":"阳原县"},{"code":"130728","name":"怀安县"},{"code":"130730","name":"怀来县"},{"code":"130731","name":"涿鹿县"},{"code":"130732","name":"赤城县"},{"code":"130771","name":"张家口经济开发区"},{"code":"130772","name":"张家口市察北管理区"},{"code":"130773","name":"张家口市塞北管理区"}]},{"code":"1308","name":"承德市","children":[{"code":"130802","name":"双桥区"},{"code":"130803","name":"双滦区"},{"code":"130804","name":"鹰手营子矿区"},{"code":"130821","name":"承德县"},{"code":"130822","name":"兴隆县"},{"code":"130824","name":"滦平县"},{"code":"130825","name":"隆化县"},{"code":"130826","name":"丰宁满族自治县"},{"code":"130827","name":"宽城满族自治县"},{"code":"130828","name":"围场满族蒙古族自治县"},{"code":"130871","name":"承德高新技术产业开发区"},{"code":"130881","name":"平泉市"}]},{"code":"1309","name":"沧州市","children":[{"code":"130902","name":"新华区"},{"code":"130903","name":"运河区"},{"code":"130921","name":"沧县"},{"code":"130922","name":"青县"},{"code":"130923","name":"东光县"},{"code":"130924","name":"海兴县"},{"code":"130925","name":"盐山县"},{"code":"130926","name":"肃宁县"},{"code":"130927","name":"南皮县"},{"code":"130928","name":"吴桥县"},{"code":"130929","name":"献县"},{"code":"130930","name":"孟村回族自治县"},{"code":"130971","name":"河北沧州经济开发区"},{"code":"130972","name":"沧州高新技术产业开发区"},{"code":"130973","name":"沧州渤海新区"},{"code":"130981","name":"泊头市"},{"code":"130982","name":"任丘市"},{"code":"130983","name":"黄骅市"},{"code":"130984","name":"河间市"}]},{"code":"1310","name":"廊坊市","children":[{"code":"131002","name":"安次区"},{"code":"131003","name":"广阳区"},{"code":"131022","name":"固安县"},{"code":"131023","name":"永清县"},{"code":"131024","name":"香河县"},{"code":"131025","name":"大城县"},{"code":"131026","name":"文安县"},{"code":"131028","name":"大厂回族自治县"},{"code":"131071","name":"廊坊经济技术开发区"},{"code":"131081","name":"霸州市"},{"code":"131082","name":"三河市"}]},{"code":"1311","name":"衡水市","children":[{"code":"131102","name":"桃城区"},{"code":"131103","name":"冀州区"},{"code":"131121","name":"枣强县"},{"code":"131122","name":"武邑县"},{"code":"131123","name":"武强县"},{"code":"131124","name":"饶阳县"},{"code":"131125","name":"安平县"},{"code":"131126","name":"故城县"},{"code":"131127","name":"景县"},{"code":"131128","name":"阜城县"},{"code":"131171","name":"河北衡水高新技术产业开发区"},{"code":"131172","name":"衡水滨湖新区"},{"code":"131182","name":"深州市"}]}]},{"code":"14","name":"山西省","children":[{"code":"1401","name":"太原市","children":[{"code":"140105","name":"小店区"},{"code":"140106","name":"迎泽区"},{"code":"140107","name":"杏花岭区"},{"code":"140108","name":"尖草坪区"},{"code":"140109","name":"万柏林区"},{"code":"140110","name":"晋源区"},{"code":"140121","name":"清徐县"},{"code":"140122","name":"阳曲县"},{"code":"140123","name":"娄烦县"},{"code":"140171","name":"山西转型综合改革示范区"},{"code":"140181","name":"古交市"}]},{"code":"1402","name":"大同市","children":[{"code":"140212","name":"新荣区"},{"code":"140213","name":"平城区"},{"code":"140214","name":"云冈区"},{"code":"140215","name":"云州区"},{"code":"140221","name":"阳高县"},{"code":"140222","name":"天镇县"},{"code":"140223","name":"广灵县"},{"code":"140224","name":"灵丘县"},{"code":"140225","name":"浑源县"},{"code":"140226","name":"左云县"},{"code":"140271","name":"山西大同经济开发区"}]},{"code":"1403","name":"阳泉市","children":[{"code":"140302","name":"城区"},{"code":"140303","name":"矿区"},{"code":"140311","name":"郊区"},{"code":"140321","name":"平定县"},{"code":"140322","name":"盂县"}]},{"code":"1404","name":"长治市","children":[{"code":"140403","name":"潞州区"},{"code":"140404","name":"上党区"},{"code":"140405","name":"屯留区"},{"code":"140406","name":"潞城区"},{"code":"140423","name":"襄垣县"},{"code":"140425","name":"平顺县"},{"code":"140426","name":"黎城县"},{"code":"140427","name":"壶关县"},{"code":"140428","name":"长子县"},{"code":"140429","name":"武乡县"},{"code":"140430","name":"沁县"},{"code":"140431","name":"沁源县"}]},{"code":"1405","name":"晋城市","children":[{"code":"140502","name":"城区"},{"code":"140521","name":"沁水县"},{"code":"140522","name":"阳城县"},{"code":"140524","name":"陵川县"},{"code":"140525","name":"泽州县"},{"code":"140581","name":"高平市"}]},{"code":"1406","name":"朔州市","children":[{"code":"140602","name":"朔城区"},{"code":"140603","name":"平鲁区"},{"code":"140621","name":"山阴县"},{"code":"140622","name":"应县"},{"code":"140623","name":"右玉县"},{"code":"140671","name":"山西朔州经济开发区"},{"code":"140681","name":"怀仁市"}]},{"code":"1407","name":"晋中市","children":[{"code":"140702","name":"榆次区"},{"code":"140703","name":"太谷区"},{"code":"140721","name":"榆社县"},{"code":"140722","name":"左权县"},{"code":"140723","name":"和顺县"},{"code":"140724","name":"昔阳县"},{"code":"140725","name":"寿阳县"},{"code":"140727","name":"祁县"},{"code":"140728","name":"平遥县"},{"code":"140729","name":"灵石县"},{"code":"140781","name":"介休市"}]},{"code":"1408","name":"运城市","children":[{"code":"140802","name":"盐湖区"},{"code":"140821","name":"临猗县"},{"code":"140822","name":"万荣县"},{"code":"140823","name":"闻喜县"},{"code":"140824","name":"稷山县"},{"code":"140825","name":"新绛县"},{"code":"140826","name":"绛县"},{"code":"140827","name":"垣曲县"},{"code":"140828","name":"夏县"},{"code":"140829","name":"平陆县"},{"code":"140830","name":"芮城县"},{"code":"140881","name":"永济市"},{"code":"140882","name":"河津市"}]},{"code":"1409","name":"忻州市","children":[{"code":"140902","name":"忻府区"},{"code":"140921","name":"定襄县"},{"code":"140922","name":"五台县"},{"code":"140923","name":"代县"},{"code":"140924","name":"繁峙县"},{"code":"140925","name":"宁武县"},{"code":"140926","name":"静乐县"},{"code":"140927","name":"神池县"},{"code":"140928","name":"五寨县"},{"code":"140929","name":"岢岚县"},{"code":"140930","name":"河曲县"},{"code":"140931","name":"保德县"},{"code":"140932","name":"偏关县"},{"code":"140971","name":"五台山风景名胜区"},{"code":"140981","name":"原平市"}]},{"code":"1410","name":"临汾市","children":[{"code":"141002","name":"尧都区"},{"code":"141021","name":"曲沃县"},{"code":"141022","name":"翼城县"},{"code":"141023","name":"襄汾县"},{"code":"141024","name":"洪洞县"},{"code":"141025","name":"古县"},{"code":"141026","name":"安泽县"},{"code":"141027","name":"浮山县"},{"code":"141028","name":"吉县"},{"code":"141029","name":"乡宁县"},{"code":"141030","name":"大宁县"},{"code":"141031","name":"隰县"},{"code":"141032","name":"永和县"},{"code":"141033","name":"蒲县"},{"code":"141034","name":"汾西县"},{"code":"141081","name":"侯马市"},{"code":"141082","name":"霍州市"}]},{"code":"1411","name":"吕梁市","children":[{"code":"141102","name":"离石区"},{"code":"141121","name":"文水县"},{"code":"141122","name":"交城县"},{"code":"141123","name":"兴县"},{"code":"141124","name":"临县"},{"code":"141125","name":"柳林县"},{"code":"141126","name":"石楼县"},{"code":"141127","name":"岚县"},{"code":"141128","name":"方山县"},{"code":"141129","name":"中阳县"},{"code":"141130","name":"交口县"},{"code":"141181","name":"孝义市"},{"code":"141182","name":"汾阳市"}]}]},{"code":"15","name":"内蒙古自治区","children":[{"code":"1501","name":"呼和浩特市","children":[{"code":"150102","name":"新城区"},{"code":"150103","name":"回民区"},{"code":"150104","name":"玉泉区"},{"code":"150105","name":"赛罕区"},{"code":"150121","name":"土默特左旗"},{"code":"150122","name":"托克托县"},{"code":"150123","name":"和林格尔县"},{"code":"150124","name":"清水河县"},{"code":"150125","name":"武川县"},{"code":"150172","name":"呼和浩特经济技术开发区"}]},{"code":"1502","name":"包头市","children":[{"code":"150202","name":"东河区"},{"code":"150203","name":"昆都仑区"},{"code":"150204","name":"青山区"},{"code":"150205","name":"石拐区"},{"code":"150206","name":"白云鄂博矿区"},{"code":"150207","name":"九原区"},{"code":"150221","name":"土默特右旗"},{"code":"150222","name":"固阳县"},{"code":"150223","name":"达尔罕茂明安联合旗"},{"code":"150271","name":"包头稀土高新技术产业开发区"}]},{"code":"1503","name":"乌海市","children":[{"code":"150302","name":"海勃湾区"},{"code":"150303","name":"海南区"},{"code":"150304","name":"乌达区"}]},{"code":"1504","name":"赤峰市","children":[{"code":"150402","name":"红山区"},{"code":"150403","name":"元宝山区"},{"code":"150404","name":"松山区"},{"code":"150421","name":"阿鲁科尔沁旗"},{"code":"150422","name":"巴林左旗"},{"code":"150423","name":"巴林右旗"},{"code":"150424","name":"林西县"},{"code":"150425","name":"克什克腾旗"},{"code":"150426","name":"翁牛特旗"},{"code":"150428","name":"喀喇沁旗"},{"code":"150429","name":"宁城县"},{"code":"150430","name":"敖汉旗"}]},{"code":"1505","name":"通辽市","children":[{"code":"150502","name":"科尔沁区"},{"code":"150521","name":"科尔沁左翼中旗"},{"code":"150522","name":"科尔沁左翼后旗"},{"code":"150523","name":"开鲁县"},{"code":"150524","name":"库伦旗"},{"code":"150525","name":"奈曼旗"},{"code":"150526","name":"扎鲁特旗"},{"code":"150571","name":"通辽经济技术开发区"},{"code":"150581","name":"霍林郭勒市"}]},{"code":"1506","name":"鄂尔多斯市","children":[{"code":"150602","name":"东胜区"},{"code":"150603","name":"康巴什区"},{"code":"150621","name":"达拉特旗"},{"code":"150622","name":"准格尔旗"},{"code":"150623","name":"鄂托克前旗"},{"code":"150624","name":"鄂托克旗"},{"code":"150625","name":"杭锦旗"},{"code":"150626","name":"乌审旗"},{"code":"150627","name":"伊金霍洛旗"}]},{"code":"1507","name":"呼伦贝尔市","children":[{"code":"150702","name":"海拉尔区"},{"code":"150703","name":"扎赉诺尔区"},{"code":"150721","name":"阿荣旗"},{"code":"150722","name":"莫力达瓦达斡尔族自治旗"},{"code":"150723","name":"鄂伦春自治旗"},{"code":"150724","name":"鄂温克族自治旗"},{"code":"150725","name":"陈巴尔虎旗"},{"code":"150726","name":"新巴尔虎左旗"},{"code":"150727","name":"新巴尔虎右旗"},{"code":"150781","name":"满洲里市"},{"code":"150782","name":"牙克石市"},{"code":"150783","name":"扎兰屯市"},{"code":"150784","name":"额尔古纳市"},{"code":"150785","name":"根河市"}]},{"code":"1508","name":"巴彦淖尔市","children":[{"code":"150802","name":"临河区"},{"code":"150821","name":"五原县"},{"code":"150822","name":"磴口县"},{"code":"150823","name":"乌拉特前旗"},{"code":"150824","name":"乌拉特中旗"},{"code":"150825","name":"乌拉特后旗"},{"code":"150826","name":"杭锦后旗"}]},{"code":"1509","name":"乌兰察布市","children":[{"code":"150902","name":"集宁区"},{"code":"150921","name":"卓资县"},{"code":"150922","name":"化德县"},{"code":"150923","name":"商都县"},{"code":"150924","name":"兴和县"},{"code":"150925","name":"凉城县"},{"code":"150926","name":"察哈尔右翼前旗"},{"code":"150927","name":"察哈尔右翼中旗"},{"code":"150928","name":"察哈尔右翼后旗"},{"code":"150929","name":"四子王旗"},{"code":"150981","name":"丰镇市"}]},{"code":"1522","name":"兴安盟","children":[{"code":"152201","name":"乌兰浩特市"},{"code":"152202","name":"阿尔山市"},{"code":"152221","name":"科尔沁右翼前旗"},{"code":"152222","name":"科尔沁右翼中旗"},{"code":"152223","name":"扎赉特旗"},{"code":"152224","name":"突泉县"}]},{"code":"1525","name":"锡林郭勒盟","children":[{"code":"152501","name":"二连浩特市"},{"code":"152502","name":"锡林浩特市"},{"code":"152522","name":"阿巴嘎旗"},{"code":"152523","name":"苏尼特左旗"},{"code":"152524","name":"苏尼特右旗"},{"code":"152525","name":"东乌珠穆沁旗"},{"code":"152526","name":"西乌珠穆沁旗"},{"code":"152527","name":"太仆寺旗"},{"code":"152528","name":"镶黄旗"},{"code":"152529","name":"正镶白旗"},{"code":"152530","name":"正蓝旗"},{"code":"152531","name":"多伦县"},{"code":"152571","name":"乌拉盖管理区管委会"}]},{"code":"1529","name":"阿拉善盟","children":[{"code":"152921","name":"阿拉善左旗"},{"code":"152922","name":"阿拉善右旗"},{"code":"152923","name":"额济纳旗"},{"code":"152971","name":"内蒙古阿拉善高新技术产业开发区"}]}]},{"code":"21","name":"辽宁省","children":[{"code":"2101","name":"沈阳市","children":[{"code":"210102","name":"和平区"},{"code":"210103","name":"沈河区"},{"code":"210104","name":"大东区"},{"code":"210105","name":"皇姑区"},{"code":"210106","name":"铁西区"},{"code":"210111","name":"苏家屯区"},{"code":"210112","name":"浑南区"},{"code":"210113","name":"沈北新区"},{"code":"210114","name":"于洪区"},{"code":"210115","name":"辽中区"},{"code":"210123","name":"康平县"},{"code":"210124","name":"法库县"},{"code":"210181","name":"新民市"}]},{"code":"2102","name":"大连市","children":[{"code":"210202","name":"中山区"},{"code":"210203","name":"西岗区"},{"code":"210204","name":"沙河口区"},{"code":"210211","name":"甘井子区"},{"code":"210212","name":"旅顺口区"},{"code":"210213","name":"金州区"},{"code":"210214","name":"普兰店区"},{"code":"210224","name":"长海县"},{"code":"210281","name":"瓦房店市"},{"code":"210283","name":"庄河市"}]},{"code":"2103","name":"鞍山市","children":[{"code":"210302","name":"铁东区"},{"code":"210303","name":"铁西区"},{"code":"210304","name":"立山区"},{"code":"210311","name":"千山区"},{"code":"210321","name":"台安县"},{"code":"210323","name":"岫岩满族自治县"},{"code":"210381","name":"海城市"}]},{"code":"2104","name":"抚顺市","children":[{"code":"210402","name":"新抚区"},{"code":"210403","name":"东洲区"},{"code":"210404","name":"望花区"},{"code":"210411","name":"顺城区"},{"code":"210421","name":"抚顺县"},{"code":"210422","name":"新宾满族自治县"},{"code":"210423","name":"清原满族自治县"}]},{"code":"2105","name":"本溪市","children":[{"code":"210502","name":"平山区"},{"code":"210503","name":"溪湖区"},{"code":"210504","name":"明山区"},{"code":"210505","name":"南芬区"},{"code":"210521","name":"本溪满族自治县"},{"code":"210522","name":"桓仁满族自治县"}]},{"code":"2106","name":"丹东市","children":[{"code":"210602","name":"元宝区"},{"code":"210603","name":"振兴区"},{"code":"210604","name":"振安区"},{"code":"210624","name":"宽甸满族自治县"},{"code":"210681","name":"东港市"},{"code":"210682","name":"凤城市"}]},{"code":"2107","name":"锦州市","children":[{"code":"210702","name":"古塔区"},{"code":"210703","name":"凌河区"},{"code":"210711","name":"太和区"},{"code":"210726","name":"黑山县"},{"code":"210727","name":"义县"},{"code":"210781","name":"凌海市"},{"code":"210782","name":"北镇市"}]},{"code":"2108","name":"营口市","children":[{"code":"210802","name":"站前区"},{"code":"210803","name":"西市区"},{"code":"210804","name":"鲅鱼圈区"},{"code":"210811","name":"老边区"},{"code":"210881","name":"盖州市"},{"code":"210882","name":"大石桥市"}]},{"code":"2109","name":"阜新市","children":[{"code":"210902","name":"海州区"},{"code":"210903","name":"新邱区"},{"code":"210904","name":"太平区"},{"code":"210905","name":"清河门区"},{"code":"210911","name":"细河区"},{"code":"210921","name":"阜新蒙古族自治县"},{"code":"210922","name":"彰武县"}]},{"code":"2110","name":"辽阳市","children":[{"code":"211002","name":"白塔区"},{"code":"211003","name":"文圣区"},{"code":"211004","name":"宏伟区"},{"code":"211005","name":"弓长岭区"},{"code":"211011","name":"太子河区"},{"code":"211021","name":"辽阳县"},{"code":"211081","name":"灯塔市"}]},{"code":"2111","name":"盘锦市","children":[{"code":"211102","name":"双台子区"},{"code":"211103","name":"兴隆台区"},{"code":"211104","name":"大洼区"},{"code":"211122","name":"盘山县"}]},{"code":"2112","name":"铁岭市","children":[{"code":"211202","name":"银州区"},{"code":"211204","name":"清河区"},{"code":"211221","name":"铁岭县"},{"code":"211223","name":"西丰县"},{"code":"211224","name":"昌图县"},{"code":"211281","name":"调兵山市"},{"code":"211282","name":"开原市"}]},{"code":"2113","name":"朝阳市","children":[{"code":"211302","name":"双塔区"},{"code":"211303","name":"龙城区"},{"code":"211321","name":"朝阳县"},{"code":"211322","name":"建平县"},{"code":"211324","name":"喀喇沁左翼蒙古族自治县"},{"code":"211381","name":"北票市"},{"code":"211382","name":"凌源市"}]},{"code":"2114","name":"葫芦岛市","children":[{"code":"211402","name":"连山区"},{"code":"211403","name":"龙港区"},{"code":"211404","name":"南票区"},{"code":"211421","name":"绥中县"},{"code":"211422","name":"建昌县"},{"code":"211481","name":"兴城市"}]}]},{"code":"22","name":"吉林省","children":[{"code":"2201","name":"长春市","children":[{"code":"220102","name":"南关区"},{"code":"220103","name":"宽城区"},{"code":"220104","name":"朝阳区"},{"code":"220105","name":"二道区"},{"code":"220106","name":"绿园区"},{"code":"220112","name":"双阳区"},{"code":"220113","name":"九台区"},{"code":"220122","name":"农安县"},{"code":"220171","name":"长春经济技术开发区"},{"code":"220172","name":"长春净月高新技术产业开发区"},{"code":"220173","name":"长春高新技术产业开发区"},{"code":"220174","name":"长春汽车经济技术开发区"},{"code":"220182","name":"榆树市"},{"code":"220183","name":"德惠市"},{"code":"220184","name":"公主岭市"}]},{"code":"2202","name":"吉林市","children":[{"code":"220202","name":"昌邑区"},{"code":"220203","name":"龙潭区"},{"code":"220204","name":"船营区"},{"code":"220211","name":"丰满区"},{"code":"220221","name":"永吉县"},{"code":"220271","name":"吉林经济开发区"},{"code":"220272","name":"吉林高新技术产业开发区"},{"code":"220273","name":"吉林中国新加坡食品区"},{"code":"220281","name":"蛟河市"},{"code":"220282","name":"桦甸市"},{"code":"220283","name":"舒兰市"},{"code":"220284","name":"磐石市"}]},{"code":"2203","name":"四平市","children":[{"code":"220302","name":"铁西区"},{"code":"220303","name":"铁东区"},{"code":"220322","name":"梨树县"},{"code":"220323","name":"伊通满族自治县"},{"code":"220382","name":"双辽市"}]},{"code":"2204","name":"辽源市","children":[{"code":"220402","name":"龙山区"},{"code":"220403","name":"西安区"},{"code":"220421","name":"东丰县"},{"code":"220422","name":"东辽县"}]},{"code":"2205","name":"通化市","children":[{"code":"220502","name":"东昌区"},{"code":"220503","name":"二道江区"},{"code":"220521","name":"通化县"},{"code":"220523","name":"辉南县"},{"code":"220524","name":"柳河县"},{"code":"220581","name":"梅河口市"},{"code":"220582","name":"集安市"}]},{"code":"2206","name":"白山市","children":[{"code":"220602","name":"浑江区"},{"code":"220605","name":"江源区"},{"code":"220621","name":"抚松县"},{"code":"220622","name":"靖宇县"},{"code":"220623","name":"长白朝鲜族自治县"},{"code":"220681","name":"临江市"}]},{"code":"2207","name":"松原市","children":[{"code":"220702","name":"宁江区"},{"code":"220721","name":"前郭尔罗斯蒙古族自治县"},{"code":"220722","name":"长岭县"},{"code":"220723","name":"乾安县"},{"code":"220771","name":"吉林松原经济开发区"},{"code":"220781","name":"扶余市"}]},{"code":"2208","name":"白城市","children":[{"code":"220802","name":"洮北区"},{"code":"220821","name":"镇赉县"},{"code":"220822","name":"通榆县"},{"code":"220871","name":"吉林白城经济开发区"},{"code":"220881","name":"洮南市"},{"code":"220882","name":"大安市"}]},{"code":"2224","name":"延边朝鲜族自治州","children":[{"code":"222401","name":"延吉市"},{"code":"222402","name":"图们市"},{"code":"222403","name":"敦化市"},{"code":"222404","name":"珲春市"},{"code":"222405","name":"龙井市"},{"code":"222406","name":"和龙市"},{"code":"222424","name":"汪清县"},{"code":"222426","name":"安图县"}]}]},{"code":"23","name":"黑龙江省","children":[{"code":"2301","name":"哈尔滨市","children":[{"code":"230102","name":"道里区"},{"code":"230103","name":"南岗区"},{"code":"230104","name":"道外区"},{"code":"230108","name":"平房区"},{"code":"230109","name":"松北区"},{"code":"230110","name":"香坊区"},{"code":"230111","name":"呼兰区"},{"code":"230112","name":"阿城区"},{"code":"230113","name":"双城区"},{"code":"230123","name":"依兰县"},{"code":"230124","name":"方正县"},{"code":"230125","name":"宾县"},{"code":"230126","name":"巴彦县"},{"code":"230127","name":"木兰县"},{"code":"230128","name":"通河县"},{"code":"230129","name":"延寿县"},{"code":"230183","name":"尚志市"},{"code":"230184","name":"五常市"}]},{"code":"2302","name":"齐齐哈尔市","children":[{"code":"230202","name":"龙沙区"},{"code":"230203","name":"建华区"},{"code":"230204","name":"铁锋区"},{"code":"230205","name":"昂昂溪区"},{"code":"230206","name":"富拉尔基区"},{"code":"230207","name":"碾子山区"},{"code":"230208","name":"梅里斯达斡尔族区"},{"code":"230221","name":"龙江县"},{"code":"230223","name":"依安县"},{"code":"230224","name":"泰来县"},{"code":"230225","name":"甘南县"},{"code":"230227","name":"富裕县"},{"code":"230229","name":"克山县"},{"code":"230230","name":"克东县"},{"code":"230231","name":"拜泉县"},{"code":"230281","name":"讷河市"}]},{"code":"2303","name":"鸡西市","children":[{"code":"230302","name":"鸡冠区"},{"code":"230303","name":"恒山区"},{"code":"230304","name":"滴道区"},{"code":"230305","name":"梨树区"},{"code":"230306","name":"城子河区"},{"code":"230307","name":"麻山区"},{"code":"230321","name":"鸡东县"},{"code":"230381","name":"虎林市"},{"code":"230382","name":"密山市"}]},{"code":"2304","name":"鹤岗市","children":[{"code":"230402","name":"向阳区"},{"code":"230403","name":"工农区"},{"code":"230404","name":"南山区"},{"code":"230405","name":"兴安区"},{"code":"230406","name":"东山区"},{"code":"230407","name":"兴山区"},{"code":"230421","name":"萝北县"},{"code":"230422","name":"绥滨县"}]},{"code":"2305","name":"双鸭山市","children":[{"code":"230502","name":"尖山区"},{"code":"230503","name":"岭东区"},{"code":"230505","name":"四方台区"},{"code":"230506","name":"宝山区"},{"code":"230521","name":"集贤县"},{"code":"230522","name":"友谊县"},{"code":"230523","name":"宝清县"},{"code":"230524","name":"饶河县"}]},{"code":"2306","name":"大庆市","children":[{"code":"230602","name":"萨尔图区"},{"code":"230603","name":"龙凤区"},{"code":"230604","name":"让胡路区"},{"code":"230605","name":"红岗区"},{"code":"230606","name":"大同区"},{"code":"230621","name":"肇州县"},{"code":"230622","name":"肇源县"},{"code":"230623","name":"林甸县"},{"code":"230624","name":"杜尔伯特蒙古族自治县"},{"code":"230671","name":"大庆高新技术产业开发区"}]},{"code":"2307","name":"伊春市","children":[{"code":"230717","name":"伊美区"},{"code":"230718","name":"乌翠区"},{"code":"230719","name":"友好区"},{"code":"230722","name":"嘉荫县"},{"code":"230723","name":"汤旺县"},{"code":"230724","name":"丰林县"},{"code":"230725","name":"大箐山县"},{"code":"230726","name":"南岔县"},{"code":"230751","name":"金林区"},{"code":"230781","name":"铁力市"}]},{"code":"2308","name":"佳木斯市","children":[{"code":"230803","name":"向阳区"},{"code":"230804","name":"前进区"},{"code":"230805","name":"东风区"},{"code":"230811","name":"郊区"},{"code":"230822","name":"桦南县"},{"code":"230826","name":"桦川县"},{"code":"230828","name":"汤原县"},{"code":"230881","name":"同江市"},{"code":"230882","name":"富锦市"},{"code":"230883","name":"抚远市"}]},{"code":"2309","name":"七台河市","children":[{"code":"230902","name":"新兴区"},{"code":"230903","name":"桃山区"},{"code":"230904","name":"茄子河区"},{"code":"230921","name":"勃利县"}]},{"code":"2310","name":"牡丹江市","children":[{"code":"231002","name":"东安区"},{"code":"231003","name":"阳明区"},{"code":"231004","name":"爱民区"},{"code":"231005","name":"西安区"},{"code":"231025","name":"林口县"},{"code":"231081","name":"绥芬河市"},{"code":"231083","name":"海林市"},{"code":"231084","name":"宁安市"},{"code":"231085","name":"穆棱市"},{"code":"231086","name":"东宁市"}]},{"code":"2311","name":"黑河市","children":[{"code":"231102","name":"爱辉区"},{"code":"231123","name":"逊克县"},{"code":"231124","name":"孙吴县"},{"code":"231181","name":"北安市"},{"code":"231182","name":"五大连池市"},{"code":"231183","name":"嫩江市"}]},{"code":"2312","name":"绥化市","children":[{"code":"231202","name":"北林区"},{"code":"231221","name":"望奎县"},{"code":"231222","name":"兰西县"},{"code":"231223","name":"青冈县"},{"code":"231224","name":"庆安县"},{"code":"231225","name":"明水县"},{"code":"231226","name":"绥棱县"},{"code":"231281","name":"安达市"},{"code":"231282","name":"肇东市"},{"code":"231283","name":"海伦市"}]},{"code":"2327","name":"大兴安岭地区","children":[{"code":"232701","name":"漠河市"},{"code":"232721","name":"呼玛县"},{"code":"232722","name":"塔河县"},{"code":"232761","name":"加格达奇区"},{"code":"232762","name":"松岭区"},{"code":"232763","name":"新林区"},{"code":"232764","name":"呼中区"}]}]},{"code":"31","name":"上海市","children":[{"code":"3101","name":"市辖区","children":[{"code":"310101","name":"黄浦区"},{"code":"310104","name":"徐汇区"},{"code":"310105","name":"长宁区"},{"code":"310106","name":"静安区"},{"code":"310107","name":"普陀区"},{"code":"310109","name":"虹口区"},{"code":"310110","name":"杨浦区"},{"code":"310112","name":"闵行区"},{"code":"310113","name":"宝山区"},{"code":"310114","name":"嘉定区"},{"code":"310115","name":"浦东新区"},{"code":"310116","name":"金山区"},{"code":"310117","name":"松江区"},{"code":"310118","name":"青浦区"},{"code":"310120","name":"奉贤区"},{"code":"310151","name":"崇明区"}]}]},{"code":"32","name":"江苏省","children":[{"code":"3201","name":"南京市","children":[{"code":"320102","name":"玄武区"},{"code":"320104","name":"秦淮区"},{"code":"320105","name":"建邺区"},{"code":"320106","name":"鼓楼区"},{"code":"320111","name":"浦口区"},{"code":"320113","name":"栖霞区"},{"code":"320114","name":"雨花台区"},{"code":"320115","name":"江宁区"},{"code":"320116","name":"六合区"},{"code":"320117","name":"溧水区"},{"code":"320118","name":"高淳区"}]},{"code":"3202","name":"无锡市","children":[{"code":"320205","name":"锡山区"},{"code":"320206","name":"惠山区"},{"code":"320211","name":"滨湖区"},{"code":"320213","name":"梁溪区"},{"code":"320214","name":"新吴区"},{"code":"320281","name":"江阴市"},{"code":"320282","name":"宜兴市"}]},{"code":"3203","name":"徐州市","children":[{"code":"320302","name":"鼓楼区"},{"code":"320303","name":"云龙区"},{"code":"320305","name":"贾汪区"},{"code":"320311","name":"泉山区"},{"code":"320312","name":"铜山区"},{"code":"320321","name":"丰县"},{"code":"320322","name":"沛县"},{"code":"320324","name":"睢宁县"},{"code":"320371","name":"徐州经济技术开发区"},{"code":"320381","name":"新沂市"},{"code":"320382","name":"邳州市"}]},{"code":"3204","name":"常州市","children":[{"code":"320402","name":"天宁区"},{"code":"320404","name":"钟楼区"},{"code":"320411","name":"新北区"},{"code":"320412","name":"武进区"},{"code":"320413","name":"金坛区"},{"code":"320481","name":"溧阳市"}]},{"code":"3205","name":"苏州市","children":[{"code":"320505","name":"虎丘区"},{"code":"320506","name":"吴中区"},{"code":"320507","name":"相城区"},{"code":"320508","name":"姑苏区"},{"code":"320509","name":"吴江区"},{"code":"320576","name":"苏州工业园区"},{"code":"320581","name":"常熟市"},{"code":"320582","name":"张家港市"},{"code":"320583","name":"昆山市"},{"code":"320585","name":"太仓市"}]},{"code":"3206","name":"南通市","children":[{"code":"320612","name":"通州区"},{"code":"320613","name":"崇川区"},{"code":"320614","name":"海门区"},{"code":"320623","name":"如东县"},{"code":"320671","name":"南通经济技术开发区"},{"code":"320681","name":"启东市"},{"code":"320682","name":"如皋市"},{"code":"320685","name":"海安市"}]},{"code":"3207","name":"连云港市","children":[{"code":"320703","name":"连云区"},{"code":"320706","name":"海州区"},{"code":"320707","name":"赣榆区"},{"code":"320722","name":"东海县"},{"code":"320723","name":"灌云县"},{"code":"320724","name":"灌南县"},{"code":"320771","name":"连云港经济技术开发区"}]},{"code":"3208","name":"淮安市","children":[{"code":"320803","name":"淮安区"},{"code":"320804","name":"淮阴区"},{"code":"320812","name":"清江浦区"},{"code":"320813","name":"洪泽区"},{"code":"320826","name":"涟水县"},{"code":"320830","name":"盱眙县"},{"code":"320831","name":"金湖县"},{"code":"320871","name":"淮安经济技术开发区"}]},{"code":"3209","name":"盐城市","children":[{"code":"320902","name":"亭湖区"},{"code":"320903","name":"盐都区"},{"code":"320904","name":"大丰区"},{"code":"320921","name":"响水县"},{"code":"320922","name":"滨海县"},{"code":"320923","name":"阜宁县"},{"code":"320924","name":"射阳县"},{"code":"320925","name":"建湖县"},{"code":"320971","name":"盐城经济技术开发区"},{"code":"320981","name":"东台市"}]},{"code":"3210","name":"扬州市","children":[{"code":"321002","name":"广陵区"},{"code":"321003","name":"邗江区"},{"code":"321012","name":"江都区"},{"code":"321023","name":"宝应县"},{"code":"321071","name":"扬州经济技术开发区"},{"code":"321081","name":"仪征市"},{"code":"321084","name":"高邮市"}]},{"code":"3211","name":"镇江市","children":[{"code":"321102","name":"京口区"},{"code":"321111","name":"润州区"},{"code":"321112","name":"丹徒区"},{"code":"321171","name":"镇江新区"},{"code":"321181","name":"丹阳市"},{"code":"321182","name":"扬中市"},{"code":"321183","name":"句容市"}]},{"code":"3212","name":"泰州市","children":[{"code":"321202","name":"海陵区"},{"code":"321203","name":"高港区"},{"code":"321204","name":"姜堰区"},{"code":"321281","name":"兴化市"},{"code":"321282","name":"靖江市"},{"code":"321283","name":"泰兴市"}]},{"code":"3213","name":"宿迁市","children":[{"code":"321302","name":"宿城区"},{"code":"321311","name":"宿豫区"},{"code":"321322","name":"沭阳县"},{"code":"321323","name":"泗阳县"},{"code":"321324","name":"泗洪县"},{"code":"321371","name":"宿迁经济技术开发区"}]}]},{"code":"33","name":"浙江省","children":[{"code":"3301","name":"杭州市","children":[{"code":"330102","name":"上城区"},{"code":"330105","name":"拱墅区"},{"code":"330106","name":"西湖区"},{"code":"330108","name":"滨江区"},{"code":"330109","name":"萧山区"},{"code":"330110","name":"余杭区"},{"code":"330111","name":"富阳区"},{"code":"330112","name":"临安区"},{"code":"330113","name":"临平区"},{"code":"330114","name":"钱塘区"},{"code":"330122","name":"桐庐县"},{"code":"330127","name":"淳安县"},{"code":"330182","name":"建德市"}]},{"code":"3302","name":"宁波市","children":[{"code":"330203","name":"海曙区"},{"code":"330205","name":"江北区"},{"code":"330206","name":"北仑区"},{"code":"330211","name":"镇海区"},{"code":"330212","name":"鄞州区"},{"code":"330213","name":"奉化区"},{"code":"330225","name":"象山县"},{"code":"330226","name":"宁海县"},{"code":"330281","name":"余姚市"},{"code":"330282","name":"慈溪市"}]},{"code":"3303","name":"温州市","children":[{"code":"330302","name":"鹿城区"},{"code":"330303","name":"龙湾区"},{"code":"330304","name":"瓯海区"},{"code":"330305","name":"洞头区"},{"code":"330324","name":"永嘉县"},{"code":"330326","name":"平阳县"},{"code":"330327","name":"苍南县"},{"code":"330328","name":"文成县"},{"code":"330329","name":"泰顺县"},{"code":"330381","name":"瑞安市"},{"code":"330382","name":"乐清市"},{"code":"330383","name":"龙港市"}]},{"code":"3304","name":"嘉兴市","children":[{"code":"330402","name":"南湖区"},{"code":"330411","name":"秀洲区"},{"code":"330421","name":"嘉善县"},{"code":"330424","name":"海盐县"},{"code":"330481","name":"海宁市"},{"code":"330482","name":"平湖市"},{"code":"330483","name":"桐乡市"}]},{"code":"3305","name":"湖州市","children":[{"code":"330502","name":"吴兴区"},{"code":"330503","name":"南浔区"},{"code":"330521","name":"德清县"},{"code":"330522","name":"长兴县"},{"code":"330523","name":"安吉县"}]},{"code":"3306","name":"绍兴市","children":[{"code":"330602","name":"越城区"},{"code":"330603","name":"柯桥区"},{"code":"330604","name":"上虞区"},{"code":"330624","name":"新昌县"},{"code":"330681","name":"诸暨市"},{"code":"330683","name":"嵊州市"}]},{"code":"3307","name":"金华市","children":[{"code":"330702","name":"婺城区"},{"code":"330703","name":"金东区"},{"code":"330723","name":"武义县"},{"code":"330726","name":"浦江县"},{"code":"330727","name":"磐安县"},{"code":"330781","name":"兰溪市"},{"code":"330782","name":"义乌市"},{"code":"330783","name":"东阳市"},{"code":"330784","name":"永康市"}]},{"code":"3308","name":"衢州市","children":[{"code":"330802","name":"柯城区"},{"code":"330803","name":"衢江区"},{"code":"330822","name":"常山县"},{"code":"330824","name":"开化县"},{"code":"330825","name":"龙游县"},{"code":"330881","name":"江山市"}]},{"code":"3309","name":"舟山市","children":[{"code":"330902","name":"定海区"},{"code":"330903","name":"普陀区"},{"code":"330921","name":"岱山县"},{"code":"330922","name":"嵊泗县"}]},{"code":"3310","name":"台州市","children":[{"code":"331002","name":"椒江区"},{"code":"331003","name":"黄岩区"},{"code":"331004","name":"路桥区"},{"code":"331022","name":"三门县"},{"code":"331023","name":"天台县"},{"code":"331024","name":"仙居县"},{"code":"331081","name":"温岭市"},{"code":"331082","name":"临海市"},{"code":"331083","name":"玉环市"}]},{"code":"3311","name":"丽水市","children":[{"code":"331102","name":"莲都区"},{"code":"331121","name":"青田县"},{"code":"331122","name":"缙云县"},{"code":"331123","name":"遂昌县"},{"code":"331124","name":"松阳县"},{"code":"331125","name":"云和县"},{"code":"331126","name":"庆元县"},{"code":"331127","name":"景宁畲族自治县"},{"code":"331181","name":"龙泉市"}]}]},{"code":"34","name":"安徽省","children":[{"code":"3401","name":"合肥市","children":[{"code":"340102","name":"瑶海区"},{"code":"340103","name":"庐阳区"},{"code":"340104","name":"蜀山区"},{"code":"340111","name":"包河区"},{"code":"340121","name":"长丰县"},{"code":"340122","name":"肥东县"},{"code":"340123","name":"肥西县"},{"code":"340124","name":"庐江县"},{"code":"340176","name":"合肥高新技术产业开发区"},{"code":"340177","name":"合肥经济技术开发区"},{"code":"340178","name":"合肥新站高新技术产业开发区"},{"code":"340181","name":"巢湖市"}]},{"code":"3402","name":"芜湖市","children":[{"code":"340202","name":"镜湖区"},{"code":"340207","name":"鸠江区"},{"code":"340209","name":"弋江区"},{"code":"340210","name":"湾沚区"},{"code":"340212","name":"繁昌区"},{"code":"340223","name":"南陵县"},{"code":"340271","name":"芜湖经济技术开发区"},{"code":"340272","name":"安徽芜湖三山经济开发区"},{"code":"340281","name":"无为市"}]},{"code":"3403","name":"蚌埠市","children":[{"code":"340302","name":"龙子湖区"},{"code":"340303","name":"蚌山区"},{"code":"340304","name":"禹会区"},{"code":"340311","name":"淮上区"},{"code":"340321","name":"怀远县"},{"code":"340322","name":"五河县"},{"code":"340323","name":"固镇县"},{"code":"340371","name":"蚌埠市高新技术开发区"},{"code":"340372","name":"蚌埠市经济开发区"}]},{"code":"3404","name":"淮南市","children":[{"code":"340402","name":"大通区"},{"code":"340403","name":"田家庵区"},{"code":"340404","name":"谢家集区"},{"code":"340405","name":"八公山区"},{"code":"340406","name":"潘集区"},{"code":"340421","name":"凤台县"},{"code":"340422","name":"寿县"}]},{"code":"3405","name":"马鞍山市","children":[{"code":"340503","name":"花山区"},{"code":"340504","name":"雨山区"},{"code":"340506","name":"博望区"},{"code":"340521","name":"当涂县"},{"code":"340522","name":"含山县"},{"code":"340523","name":"和县"}]},{"code":"3406","name":"淮北市","children":[{"code":"340602","name":"杜集区"},{"code":"340603","name":"相山区"},{"code":"340604","name":"烈山区"},{"code":"340621","name":"濉溪县"}]},{"code":"3407","name":"铜陵市","children":[{"code":"340705","name":"铜官区"},{"code":"340706","name":"义安区"},{"code":"340711","name":"郊区"},{"code":"340722","name":"枞阳县"}]},{"code":"3408","name":"安庆市","children":[{"code":"340802","name":"迎江区"},{"code":"340803","name":"大观区"},{"code":"340811","name":"宜秀区"},{"code":"340822","name":"怀宁县"},{"code":"340825","name":"太湖县"},{"code":"340826","name":"宿松县"},{"code":"340827","name":"望江县"},{"code":"340828","name":"岳西县"},{"code":"340871","name":"安徽安庆经济开发区"},{"code":"340881","name":"桐城市"},{"code":"340882","name":"潜山市"}]},{"code":"3410","name":"黄山市","children":[{"code":"341002","name":"屯溪区"},{"code":"341003","name":"黄山区"},{"code":"341004","name":"徽州区"},{"code":"341021","name":"歙县"},{"code":"341022","name":"休宁县"},{"code":"341023","name":"黟县"},{"code":"341024","name":"祁门县"}]},{"code":"3411","name":"滁州市","children":[{"code":"341102","name":"琅琊区"},{"code":"341103","name":"南谯区"},{"code":"341122","name":"来安县"},{"code":"341124","name":"全椒县"},{"code":"341125","name":"定远县"},{"code":"341126","name":"凤阳县"},{"code":"341171","name":"中新苏滁高新技术产业开发区"},{"code":"341172","name":"滁州经济技术开发区"},{"code":"341181","name":"天长市"},{"code":"341182","name":"明光市"}]},{"code":"3412","name":"阜阳市","children":[{"code":"341202","name":"颍州区"},{"code":"341203","name":"颍东区"},{"code":"341204","name":"颍泉区"},{"code":"341221","name":"临泉县"},{"code":"341222","name":"太和县"},{"code":"341225","name":"阜南县"},{"code":"341226","name":"颍上县"},{"code":"341271","name":"阜阳合肥现代产业园区"},{"code":"341272","name":"阜阳经济技术开发区"},{"code":"341282","name":"界首市"}]},{"code":"3413","name":"宿州市","children":[{"code":"341302","name":"埇桥区"},{"code":"341321","name":"砀山县"},{"code":"341322","name":"萧县"},{"code":"341323","name":"灵璧县"},{"code":"341324","name":"泗县"},{"code":"341371","name":"宿州马鞍山现代产业园区"},{"code":"341372","name":"宿州经济技术开发区"}]},{"code":"3415","name":"六安市","children":[{"code":"341502","name":"金安区"},{"code":"341503","name":"裕安区"},{"code":"341504","name":"叶集区"},{"code":"341522","name":"霍邱县"},{"code":"341523","name":"舒城县"},{"code":"341524","name":"金寨县"},{"code":"341525","name":"霍山县"}]},{"code":"3416","name":"亳州市","children":[{"code":"341602","name":"谯城区"},{"code":"341621","name":"涡阳县"},{"code":"341622","name":"蒙城县"},{"code":"341623","name":"利辛县"}]},{"code":"3417","name":"池州市","children":[{"code":"341702","name":"贵池区"},{"code":"341721","name":"东至县"},{"code":"341722","name":"石台县"},{"code":"341723","name":"青阳县"}]},{"code":"3418","name":"宣城市","children":[{"code":"341802","name":"宣州区"},{"code":"341821","name":"郎溪县"},{"code":"341823","name":"泾县"},{"code":"341824","name":"绩溪县"},{"code":"341825","name":"旌德县"},{"code":"341871","name":"宣城市经济开发区"},{"code":"341881","name":"宁国市"},{"code":"341882","name":"广德市"}]}]},{"code":"35","name":"福建省","children":[{"code":"3501","name":"福州市","children":[{"code":"350102","name":"鼓楼区"},{"code":"350103","name":"台江区"},{"code":"350104","name":"仓山区"},{"code":"350105","name":"马尾区"},{"code":"350111","name":"晋安区"},{"code":"350112","name":"长乐区"},{"code":"350121","name":"闽侯县"},{"code":"350122","name":"连江县"},{"code":"350123","name":"罗源县"},{"code":"350124","name":"闽清县"},{"code":"350125","name":"永泰县"},{"code":"350128","name":"平潭县"},{"code":"350181","name":"福清市"}]},{"code":"3502","name":"厦门市","children":[{"code":"350203","name":"思明区"},{"code":"350205","name":"海沧区"},{"code":"350206","name":"湖里区"},{"code":"350211","name":"集美区"},{"code":"350212","name":"同安区"},{"code":"350213","name":"翔安区"}]},{"code":"3503","name":"莆田市","children":[{"code":"350302","name":"城厢区"},{"code":"350303","name":"涵江区"},{"code":"350304","name":"荔城区"},{"code":"350305","name":"秀屿区"},{"code":"350322","name":"仙游县"}]},{"code":"3504","name":"三明市","children":[{"code":"350404","name":"三元区"},{"code":"350405","name":"沙县区"},{"code":"350421","name":"明溪县"},{"code":"350423","name":"清流县"},{"code":"350424","name":"宁化县"},{"code":"350425","name":"大田县"},{"code":"350426","name":"尤溪县"},{"code":"350428","name":"将乐县"},{"code":"350429","name":"泰宁县"},{"code":"350430","name":"建宁县"},{"code":"350481","name":"永安市"}]},{"code":"3505","name":"泉州市","children":[{"code":"350502","name":"鲤城区"},{"code":"350503","name":"丰泽区"},{"code":"350504","name":"洛江区"},{"code":"350505","name":"泉港区"},{"code":"350521","name":"惠安县"},{"code":"350524","name":"安溪县"},{"code":"350525","name":"永春县"},{"code":"350526","name":"德化县"},{"code":"350527","name":"金门县"},{"code":"350581","name":"石狮市"},{"code":"350582","name":"晋江市"},{"code":"350583","name":"南安市"}]},{"code":"3506","name":"漳州市","children":[{"code":"350602","name":"芗城区"},{"code":"350603","name":"龙文区"},{"code":"350604","name":"龙海区"},{"code":"350605","name":"长泰区"},{"code":"350622","name":"云霄县"},{"code":"350623","name":"漳浦县"},{"code":"350624","name":"诏安县"},{"code":"350626","name":"东山县"},{"code":"350627","name":"南靖县"},{"code":"350628","name":"平和县"},{"code":"350629","name":"华安县"}]},{"code":"3507","name":"南平市","children":[{"code":"350702","name":"延平区"},{"code":"350703","name":"建阳区"},{"code":"350721","name":"顺昌县"},{"code":"350722","name":"浦城县"},{"code":"350723","name":"光泽县"},{"code":"350724","name":"松溪县"},{"code":"350725","name":"政和县"},{"code":"350781","name":"邵武市"},{"code":"350782","name":"武夷山市"},{"code":"350783","name":"建瓯市"}]},{"code":"3508","name":"龙岩市","children":[{"code":"350802","name":"新罗区"},{"code":"350803","name":"永定区"},{"code":"350821","name":"长汀县"},{"code":"350823","name":"上杭县"},{"code":"350824","name":"武平县"},{"code":"350825","name":"连城县"},{"code":"350881","name":"漳平市"}]},{"code":"3509","name":"宁德市","children":[{"code":"350902","name":"蕉城区"},{"code":"350921","name":"霞浦县"},{"code":"350922","name":"古田县"},{"code":"350923","name":"屏南县"},{"code":"350924","name":"寿宁县"},{"code":"350925","name":"周宁县"},{"code":"350926","name":"柘荣县"},{"code":"350981","name":"福安市"},{"code":"350982","name":"福鼎市"}]}]},{"code":"36","name":"江西省","children":[{"code":"3601","name":"南昌市","children":[{"code":"360102","name":"东湖区"},{"code":"360103","name":"西湖区"},{"code":"360104","name":"青云谱区"},{"code":"360111","name":"青山湖区"},{"code":"360112","name":"新建区"},{"code":"360113","name":"红谷滩区"},{"code":"360121","name":"南昌县"},{"code":"360123","name":"安义县"},{"code":"360124","name":"进贤县"}]},{"code":"3602","name":"景德镇市","children":[{"code":"360202","name":"昌江区"},{"code":"360203","name":"珠山区"},{"code":"360222","name":"浮梁县"},{"code":"360281","name":"乐平市"}]},{"code":"3603","name":"萍乡市","children":[{"code":"360302","name":"安源区"},{"code":"360313","name":"湘东区"},{"code":"360321","name":"莲花县"},{"code":"360322","name":"上栗县"},{"code":"360323","name":"芦溪县"}]},{"code":"3604","name":"九江市","children":[{"code":"360402","name":"濂溪区"},{"code":"360403","name":"浔阳区"},{"code":"360404","name":"柴桑区"},{"code":"360423","name":"武宁县"},{"code":"360424","name":"修水县"},{"code":"360425","name":"永修县"},{"code":"360426","name":"德安县"},{"code":"360428","name":"都昌县"},{"code":"360429","name":"湖口县"},{"code":"360430","name":"彭泽县"},{"code":"360481","name":"瑞昌市"},{"code":"360482","name":"共青城市"},{"code":"360483","name":"庐山市"}]},{"code":"3605","name":"新余市","children":[{"code":"360502","name":"渝水区"},{"code":"360521","name":"分宜县"}]},{"code":"3606","name":"鹰潭市","children":[{"code":"360602","name":"月湖区"},{"code":"360603","name":"余江区"},{"code":"360681","name":"贵溪市"}]},{"code":"3607","name":"赣州市","children":[{"code":"360702","name":"章贡区"},{"code":"360703","name":"南康区"},{"code":"360704","name":"赣县区"},{"code":"360722","name":"信丰县"},{"code":"360723","name":"大余县"},{"code":"360724","name":"上犹县"},{"code":"360725","name":"崇义县"},{"code":"360726","name":"安远县"},{"code":"360728","name":"定南县"},{"code":"360729","name":"全南县"},{"code":"360730","name":"宁都县"},{"code":"360731","name":"于都县"},{"code":"360732","name":"兴国县"},{"code":"360733","name":"会昌县"},{"code":"360734","name":"寻乌县"},{"code":"360735","name":"石城县"},{"code":"360781","name":"瑞金市"},{"code":"360783","name":"龙南市"}]},{"code":"3608","name":"吉安市","children":[{"code":"360802","name":"吉州区"},{"code":"360803","name":"青原区"},{"code":"360821","name":"吉安县"},{"code":"360822","name":"吉水县"},{"code":"360823","name":"峡江县"},{"code":"360824","name":"新干县"},{"code":"360825","name":"永丰县"},{"code":"360826","name":"泰和县"},{"code":"360827","name":"遂川县"},{"code":"360828","name":"万安县"},{"code":"360829","name":"安福县"},{"code":"360830","name":"永新县"},{"code":"360881","name":"井冈山市"}]},{"code":"3609","name":"宜春市","children":[{"code":"360902","name":"袁州区"},{"code":"360921","name":"奉新县"},{"code":"360922","name":"万载县"},{"code":"360923","name":"上高县"},{"code":"360924","name":"宜丰县"},{"code":"360925","name":"靖安县"},{"code":"360926","name":"铜鼓县"},{"code":"360981","name":"丰城市"},{"code":"360982","name":"樟树市"},{"code":"360983","name":"高安市"}]},{"code":"3610","name":"抚州市","children":[{"code":"361002","name":"临川区"},{"code":"361003","name":"东乡区"},{"code":"361021","name":"南城县"},{"code":"361022","name":"黎川县"},{"code":"361023","name":"南丰县"},{"code":"361024","name":"崇仁县"},{"code":"361025","name":"乐安县"},{"code":"361026","name":"宜黄县"},{"code":"361027","name":"金溪县"},{"code":"361028","name":"资溪县"},{"code":"361030","name":"广昌县"}]},{"code":"3611","name":"上饶市","children":[{"code":"361102","name":"信州区"},{"code":"361103","name":"广丰区"},{"code":"361104","name":"广信区"},{"code":"361123","name":"玉山县"},{"code":"361124","name":"铅山县"},{"code":"361125","name":"横峰县"},{"code":"361126","name":"弋阳县"},{"code":"361127","name":"余干县"},{"code":"361128","name":"鄱阳县"},{"code":"361129","name":"万年县"},{"code":"361130","name":"婺源县"},{"code":"361181","name":"德兴市"}]}]},{"code":"37","name":"山东省","children":[{"code":"3701","name":"济南市","children":[{"code":"370102","name":"历下区"},{"code":"370103","name":"市中区"},{"code":"370104","name":"槐荫区"},{"code":"370105","name":"天桥区"},{"code":"370112","name":"历城区"},{"code":"370113","name":"长清区"},{"code":"370114","name":"章丘区"},{"code":"370115","name":"济阳区"},{"code":"370116","name":"莱芜区"},{"code":"370117","name":"钢城区"},{"code":"370124","name":"平阴县"},{"code":"370126","name":"商河县"},{"code":"370176","name":"济南高新技术产业开发区"}]},{"code":"3702","name":"青岛市","children":[{"code":"370202","name":"市南区"},{"code":"370203","name":"市北区"},{"code":"370211","name":"黄岛区"},{"code":"370212","name":"崂山区"},{"code":"370213","name":"李沧区"},{"code":"370214","name":"城阳区"},{"code":"370215","name":"即墨区"},{"code":"370281","name":"胶州市"},{"code":"370283","name":"平度市"},{"code":"370285","name":"莱西市"}]},{"code":"3703","name":"淄博市","children":[{"code":"370302","name":"淄川区"},{"code":"370303","name":"张店区"},{"code":"370304","name":"博山区"},{"code":"370305","name":"临淄区"},{"code":"370306","name":"周村区"},{"code":"370321","name":"桓台县"},{"code":"370322","name":"高青县"},{"code":"370323","name":"沂源县"}]},{"code":"3704","name":"枣庄市","children":[{"code":"370402","name":"市中区"},{"code":"370403","name":"薛城区"},{"code":"370404","name":"峄城区"},{"code":"370405","name":"台儿庄区"},{"code":"370406","name":"山亭区"},{"code":"370481","name":"滕州市"}]},{"code":"3705","name":"东营市","children":[{"code":"370502","name":"东营区"},{"code":"370503","name":"河口区"},{"code":"370505","name":"垦利区"},{"code":"370522","name":"利津县"},{"code":"370523","name":"广饶县"},{"code":"370571","name":"东营经济技术开发区"},{"code":"370572","name":"东营港经济开发区"}]},{"code":"3706","name":"烟台市","children":[{"code":"370602","name":"芝罘区"},{"code":"370611","name":"福山区"},{"code":"370612","name":"牟平区"},{"code":"370613","name":"莱山区"},{"code":"370614","name":"蓬莱区"},{"code":"370671","name":"烟台高新技术产业开发区"},{"code":"370676","name":"烟台经济技术开发区"},{"code":"370681","name":"龙口市"},{"code":"370682","name":"莱阳市"},{"code":"370683","name":"莱州市"},{"code":"370685","name":"招远市"},{"code":"370686","name":"栖霞市"},{"code":"370687","name":"海阳市"}]},{"code":"3707","name":"潍坊市","children":[{"code":"370702","name":"潍城区"},{"code":"370703","name":"寒亭区"},{"code":"370704","name":"坊子区"},{"code":"370705","name":"奎文区"},{"code":"370724","name":"临朐县"},{"code":"370725","name":"昌乐县"},{"code":"370772","name":"潍坊滨海经济技术开发区"},{"code":"370781","name":"青州市"},{"code":"370782","name":"诸城市"},{"code":"370783","name":"寿光市"},{"code":"370784","name":"安丘市"},{"code":"370785","name":"高密市"},{"code":"370786","name":"昌邑市"}]},{"code":"3708","name":"济宁市","children":[{"code":"370811","name":"任城区"},{"code":"370812","name":"兖州区"},{"code":"370826","name":"微山县"},{"code":"370827","name":"鱼台县"},{"code":"370828","name":"金乡县"},{"code":"370829","name":"嘉祥县"},{"code":"370830","name":"汶上县"},{"code":"370831","name":"泗水县"},{"code":"370832","name":"梁山县"},{"code":"370871","name":"济宁高新技术产业开发区"},{"code":"370881","name":"曲阜市"},{"code":"370883","name":"邹城市"}]},{"code":"3709","name":"泰安市","children":[{"code":"370902","name":"泰山区"},{"code":"370911","name":"岱岳区"},{"code":"370921","name":"宁阳县"},{"code":"370923","name":"东平县"},{"code":"370982","name":"新泰市"},{"code":"370983","name":"肥城市"}]},{"code":"3710","name":"威海市","children":[{"code":"371002","name":"环翠区"},{"code":"371003","name":"文登区"},{"code":"371071","name":"威海火炬高技术产业开发区"},{"code":"371072","name":"威海经济技术开发区"},{"code":"371073","name":"威海临港经济技术开发区"},{"code":"371082","name":"荣成市"},{"code":"371083","name":"乳山市"}]},{"code":"3711","name":"日照市","children":[{"code":"371102","name":"东港区"},{"code":"371103","name":"岚山区"},{"code":"371121","name":"五莲县"},{"code":"371122","name":"莒县"},{"code":"371171","name":"日照经济技术开发区"}]},{"code":"3713","name":"临沂市","children":[{"code":"371302","name":"兰山区"},{"code":"371311","name":"罗庄区"},{"code":"371312","name":"河东区"},{"code":"371321","name":"沂南县"},{"code":"371322","name":"郯城县"},{"code":"371323","name":"沂水县"},{"code":"371324","name":"兰陵县"},{"code":"371325","name":"费县"},{"code":"371326","name":"平邑县"},{"code":"371327","name":"莒南县"},{"code":"371328","name":"蒙阴县"},{"code":"371329","name":"临沭县"},{"code":"371371","name":"临沂高新技术产业开发区"}]},{"code":"3714","name":"德州市","children":[{"code":"371402","name":"德城区"},{"code":"371403","name":"陵城区"},{"code":"371422","name":"宁津县"},{"code":"371423","name":"庆云县"},{"code":"371424","name":"临邑县"},{"code":"371425","name":"齐河县"},{"code":"371426","name":"平原县"},{"code":"371427","name":"夏津县"},{"code":"371428","name":"武城县"},{"code":"371471","name":"德州天衢新区"},{"code":"371481","name":"乐陵市"},{"code":"371482","name":"禹城市"}]},{"code":"3715","name":"聊城市","children":[{"code":"371502","name":"东昌府区"},{"code":"371503","name":"茌平区"},{"code":"371521","name":"阳谷县"},{"code":"371522","name":"莘县"},{"code":"371524","name":"东阿县"},{"code":"371525","name":"冠县"},{"code":"371526","name":"高唐县"},{"code":"371581","name":"临清市"}]},{"code":"3716","name":"滨州市","children":[{"code":"371602","name":"滨城区"},{"code":"371603","name":"沾化区"},{"code":"371621","name":"惠民县"},{"code":"371622","name":"阳信县"},{"code":"371623","name":"无棣县"},{"code":"371625","name":"博兴县"},{"code":"371681","name":"邹平市"}]},{"code":"3717","name":"菏泽市","children":[{"code":"371702","name":"牡丹区"},{"code":"371703","name":"定陶区"},{"code":"371721","name":"曹县"},{"code":"371722","name":"单县"},{"code":"371723","name":"成武县"},{"code":"371724","name":"巨野县"},{"code":"371725","name":"郓城县"},{"code":"371726","name":"鄄城县"},{"code":"371728","name":"东明县"},{"code":"371771","name":"菏泽经济技术开发区"},{"code":"371772","name":"菏泽高新技术开发区"}]}]},{"code":"41","name":"河南省","children":[{"code":"4101","name":"郑州市","children":[{"code":"410102","name":"中原区"},{"code":"410103","name":"二七区"},{"code":"410104","name":"管城回族区"},{"code":"410105","name":"金水区"},{"code":"410106","name":"上街区"},{"code":"410108","name":"惠济区"},{"code":"410122","name":"中牟县"},{"code":"410171","name":"郑州经济技术开发区"},{"code":"410172","name":"郑州高新技术产业开发区"},{"code":"410173","name":"郑州航空港经济综合实验区"},{"code":"410181","name":"巩义市"},{"code":"410182","name":"荥阳市"},{"code":"410183","name":"新密市"},{"code":"410184","name":"新郑市"},{"code":"410185","name":"登封市"}]},{"code":"4102","name":"开封市","children":[{"code":"410202","name":"龙亭区"},{"code":"410203","name":"顺河回族区"},{"code":"410204","name":"鼓楼区"},{"code":"410205","name":"禹王台区"},{"code":"410212","name":"祥符区"},{"code":"410221","name":"杞县"},{"code":"410222","name":"通许县"},{"code":"410223","name":"尉氏县"},{"code":"410225","name":"兰考县"}]},{"code":"4103","name":"洛阳市","children":[{"code":"410302","name":"老城区"},{"code":"410303","name":"西工区"},{"code":"410304","name":"瀍河回族区"},{"code":"410305","name":"涧西区"},{"code":"410307","name":"偃师区"},{"code":"410308","name":"孟津区"},{"code":"410311","name":"洛龙区"},{"code":"410323","name":"新安县"},{"code":"410324","name":"栾川县"},{"code":"410325","name":"嵩县"},{"code":"410326","name":"汝阳县"},{"code":"410327","name":"宜阳县"},{"code":"410328","name":"洛宁县"},{"code":"410329","name":"伊川县"},{"code":"410371","name":"洛阳高新技术产业开发区"}]},{"code":"4104","name":"平顶山市","children":[{"code":"410402","name":"新华区"},{"code":"410403","name":"卫东区"},{"code":"410404","name":"石龙区"},{"code":"410411","name":"湛河区"},{"code":"410421","name":"宝丰县"},{"code":"410422","name":"叶县"},{"code":"410423","name":"鲁山县"},{"code":"410425","name":"郏县"},{"code":"410471","name":"平顶山高新技术产业开发区"},{"code":"410472","name":"平顶山市城乡一体化示范区"},{"code":"410481","name":"舞钢市"},{"code":"410482","name":"汝州市"}]},{"code":"4105","name":"安阳市","children":[{"code":"410502","name":"文峰区"},{"code":"410503","name":"北关区"},{"code":"410505","name":"殷都区"},{"code":"410506","name":"龙安区"},{"code":"410522","name":"安阳县"},{"code":"410523","name":"汤阴县"},{"code":"410526","name":"滑县"},{"code":"410527","name":"内黄县"},{"code":"410571","name":"安阳高新技术产业开发区"},{"code":"410581","name":"林州市"}]},{"code":"4106","name":"鹤壁市","children":[{"code":"410602","name":"鹤山区"},{"code":"410603","name":"山城区"},{"code":"410611","name":"淇滨区"},{"code":"410621","name":"浚县"},{"code":"410622","name":"淇县"},{"code":"410671","name":"鹤壁经济技术开发区"}]},{"code":"4107","name":"新乡市","children":[{"code":"410702","name":"红旗区"},{"code":"410703","name":"卫滨区"},{"code":"410704","name":"凤泉区"},{"code":"410711","name":"牧野区"},{"code":"410721","name":"新乡县"},{"code":"410724","name":"获嘉县"},{"code":"410725","name":"原阳县"},{"code":"410726","name":"延津县"},{"code":"410727","name":"封丘县"},{"code":"410771","name":"新乡高新技术产业开发区"},{"code":"410772","name":"新乡经济技术开发区"},{"code":"410773","name":"新乡市平原城乡一体化示范区"},{"code":"410781","name":"卫辉市"},{"code":"410782","name":"辉县市"},{"code":"410783","name":"长垣市"}]},{"code":"4108","name":"焦作市","children":[{"code":"410802","name":"解放区"},{"code":"410803","name":"中站区"},{"code":"410804","name":"马村区"},{"code":"410811","name":"山阳区"},{"code":"410821","name":"修武县"},{"code":"410822","name":"博爱县"},{"code":"410823","name":"武陟县"},{"code":"410825","name":"温县"},{"code":"410871","name":"焦作城乡一体化示范区"},{"code":"410882","name":"沁阳市"},{"code":"410883","name":"孟州市"}]},{"code":"4109","name":"濮阳市","children":[{"code":"410902","name":"华龙区"},{"code":"410922","name":"清丰县"},{"code":"410923","name":"南乐县"},{"code":"410926","name":"范县"},{"code":"410927","name":"台前县"},{"code":"410928","name":"濮阳县"},{"code":"410971","name":"河南濮阳工业园区"},{"code":"410972","name":"濮阳经济技术开发区"}]},{"code":"4110","name":"许昌市","children":[{"code":"411002","name":"魏都区"},{"code":"411003","name":"建安区"},{"code":"411024","name":"鄢陵县"},{"code":"411025","name":"襄城县"},{"code":"411071","name":"许昌经济技术开发区"},{"code":"411081","name":"禹州市"},{"code":"411082","name":"长葛市"}]},{"code":"4111","name":"漯河市","children":[{"code":"411102","name":"源汇区"},{"code":"411103","name":"郾城区"},{"code":"411104","name":"召陵区"},{"code":"411121","name":"舞阳县"},{"code":"411122","name":"临颍县"},{"code":"411171","name":"漯河经济技术开发区"}]},{"code":"4112","name":"三门峡市","children":[{"code":"411202","name":"湖滨区"},{"code":"411203","name":"陕州区"},{"code":"411221","name":"渑池县"},{"code":"411224","name":"卢氏县"},{"code":"411271","name":"河南三门峡经济开发区"},{"code":"411281","name":"义马市"},{"code":"411282","name":"灵宝市"}]},{"code":"4113","name":"南阳市","children":[{"code":"411302","name":"宛城区"},{"code":"411303","name":"卧龙区"},{"code":"411321","name":"南召县"},{"code":"411322","name":"方城县"},{"code":"411323","name":"西峡县"},{"code":"411324","name":"镇平县"},{"code":"411325","name":"内乡县"},{"code":"411326","name":"淅川县"},{"code":"411327","name":"社旗县"},{"code":"411328","name":"唐河县"},{"code":"411329","name":"新野县"},{"code":"411330","name":"桐柏县"},{"code":"411371","name":"南阳高新技术产业开发区"},{"code":"411372","name":"南阳市城乡一体化示范区"},{"code":"411381","name":"邓州市"}]},{"code":"4114","name":"商丘市","children":[{"code":"411402","name":"梁园区"},{"code":"411403","name":"睢阳区"},{"code":"411421","name":"民权县"},{"code":"411422","name":"睢县"},{"code":"411423","name":"宁陵县"},{"code":"411424","name":"柘城县"},{"code":"411425","name":"虞城县"},{"code":"411426","name":"夏邑县"},{"code":"411471","name":"豫东综合物流产业聚集区"},{"code":"411472","name":"河南商丘经济开发区"},{"code":"411481","name":"永城市"}]},{"code":"4115","name":"信阳市","children":[{"code":"411502","name":"浉河区"},{"code":"411503","name":"平桥区"},{"code":"411521","name":"罗山县"},{"code":"411522","name":"光山县"},{"code":"411523","name":"新县"},{"code":"411524","name":"商城县"},{"code":"411525","name":"固始县"},{"code":"411526","name":"潢川县"},{"code":"411527","name":"淮滨县"},{"code":"411528","name":"息县"},{"code":"411571","name":"信阳高新技术产业开发区"}]},{"code":"4116","name":"周口市","children":[{"code":"411602","name":"川汇区"},{"code":"411603","name":"淮阳区"},{"code":"411621","name":"扶沟县"},{"code":"411622","name":"西华县"},{"code":"411623","name":"商水县"},{"code":"411624","name":"沈丘县"},{"code":"411625","name":"郸城县"},{"code":"411627","name":"太康县"},{"code":"411628","name":"鹿邑县"},{"code":"411671","name":"周口临港开发区"},{"code":"411681","name":"项城市"}]},{"code":"4117","name":"驻马店市","children":[{"code":"411702","name":"驿城区"},{"code":"411721","name":"西平县"},{"code":"411722","name":"上蔡县"},{"code":"411723","name":"平舆县"},{"code":"411724","name":"正阳县"},{"code":"411725","name":"确山县"},{"code":"411726","name":"泌阳县"},{"code":"411727","name":"汝南县"},{"code":"411728","name":"遂平县"},{"code":"411729","name":"新蔡县"},{"code":"411771","name":"河南驻马店经济开发区"}]},{"code":"4190","name":"省直辖县级行政区划","children":[{"code":"419001","name":"济源市"}]}]},{"code":"42","name":"湖北省","children":[{"code":"4201","name":"武汉市","children":[{"code":"420102","name":"江岸区"},{"code":"420103","name":"江汉区"},{"code":"420104","name":"硚口区"},{"code":"420105","name":"汉阳区"},{"code":"420106","name":"武昌区"},{"code":"420107","name":"青山区"},{"code":"420111","name":"洪山区"},{"code":"420112","name":"东西湖区"},{"code":"420113","name":"汉南区"},{"code":"420114","name":"蔡甸区"},{"code":"420115","name":"江夏区"},{"code":"420116","name":"黄陂区"},{"code":"420117","name":"新洲区"}]},{"code":"4202","name":"黄石市","children":[{"code":"420202","name":"黄石港区"},{"code":"420203","name":"西塞山区"},{"code":"420204","name":"下陆区"},{"code":"420205","name":"铁山区"},{"code":"420222","name":"阳新县"},{"code":"420281","name":"大冶市"}]},{"code":"4203","name":"十堰市","children":[{"code":"420302","name":"茅箭区"},{"code":"420303","name":"张湾区"},{"code":"420304","name":"郧阳区"},{"code":"420322","name":"郧西县"},{"code":"420323","name":"竹山县"},{"code":"420324","name":"竹溪县"},{"code":"420325","name":"房县"},{"code":"420381","name":"丹江口市"}]},{"code":"4205","name":"宜昌市","children":[{"code":"420502","name":"西陵区"},{"code":"420503","name":"伍家岗区"},{"code":"420504","name":"点军区"},{"code":"420505","name":"猇亭区"},{"code":"420506","name":"夷陵区"},{"code":"420525","name":"远安县"},{"code":"420526","name":"兴山县"},{"code":"420527","name":"秭归县"},{"code":"420528","name":"长阳土家族自治县"},{"code":"420529","name":"五峰土家族自治县"},{"code":"420581","name":"宜都市"},{"code":"420582","name":"当阳市"},{"code":"420583","name":"枝江市"}]},{"code":"4206","name":"襄阳市","children":[{"code":"420602","name":"襄城区"},{"code":"420606","name":"樊城区"},{"code":"420607","name":"襄州区"},{"code":"420624","name":"南漳县"},{"code":"420625","name":"谷城县"},{"code":"420626","name":"保康县"},{"code":"420682","name":"老河口市"},{"code":"420683","name":"枣阳市"},{"code":"420684","name":"宜城市"}]},{"code":"4207","name":"鄂州市","children":[{"code":"420702","name":"梁子湖区"},{"code":"420703","name":"华容区"},{"code":"420704","name":"鄂城区"}]},{"code":"4208","name":"荆门市","children":[{"code":"420802","name":"东宝区"},{"code":"420804","name":"掇刀区"},{"code":"420822","name":"沙洋县"},{"code":"420881","name":"钟祥市"},{"code":"420882","name":"京山市"}]},{"code":"4209","name":"孝感市","children":[{"code":"420902","name":"孝南区"},{"code":"420921","name":"孝昌县"},{"code":"420922","name":"大悟县"},{"code":"420923","name":"云梦县"},{"code":"420981","name":"应城市"},{"code":"420982","name":"安陆市"},{"code":"420984","name":"汉川市"}]},{"code":"4210","name":"荆州市","children":[{"code":"421002","name":"沙市区"},{"code":"421003","name":"荆州区"},{"code":"421022","name":"公安县"},{"code":"421024","name":"江陵县"},{"code":"421071","name":"荆州经济技术开发区"},{"code":"421081","name":"石首市"},{"code":"421083","name":"洪湖市"},{"code":"421087","name":"松滋市"},{"code":"421088","name":"监利市"}]},{"code":"4211","name":"黄冈市","children":[{"code":"421102","name":"黄州区"},{"code":"421121","name":"团风县"},{"code":"421122","name":"红安县"},{"code":"421123","name":"罗田县"},{"code":"421124","name":"英山县"},{"code":"421125","name":"浠水县"},{"code":"421126","name":"蕲春县"},{"code":"421127","name":"黄梅县"},{"code":"421171","name":"龙感湖管理区"},{"code":"421181","name":"麻城市"},{"code":"421182","name":"武穴市"}]},{"code":"4212","name":"咸宁市","children":[{"code":"421202","name":"咸安区"},{"code":"421221","name":"嘉鱼县"},{"code":"421222","name":"通城县"},{"code":"421223","name":"崇阳县"},{"code":"421224","name":"通山县"},{"code":"421281","name":"赤壁市"}]},{"code":"4213","name":"随州市","children":[{"code":"421303","name":"曾都区"},{"code":"421321","name":"随县"},{"code":"421381","name":"广水市"}]},{"code":"4228","name":"恩施土家族苗族自治州","children":[{"code":"422801","name":"恩施市"},{"code":"422802","name":"利川市"},{"code":"422822","name":"建始县"},{"code":"422823","name":"巴东县"},{"code":"422825","name":"宣恩县"},{"code":"422826","name":"咸丰县"},{"code":"422827","name":"来凤县"},{"code":"422828","name":"鹤峰县"}]},{"code":"4290","name":"省直辖县级行政区划","children":[{"code":"429004","name":"仙桃市"},{"code":"429005","name":"潜江市"},{"code":"429006","name":"天门市"},{"code":"429021","name":"神农架林区"}]}]},{"code":"43","name":"湖南省","children":[{"code":"4301","name":"长沙市","children":[{"code":"430102","name":"芙蓉区"},{"code":"430103","name":"天心区"},{"code":"430104","name":"岳麓区"},{"code":"430105","name":"开福区"},{"code":"430111","name":"雨花区"},{"code":"430112","name":"望城区"},{"code":"430121","name":"长沙县"},{"code":"430181","name":"浏阳市"},{"code":"430182","name":"宁乡市"}]},{"code":"4302","name":"株洲市","children":[{"code":"430202","name":"荷塘区"},{"code":"430203","name":"芦淞区"},{"code":"430204","name":"石峰区"},{"code":"430211","name":"天元区"},{"code":"430212","name":"渌口区"},{"code":"430223","name":"攸县"},{"code":"430224","name":"茶陵县"},{"code":"430225","name":"炎陵县"},{"code":"430281","name":"醴陵市"}]},{"code":"4303","name":"湘潭市","children":[{"code":"430302","name":"雨湖区"},{"code":"430304","name":"岳塘区"},{"code":"430321","name":"湘潭县"},{"code":"430371","name":"湖南湘潭高新技术产业园区"},{"code":"430372","name":"湘潭昭山示范区"},{"code":"430373","name":"湘潭九华示范区"},{"code":"430381","name":"湘乡市"},{"code":"430382","name":"韶山市"}]},{"code":"4304","name":"衡阳市","children":[{"code":"430405","name":"珠晖区"},{"code":"430406","name":"雁峰区"},{"code":"430407","name":"石鼓区"},{"code":"430408","name":"蒸湘区"},{"code":"430412","name":"南岳区"},{"code":"430421","name":"衡阳县"},{"code":"430422","name":"衡南县"},{"code":"430423","name":"衡山县"},{"code":"430424","name":"衡东县"},{"code":"430426","name":"祁东县"},{"code":"430473","name":"湖南衡阳松木经济开发区"},{"code":"430476","name":"湖南衡阳高新技术产业园区"},{"code":"430481","name":"耒阳市"},{"code":"430482","name":"常宁市"}]},{"code":"4305","name":"邵阳市","children":[{"code":"430502","name":"双清区"},{"code":"430503","name":"大祥区"},{"code":"430511","name":"北塔区"},{"code":"430522","name":"新邵县"},{"code":"430523","name":"邵阳县"},{"code":"430524","name":"隆回县"},{"code":"430525","name":"洞口县"},{"code":"430527","name":"绥宁县"},{"code":"430528","name":"新宁县"},{"code":"430529","name":"城步苗族自治县"},{"code":"430581","name":"武冈市"},{"code":"430582","name":"邵东市"}]},{"code":"4306","name":"岳阳市","children":[{"code":"430602","name":"岳阳楼区"},{"code":"430603","name":"云溪区"},{"code":"430611","name":"君山区"},{"code":"430621","name":"岳阳县"},{"code":"430623","name":"华容县"},{"code":"430624","name":"湘阴县"},{"code":"430626","name":"平江县"},{"code":"430671","name":"岳阳市屈原管理区"},{"code":"430681","name":"汨罗市"},{"code":"430682","name":"临湘市"}]},{"code":"4307","name":"常德市","children":[{"code":"430702","name":"武陵区"},{"code":"430703","name":"鼎城区"},{"code":"430721","name":"安乡县"},{"code":"430722","name":"汉寿县"},{"code":"430723","name":"澧县"},{"code":"430724","name":"临澧县"},{"code":"430725","name":"桃源县"},{"code":"430726","name":"石门县"},{"code":"430771","name":"常德市西洞庭管理区"},{"code":"430781","name":"津市市"}]},{"code":"4308","name":"张家界市","children":[{"code":"430802","name":"永定区"},{"code":"430811","name":"武陵源区"},{"code":"430821","name":"慈利县"},{"code":"430822","name":"桑植县"}]},{"code":"4309","name":"益阳市","children":[{"code":"430902","name":"资阳区"},{"code":"430903","name":"赫山区"},{"code":"430921","name":"南县"},{"code":"430922","name":"桃江县"},{"code":"430923","name":"安化县"},{"code":"430971","name":"益阳市大通湖管理区"},{"code":"430972","name":"湖南益阳高新技术产业园区"},{"code":"430981","name":"沅江市"}]},{"code":"4310","name":"郴州市","children":[{"code":"431002","name":"北湖区"},{"code":"431003","name":"苏仙区"},{"code":"431021","name":"桂阳县"},{"code":"431022","name":"宜章县"},{"code":"431023","name":"永兴县"},{"code":"431024","name":"嘉禾县"},{"code":"431025","name":"临武县"},{"code":"431026","name":"汝城县"},{"code":"431027","name":"桂东县"},{"code":"431028","name":"安仁县"},{"code":"431081","name":"资兴市"}]},{"code":"4311","name":"永州市","children":[{"code":"431102","name":"零陵区"},{"code":"431103","name":"冷水滩区"},{"code":"431122","name":"东安县"},{"code":"431123","name":"双牌县"},{"code":"431124","name":"道县"},{"code":"431125","name":"江永县"},{"code":"431126","name":"宁远县"},{"code":"431127","name":"蓝山县"},{"code":"431128","name":"新田县"},{"code":"431129","name":"江华瑶族自治县"},{"code":"431171","name":"永州经济技术开发区"},{"code":"431173","name":"永州市回龙圩管理区"},{"code":"431181","name":"祁阳市"}]},{"code":"4312","name":"怀化市","children":[{"code":"431202","name":"鹤城区"},{"code":"431221","name":"中方县"},{"code":"431222","name":"沅陵县"},{"code":"431223","name":"辰溪县"},{"code":"431224","name":"溆浦县"},{"code":"431225","name":"会同县"},{"code":"431226","name":"麻阳苗族自治县"},{"code":"431227","name":"新晃侗族自治县"},{"code":"431228","name":"芷江侗族自治县"},{"code":"431229","name":"靖州苗族侗族自治县"},{"code":"431230","name":"通道侗族自治县"},{"code":"431271","name":"怀化市洪江管理区"},{"code":"431281","name":"洪江市"}]},{"code":"4313","name":"娄底市","children":[{"code":"431302","name":"娄星区"},{"code":"431321","name":"双峰县"},{"code":"431322","name":"新化县"},{"code":"431381","name":"冷水江市"},{"code":"431382","name":"涟源市"}]},{"code":"4331","name":"湘西土家族苗族自治州","children":[{"code":"433101","name":"吉首市"},{"code":"433122","name":"泸溪县"},{"code":"433123","name":"凤凰县"},{"code":"433124","name":"花垣县"},{"code":"433125","name":"保靖县"},{"code":"433126","name":"古丈县"},{"code":"433127","name":"永顺县"},{"code":"433130","name":"龙山县"}]}]},{"code":"44","name":"广东省","children":[{"code":"4401","name":"广州市","children":[{"code":"440103","name":"荔湾区"},{"code":"440104","name":"越秀区"},{"code":"440105","name":"海珠区"},{"code":"440106","name":"天河区"},{"code":"440111","name":"白云区"},{"code":"440112","name":"黄埔区"},{"code":"440113","name":"番禺区"},{"code":"440114","name":"花都区"},{"code":"440115","name":"南沙区"},{"code":"440117","name":"从化区"},{"code":"440118","name":"增城区"}]},{"code":"4402","name":"韶关市","children":[{"code":"440203","name":"武江区"},{"code":"440204","name":"浈江区"},{"code":"440205","name":"曲江区"},{"code":"440222","name":"始兴县"},{"code":"440224","name":"仁化县"},{"code":"440229","name":"翁源县"},{"code":"440232","name":"乳源瑶族自治县"},{"code":"440233","name":"新丰县"},{"code":"440281","name":"乐昌市"},{"code":"440282","name":"南雄市"}]},{"code":"4403","name":"深圳市","children":[{"code":"440303","name":"罗湖区"},{"code":"440304","name":"福田区"},{"code":"440305","name":"南山区"},{"code":"440306","name":"宝安区"},{"code":"440307","name":"龙岗区"},{"code":"440308","name":"盐田区"},{"code":"440309","name":"龙华区"},{"code":"440310","name":"坪山区"},{"code":"440311","name":"光明区"}]},{"code":"4404","name":"珠海市","children":[{"code":"440402","name":"香洲区"},{"code":"440403","name":"斗门区"},{"code":"440404","name":"金湾区"}]},{"code":"4405","name":"汕头市","children":[{"code":"440507","name":"龙湖区"},{"code":"440511","name":"金平区"},{"code":"440512","name":"濠江区"},{"code":"440513","name":"潮阳区"},{"code":"440514","name":"潮南区"},{"code":"440515","name":"澄海区"},{"code":"440523","name":"南澳县"}]},{"code":"4406","name":"佛山市","children":[{"code":"440604","name":"禅城区"},{"code":"440605","name":"南海区"},{"code":"440606","name":"顺德区"},{"code":"440607","name":"三水区"},{"code":"440608","name":"高明区"}]},{"code":"4407","name":"江门市","children":[{"code":"440703","name":"蓬江区"},{"code":"440704","name":"江海区"},{"code":"440705","name":"新会区"},{"code":"440781","name":"台山市"},{"code":"440783","name":"开平市"},{"code":"440784","name":"鹤山市"},{"code":"440785","name":"恩平市"}]},{"code":"4408","name":"湛江市","children":[{"code":"440802","name":"赤坎区"},{"code":"440803","name":"霞山区"},{"code":"440804","name":"坡头区"},{"code":"440811","name":"麻章区"},{"code":"440823","name":"遂溪县"},{"code":"440825","name":"徐闻县"},{"code":"440881","name":"廉江市"},{"code":"440882","name":"雷州市"},{"code":"440883","name":"吴川市"}]},{"code":"4409","name":"茂名市","children":[{"code":"440902","name":"茂南区"},{"code":"440904","name":"电白区"},{"code":"440981","name":"高州市"},{"code":"440982","name":"化州市"},{"code":"440983","name":"信宜市"}]},{"code":"4412","name":"肇庆市","children":[{"code":"441202","name":"端州区"},{"code":"441203","name":"鼎湖区"},{"code":"441204","name":"高要区"},{"code":"441223","name":"广宁县"},{"code":"441224","name":"怀集县"},{"code":"441225","name":"封开县"},{"code":"441226","name":"德庆县"},{"code":"441284","name":"四会市"}]},{"code":"4413","name":"惠州市","children":[{"code":"441302","name":"惠城区"},{"code":"441303","name":"惠阳区"},{"code":"441322","name":"博罗县"},{"code":"441323","name":"惠东县"},{"code":"441324","name":"龙门县"}]},{"code":"4414","name":"梅州市","children":[{"code":"441402","name":"梅江区"},{"code":"441403","name":"梅县区"},{"code":"441422","name":"大埔县"},{"code":"441423","name":"丰顺县"},{"code":"441424","name":"五华县"},{"code":"441426","name":"平远县"},{"code":"441427","name":"蕉岭县"},{"code":"441481","name":"兴宁市"}]},{"code":"4415","name":"汕尾市","children":[{"code":"441502","name":"城区"},{"code":"441521","name":"海丰县"},{"code":"441523","name":"陆河县"},{"code":"441581","name":"陆丰市"}]},{"code":"4416","name":"河源市","children":[{"code":"441602","name":"源城区"},{"code":"441621","name":"紫金县"},{"code":"441622","name":"龙川县"},{"code":"441623","name":"连平县"},{"code":"441624","name":"和平县"},{"code":"441625","name":"东源县"}]},{"code":"4417","name":"阳江市","children":[{"code":"441702","name":"江城区"},{"code":"441704","name":"阳东区"},{"code":"441721","name":"阳西县"},{"code":"441781","name":"阳春市"}]},{"code":"4418","name":"清远市","children":[{"code":"441802","name":"清城区"},{"code":"441803","name":"清新区"},{"code":"441821","name":"佛冈县"},{"code":"441823","name":"阳山县"},{"code":"441825","name":"连山壮族瑶族自治县"},{"code":"441826","name":"连南瑶族自治县"},{"code":"441881","name":"英德市"},{"code":"441882","name":"连州市"}]},{"code":"4419","name":"东莞市","children":[{"code":"441900003","name":"东城街道"},{"code":"441900004","name":"南城街道"},{"code":"441900005","name":"万江街道"},{"code":"441900006","name":"莞城街道"},{"code":"441900101","name":"石碣镇"},{"code":"441900102","name":"石龙镇"},{"code":"441900103","name":"茶山镇"},{"code":"441900104","name":"石排镇"},{"code":"441900105","name":"企石镇"},{"code":"441900106","name":"横沥镇"},{"code":"441900107","name":"桥头镇"},{"code":"441900108","name":"谢岗镇"},{"code":"441900109","name":"东坑镇"},{"code":"441900110","name":"常平镇"},{"code":"441900111","name":"寮步镇"},{"code":"441900112","name":"樟木头镇"},{"code":"441900113","name":"大朗镇"},{"code":"441900114","name":"黄江镇"},{"code":"441900115","name":"清溪镇"},{"code":"441900116","name":"塘厦镇"},{"code":"441900117","name":"凤岗镇"},{"code":"441900118","name":"大岭山镇"},{"code":"441900119","name":"长安镇"},{"code":"441900121","name":"虎门镇"},{"code":"441900122","name":"厚街镇"},{"code":"441900123","name":"沙田镇"},{"code":"441900124","name":"道滘镇"},{"code":"441900125","name":"洪梅镇"},{"code":"441900126","name":"麻涌镇"},{"code":"441900127","name":"望牛墩镇"},{"code":"441900128","name":"中堂镇"},{"code":"441900129","name":"高埗镇"},{"code":"441900401","name":"松山湖"},{"code":"441900402","name":"东莞港"},{"code":"441900403","name":"东莞生态园"},{"code":"441900404","name":"东莞滨海湾新区"}]},{"code":"4420","name":"中山市","children":[{"code":"442000001","name":"石岐街道"},{"code":"442000002","name":"东区街道"},{"code":"442000003","name":"中山港街道"},{"code":"442000004","name":"西区街道"},{"code":"442000005","name":"南区街道"},{"code":"442000006","name":"五桂山街道"},{"code":"442000007","name":"民众街道"},{"code":"442000008","name":"南朗街道"},{"code":"442000101","name":"黄圃镇"},{"code":"442000103","name":"东凤镇"},{"code":"442000105","name":"古镇镇"},{"code":"442000106","name":"沙溪镇"},{"code":"442000107","name":"坦洲镇"},{"code":"442000108","name":"港口镇"},{"code":"442000109","name":"三角镇"},{"code":"442000110","name":"横栏镇"},{"code":"442000111","name":"南头镇"},{"code":"442000112","name":"阜沙镇"},{"code":"442000114","name":"三乡镇"},{"code":"442000115","name":"板芙镇"},{"code":"442000116","name":"大涌镇"},{"code":"442000117","name":"神湾镇"},{"code":"442000118","name":"小榄镇"}]},{"code":"4451","name":"潮州市","children":[{"code":"445102","name":"湘桥区"},{"code":"445103","name":"潮安区"},{"code":"445122","name":"饶平县"}]},{"code":"4452","name":"揭阳市","children":[{"code":"445202","name":"榕城区"},{"code":"445203","name":"揭东区"},{"code":"445222","name":"揭西县"},{"code":"445224","name":"惠来县"},{"code":"445281","name":"普宁市"}]},{"code":"4453","name":"云浮市","children":[{"code":"445302","name":"云城区"},{"code":"445303","name":"云安区"},{"code":"445321","name":"新兴县"},{"code":"445322","name":"郁南县"},{"code":"445381","name":"罗定市"}]}]},{"code":"45","name":"广西壮族自治区","children":[{"code":"4501","name":"南宁市","children":[{"code":"450102","name":"兴宁区"},{"code":"450103","name":"青秀区"},{"code":"450105","name":"江南区"},{"code":"450107","name":"西乡塘区"},{"code":"450108","name":"良庆区"},{"code":"450109","name":"邕宁区"},{"code":"450110","name":"武鸣区"},{"code":"450123","name":"隆安县"},{"code":"450124","name":"马山县"},{"code":"450125","name":"上林县"},{"code":"450126","name":"宾阳县"},{"code":"450181","name":"横州市"}]},{"code":"4502","name":"柳州市","children":[{"code":"450202","name":"城中区"},{"code":"450203","name":"鱼峰区"},{"code":"450204","name":"柳南区"},{"code":"450205","name":"柳北区"},{"code":"450206","name":"柳江区"},{"code":"450222","name":"柳城县"},{"code":"450223","name":"鹿寨县"},{"code":"450224","name":"融安县"},{"code":"450225","name":"融水苗族自治县"},{"code":"450226","name":"三江侗族自治县"}]},{"code":"4503","name":"桂林市","children":[{"code":"450302","name":"秀峰区"},{"code":"450303","name":"叠彩区"},{"code":"450304","name":"象山区"},{"code":"450305","name":"七星区"},{"code":"450311","name":"雁山区"},{"code":"450312","name":"临桂区"},{"code":"450321","name":"阳朔县"},{"code":"450323","name":"灵川县"},{"code":"450324","name":"全州县"},{"code":"450325","name":"兴安县"},{"code":"450326","name":"永福县"},{"code":"450327","name":"灌阳县"},{"code":"450328","name":"龙胜各族自治县"},{"code":"450329","name":"资源县"},{"code":"450330","name":"平乐县"},{"code":"450332","name":"恭城瑶族自治县"},{"code":"450381","name":"荔浦市"}]},{"code":"4504","name":"梧州市","children":[{"code":"450403","name":"万秀区"},{"code":"450405","name":"长洲区"},{"code":"450406","name":"龙圩区"},{"code":"450421","name":"苍梧县"},{"code":"450422","name":"藤县"},{"code":"450423","name":"蒙山县"},{"code":"450481","name":"岑溪市"}]},{"code":"4505","name":"北海市","children":[{"code":"450502","name":"海城区"},{"code":"450503","name":"银海区"},{"code":"450512","name":"铁山港区"},{"code":"450521","name":"合浦县"}]},{"code":"4506","name":"防城港市","children":[{"code":"450602","name":"港口区"},{"code":"450603","name":"防城区"},{"code":"450621","name":"上思县"},{"code":"450681","name":"东兴市"}]},{"code":"4507","name":"钦州市","children":[{"code":"450702","name":"钦南区"},{"code":"450703","name":"钦北区"},{"code":"450721","name":"灵山县"},{"code":"450722","name":"浦北县"}]},{"code":"4508","name":"贵港市","children":[{"code":"450802","name":"港北区"},{"code":"450803","name":"港南区"},{"code":"450804","name":"覃塘区"},{"code":"450821","name":"平南县"},{"code":"450881","name":"桂平市"}]},{"code":"4509","name":"玉林市","children":[{"code":"450902","name":"玉州区"},{"code":"450903","name":"福绵区"},{"code":"450921","name":"容县"},{"code":"450922","name":"陆川县"},{"code":"450923","name":"博白县"},{"code":"450924","name":"兴业县"},{"code":"450981","name":"北流市"}]},{"code":"4510","name":"百色市","children":[{"code":"451002","name":"右江区"},{"code":"451003","name":"田阳区"},{"code":"451022","name":"田东县"},{"code":"451024","name":"德保县"},{"code":"451026","name":"那坡县"},{"code":"451027","name":"凌云县"},{"code":"451028","name":"乐业县"},{"code":"451029","name":"田林县"},{"code":"451030","name":"西林县"},{"code":"451031","name":"隆林各族自治县"},{"code":"451081","name":"靖西市"},{"code":"451082","name":"平果市"}]},{"code":"4511","name":"贺州市","children":[{"code":"451102","name":"八步区"},{"code":"451103","name":"平桂区"},{"code":"451121","name":"昭平县"},{"code":"451122","name":"钟山县"},{"code":"451123","name":"富川瑶族自治县"}]},{"code":"4512","name":"河池市","children":[{"code":"451202","name":"金城江区"},{"code":"451203","name":"宜州区"},{"code":"451221","name":"南丹县"},{"code":"451222","name":"天峨县"},{"code":"451223","name":"凤山县"},{"code":"451224","name":"东兰县"},{"code":"451225","name":"罗城仫佬族自治县"},{"code":"451226","name":"环江毛南族自治县"},{"code":"451227","name":"巴马瑶族自治县"},{"code":"451228","name":"都安瑶族自治县"},{"code":"451229","name":"大化瑶族自治县"}]},{"code":"4513","name":"来宾市","children":[{"code":"451302","name":"兴宾区"},{"code":"451321","name":"忻城县"},{"code":"451322","name":"象州县"},{"code":"451323","name":"武宣县"},{"code":"451324","name":"金秀瑶族自治县"},{"code":"451381","name":"合山市"}]},{"code":"4514","name":"崇左市","children":[{"code":"451402","name":"江州区"},{"code":"451421","name":"扶绥县"},{"code":"451422","name":"宁明县"},{"code":"451423","name":"龙州县"},{"code":"451424","name":"大新县"},{"code":"451425","name":"天等县"},{"code":"451481","name":"凭祥市"}]}]},{"code":"46","name":"海南省","children":[{"code":"4601","name":"海口市","children":[{"code":"460105","name":"秀英区"},{"code":"460106","name":"龙华区"},{"code":"460107","name":"琼山区"},{"code":"460108","name":"美兰区"}]},{"code":"4602","name":"三亚市","children":[{"code":"460202","name":"海棠区"},{"code":"460203","name":"吉阳区"},{"code":"460204","name":"天涯区"},{"code":"460205","name":"崖州区"}]},{"code":"4603","name":"三沙市","children":[{"code":"460321","name":"西沙群岛"},{"code":"460322","name":"南沙群岛"},{"code":"460323","name":"中沙群岛的岛礁及其海域"}]},{"code":"4604","name":"儋州市","children":[{"code":"460400100","name":"那大镇"},{"code":"460400101","name":"和庆镇"},{"code":"460400102","name":"南丰镇"},{"code":"460400103","name":"大成镇"},{"code":"460400104","name":"雅星镇"},{"code":"460400105","name":"兰洋镇"},{"code":"460400106","name":"光村镇"},{"code":"460400107","name":"木棠镇"},{"code":"460400108","name":"海头镇"},{"code":"460400109","name":"峨蔓镇"},{"code":"460400111","name":"王五镇"},{"code":"460400112","name":"白马井镇"},{"code":"460400113","name":"中和镇"},{"code":"460400114","name":"排浦镇"},{"code":"460400115","name":"东成镇"},{"code":"460400116","name":"新州镇"},{"code":"460400499","name":"洋浦经济开发区"},{"code":"460400500","name":"华南热作学院"}]},{"code":"4690","name":"省直辖县级行政区划","children":[{"code":"469001","name":"五指山市"},{"code":"469002","name":"琼海市"},{"code":"469005","name":"文昌市"},{"code":"469006","name":"万宁市"},{"code":"469007","name":"东方市"},{"code":"469021","name":"定安县"},{"code":"469022","name":"屯昌县"},{"code":"469023","name":"澄迈县"},{"code":"469024","name":"临高县"},{"code":"469025","name":"白沙黎族自治县"},{"code":"469026","name":"昌江黎族自治县"},{"code":"469027","name":"乐东黎族自治县"},{"code":"469028","name":"陵水黎族自治县"},{"code":"469029","name":"保亭黎族苗族自治县"},{"code":"469030","name":"琼中黎族苗族自治县"}]}]},{"code":"50","name":"重庆市","children":[{"code":"5001","name":"市辖区","children":[{"code":"500101","name":"万州区"},{"code":"500102","name":"涪陵区"},{"code":"500103","name":"渝中区"},{"code":"500104","name":"大渡口区"},{"code":"500105","name":"江北区"},{"code":"500106","name":"沙坪坝区"},{"code":"500107","name":"九龙坡区"},{"code":"500108","name":"南岸区"},{"code":"500109","name":"北碚区"},{"code":"500110","name":"綦江区"},{"code":"500111","name":"大足区"},{"code":"500112","name":"渝北区"},{"code":"500113","name":"巴南区"},{"code":"500114","name":"黔江区"},{"code":"500115","name":"长寿区"},{"code":"500116","name":"江津区"},{"code":"500117","name":"合川区"},{"code":"500118","name":"永川区"},{"code":"500119","name":"南川区"},{"code":"500120","name":"璧山区"},{"code":"500151","name":"铜梁区"},{"code":"500152","name":"潼南区"},{"code":"500153","name":"荣昌区"},{"code":"500154","name":"开州区"},{"code":"500155","name":"梁平区"},{"code":"500156","name":"武隆区"}]},{"code":"5002","name":"县","children":[{"code":"500229","name":"城口县"},{"code":"500230","name":"丰都县"},{"code":"500231","name":"垫江县"},{"code":"500233","name":"忠县"},{"code":"500235","name":"云阳县"},{"code":"500236","name":"奉节县"},{"code":"500237","name":"巫山县"},{"code":"500238","name":"巫溪县"},{"code":"500240","name":"石柱土家族自治县"},{"code":"500241","name":"秀山土家族苗族自治县"},{"code":"500242","name":"酉阳土家族苗族自治县"},{"code":"500243","name":"彭水苗族土家族自治县"}]}]},{"code":"51","name":"四川省","children":[{"code":"5101","name":"成都市","children":[{"code":"510104","name":"锦江区"},{"code":"510105","name":"青羊区"},{"code":"510106","name":"金牛区"},{"code":"510107","name":"武侯区"},{"code":"510108","name":"成华区"},{"code":"510112","name":"龙泉驿区"},{"code":"510113","name":"青白江区"},{"code":"510114","name":"新都区"},{"code":"510115","name":"温江区"},{"code":"510116","name":"双流区"},{"code":"510117","name":"郫都区"},{"code":"510118","name":"新津区"},{"code":"510121","name":"金堂县"},{"code":"510129","name":"大邑县"},{"code":"510131","name":"蒲江县"},{"code":"510181","name":"都江堰市"},{"code":"510182","name":"彭州市"},{"code":"510183","name":"邛崃市"},{"code":"510184","name":"崇州市"},{"code":"510185","name":"简阳市"}]},{"code":"5103","name":"自贡市","children":[{"code":"510302","name":"自流井区"},{"code":"510303","name":"贡井区"},{"code":"510304","name":"大安区"},{"code":"510311","name":"沿滩区"},{"code":"510321","name":"荣县"},{"code":"510322","name":"富顺县"}]},{"code":"5104","name":"攀枝花市","children":[{"code":"510402","name":"东区"},{"code":"510403","name":"西区"},{"code":"510411","name":"仁和区"},{"code":"510421","name":"米易县"},{"code":"510422","name":"盐边县"}]},{"code":"5105","name":"泸州市","children":[{"code":"510502","name":"江阳区"},{"code":"510503","name":"纳溪区"},{"code":"510504","name":"龙马潭区"},{"code":"510521","name":"泸县"},{"code":"510522","name":"合江县"},{"code":"510524","name":"叙永县"},{"code":"510525","name":"古蔺县"}]},{"code":"5106","name":"德阳市","children":[{"code":"510603","name":"旌阳区"},{"code":"510604","name":"罗江区"},{"code":"510623","name":"中江县"},{"code":"510681","name":"广汉市"},{"code":"510682","name":"什邡市"},{"code":"510683","name":"绵竹市"}]},{"code":"5107","name":"绵阳市","children":[{"code":"510703","name":"涪城区"},{"code":"510704","name":"游仙区"},{"code":"510705","name":"安州区"},{"code":"510722","name":"三台县"},{"code":"510723","name":"盐亭县"},{"code":"510725","name":"梓潼县"},{"code":"510726","name":"北川羌族自治县"},{"code":"510727","name":"平武县"},{"code":"510781","name":"江油市"}]},{"code":"5108","name":"广元市","children":[{"code":"510802","name":"利州区"},{"code":"510811","name":"昭化区"},{"code":"510812","name":"朝天区"},{"code":"510821","name":"旺苍县"},{"code":"510822","name":"青川县"},{"code":"510823","name":"剑阁县"},{"code":"510824","name":"苍溪县"}]},{"code":"5109","name":"遂宁市","children":[{"code":"510903","name":"船山区"},{"code":"510904","name":"安居区"},{"code":"510921","name":"蓬溪县"},{"code":"510923","name":"大英县"},{"code":"510981","name":"射洪市"}]},{"code":"5110","name":"内江市","children":[{"code":"511002","name":"市中区"},{"code":"511011","name":"东兴区"},{"code":"511024","name":"威远县"},{"code":"511025","name":"资中县"},{"code":"511083","name":"隆昌市"}]},{"code":"5111","name":"乐山市","children":[{"code":"511102","name":"市中区"},{"code":"511111","name":"沙湾区"},{"code":"511112","name":"五通桥区"},{"code":"511113","name":"金口河区"},{"code":"511123","name":"犍为县"},{"code":"511124","name":"井研县"},{"code":"511126","name":"夹江县"},{"code":"511129","name":"沐川县"},{"code":"511132","name":"峨边彝族自治县"},{"code":"511133","name":"马边彝族自治县"},{"code":"511181","name":"峨眉山市"}]},{"code":"5113","name":"南充市","children":[{"code":"511302","name":"顺庆区"},{"code":"511303","name":"高坪区"},{"code":"511304","name":"嘉陵区"},{"code":"511321","name":"南部县"},{"code":"511322","name":"营山县"},{"code":"511323","name":"蓬安县"},{"code":"511324","name":"仪陇县"},{"code":"511325","name":"西充县"},{"code":"511381","name":"阆中市"}]},{"code":"5114","name":"眉山市","children":[{"code":"511402","name":"东坡区"},{"code":"511403","name":"彭山区"},{"code":"511421","name":"仁寿县"},{"code":"511423","name":"洪雅县"},{"code":"511424","name":"丹棱县"},{"code":"511425","name":"青神县"}]},{"code":"5115","name":"宜宾市","children":[{"code":"511502","name":"翠屏区"},{"code":"511503","name":"南溪区"},{"code":"511504","name":"叙州区"},{"code":"511523","name":"江安县"},{"code":"511524","name":"长宁县"},{"code":"511525","name":"高县"},{"code":"511526","name":"珙县"},{"code":"511527","name":"筠连县"},{"code":"511528","name":"兴文县"},{"code":"511529","name":"屏山县"}]},{"code":"5116","name":"广安市","children":[{"code":"511602","name":"广安区"},{"code":"511603","name":"前锋区"},{"code":"511621","name":"岳池县"},{"code":"511622","name":"武胜县"},{"code":"511623","name":"邻水县"},{"code":"511681","name":"华蓥市"}]},{"code":"5117","name":"达州市","children":[{"code":"511702","name":"通川区"},{"code":"511703","name":"达川区"},{"code":"511722","name":"宣汉县"},{"code":"511723","name":"开江县"},{"code":"511724","name":"大竹县"},{"code":"511725","name":"渠县"},{"code":"511781","name":"万源市"}]},{"code":"5118","name":"雅安市","children":[{"code":"511802","name":"雨城区"},{"code":"511803","name":"名山区"},{"code":"511822","name":"荥经县"},{"code":"511823","name":"汉源县"},{"code":"511824","name":"石棉县"},{"code":"511825","name":"天全县"},{"code":"511826","name":"芦山县"},{"code":"511827","name":"宝兴县"}]},{"code":"5119","name":"巴中市","children":[{"code":"511902","name":"巴州区"},{"code":"511903","name":"恩阳区"},{"code":"511921","name":"通江县"},{"code":"511922","name":"南江县"},{"code":"511923","name":"平昌县"}]},{"code":"5120","name":"资阳市","children":[{"code":"512002","name":"雁江区"},{"code":"512021","name":"安岳县"},{"code":"512022","name":"乐至县"}]},{"code":"5132","name":"阿坝藏族羌族自治州","children":[{"code":"513201","name":"马尔康市"},{"code":"513221","name":"汶川县"},{"code":"513222","name":"理县"},{"code":"513223","name":"茂县"},{"code":"513224","name":"松潘县"},{"code":"513225","name":"九寨沟县"},{"code":"513226","name":"金川县"},{"code":"513227","name":"小金县"},{"code":"513228","name":"黑水县"},{"code":"513230","name":"壤塘县"},{"code":"513231","name":"阿坝县"},{"code":"513232","name":"若尔盖县"},{"code":"513233","name":"红原县"}]},{"code":"5133","name":"甘孜藏族自治州","children":[{"code":"513301","name":"康定市"},{"code":"513322","name":"泸定县"},{"code":"513323","name":"丹巴县"},{"code":"513324","name":"九龙县"},{"code":"513325","name":"雅江县"},{"code":"513326","name":"道孚县"},{"code":"513327","name":"炉霍县"},{"code":"513328","name":"甘孜县"},{"code":"513329","name":"新龙县"},{"code":"513330","name":"德格县"},{"code":"513331","name":"白玉县"},{"code":"513332","name":"石渠县"},{"code":"513333","name":"色达县"},{"code":"513334","name":"理塘县"},{"code":"513335","name":"巴塘县"},{"code":"513336","name":"乡城县"},{"code":"513337","name":"稻城县"},{"code":"513338","name":"得荣县"}]},{"code":"5134","name":"凉山彝族自治州","children":[{"code":"513401","name":"西昌市"},{"code":"513402","name":"会理市"},{"code":"513422","name":"木里藏族自治县"},{"code":"513423","name":"盐源县"},{"code":"513424","name":"德昌县"},{"code":"513426","name":"会东县"},{"code":"513427","name":"宁南县"},{"code":"513428","name":"普格县"},{"code":"513429","name":"布拖县"},{"code":"513430","name":"金阳县"},{"code":"513431","name":"昭觉县"},{"code":"513432","name":"喜德县"},{"code":"513433","name":"冕宁县"},{"code":"513434","name":"越西县"},{"code":"513435","name":"甘洛县"},{"code":"513436","name":"美姑县"},{"code":"513437","name":"雷波县"}]}]},{"code":"52","name":"贵州省","children":[{"code":"5201","name":"贵阳市","children":[{"code":"520102","name":"南明区"},{"code":"520103","name":"云岩区"},{"code":"520111","name":"花溪区"},{"code":"520112","name":"乌当区"},{"code":"520113","name":"白云区"},{"code":"520115","name":"观山湖区"},{"code":"520121","name":"开阳县"},{"code":"520122","name":"息烽县"},{"code":"520123","name":"修文县"},{"code":"520181","name":"清镇市"}]},{"code":"5202","name":"六盘水市","children":[{"code":"520201","name":"钟山区"},{"code":"520203","name":"六枝特区"},{"code":"520204","name":"水城区"},{"code":"520281","name":"盘州市"}]},{"code":"5203","name":"遵义市","children":[{"code":"520302","name":"红花岗区"},{"code":"520303","name":"汇川区"},{"code":"520304","name":"播州区"},{"code":"520322","name":"桐梓县"},{"code":"520323","name":"绥阳县"},{"code":"520324","name":"正安县"},{"code":"520325","name":"道真仡佬族苗族自治县"},{"code":"520326","name":"务川仡佬族苗族自治县"},{"code":"520327","name":"凤冈县"},{"code":"520328","name":"湄潭县"},{"code":"520329","name":"余庆县"},{"code":"520330","name":"习水县"},{"code":"520381","name":"赤水市"},{"code":"520382","name":"仁怀市"}]},{"code":"5204","name":"安顺市","children":[{"code":"520402","name":"西秀区"},{"code":"520403","name":"平坝区"},{"code":"520422","name":"普定县"},{"code":"520423","name":"镇宁布依族苗族自治县"},{"code":"520424","name":"关岭布依族苗族自治县"},{"code":"520425","name":"紫云苗族布依族自治县"}]},{"code":"5205","name":"毕节市","children":[{"code":"520502","name":"七星关区"},{"code":"520521","name":"大方县"},{"code":"520523","name":"金沙县"},{"code":"520524","name":"织金县"},{"code":"520525","name":"纳雍县"},{"code":"520526","name":"威宁彝族回族苗族自治县"},{"code":"520527","name":"赫章县"},{"code":"520581","name":"黔西市"}]},{"code":"5206","name":"铜仁市","children":[{"code":"520602","name":"碧江区"},{"code":"520603","name":"万山区"},{"code":"520621","name":"江口县"},{"code":"520622","name":"玉屏侗族自治县"},{"code":"520623","name":"石阡县"},{"code":"520624","name":"思南县"},{"code":"520625","name":"印江土家族苗族自治县"},{"code":"520626","name":"德江县"},{"code":"520627","name":"沿河土家族自治县"},{"code":"520628","name":"松桃苗族自治县"}]},{"code":"5223","name":"黔西南布依族苗族自治州","children":[{"code":"522301","name":"兴义市"},{"code":"522302","name":"兴仁市"},{"code":"522323","name":"普安县"},{"code":"522324","name":"晴隆县"},{"code":"522325","name":"贞丰县"},{"code":"522326","name":"望谟县"},{"code":"522327","name":"册亨县"},{"code":"522328","name":"安龙县"}]},{"code":"5226","name":"黔东南苗族侗族自治州","children":[{"code":"522601","name":"凯里市"},{"code":"522622","name":"黄平县"},{"code":"522623","name":"施秉县"},{"code":"522624","name":"三穗县"},{"code":"522625","name":"镇远县"},{"code":"522626","name":"岑巩县"},{"code":"522627","name":"天柱县"},{"code":"522628","name":"锦屏县"},{"code":"522629","name":"剑河县"},{"code":"522630","name":"台江县"},{"code":"522631","name":"黎平县"},{"code":"522632","name":"榕江县"},{"code":"522633","name":"从江县"},{"code":"522634","name":"雷山县"},{"code":"522635","name":"麻江县"},{"code":"522636","name":"丹寨县"}]},{"code":"5227","name":"黔南布依族苗族自治州","children":[{"code":"522701","name":"都匀市"},{"code":"522702","name":"福泉市"},{"code":"522722","name":"荔波县"},{"code":"522723","name":"贵定县"},{"code":"522725","name":"瓮安县"},{"code":"522726","name":"独山县"},{"code":"522727","name":"平塘县"},{"code":"522728","name":"罗甸县"},{"code":"522729","name":"长顺县"},{"code":"522730","name":"龙里县"},{"code":"522731","name":"惠水县"},{"code":"522732","name":"三都水族自治县"}]}]},{"code":"53","name":"云南省","children":[{"code":"5301","name":"昆明市","children":[{"code":"530102","name":"五华区"},{"code":"530103","name":"盘龙区"},{"code":"530111","name":"官渡区"},{"code":"530112","name":"西山区"},{"code":"530113","name":"东川区"},{"code":"530114","name":"呈贡区"},{"code":"530115","name":"晋宁区"},{"code":"530124","name":"富民县"},{"code":"530125","name":"宜良县"},{"code":"530126","name":"石林彝族自治县"},{"code":"530127","name":"嵩明县"},{"code":"530128","name":"禄劝彝族苗族自治县"},{"code":"530129","name":"寻甸回族彝族自治县"},{"code":"530181","name":"安宁市"}]},{"code":"5303","name":"曲靖市","children":[{"code":"530302","name":"麒麟区"},{"code":"530303","name":"沾益区"},{"code":"530304","name":"马龙区"},{"code":"530322","name":"陆良县"},{"code":"530323","name":"师宗县"},{"code":"530324","name":"罗平县"},{"code":"530325","name":"富源县"},{"code":"530326","name":"会泽县"},{"code":"530381","name":"宣威市"}]},{"code":"5304","name":"玉溪市","children":[{"code":"530402","name":"红塔区"},{"code":"530403","name":"江川区"},{"code":"530423","name":"通海县"},{"code":"530424","name":"华宁县"},{"code":"530425","name":"易门县"},{"code":"530426","name":"峨山彝族自治县"},{"code":"530427","name":"新平彝族傣族自治县"},{"code":"530428","name":"元江哈尼族彝族傣族自治县"},{"code":"530481","name":"澄江市"}]},{"code":"5305","name":"保山市","children":[{"code":"530502","name":"隆阳区"},{"code":"530521","name":"施甸县"},{"code":"530523","name":"龙陵县"},{"code":"530524","name":"昌宁县"},{"code":"530581","name":"腾冲市"}]},{"code":"5306","name":"昭通市","children":[{"code":"530602","name":"昭阳区"},{"code":"530621","name":"鲁甸县"},{"code":"530622","name":"巧家县"},{"code":"530623","name":"盐津县"},{"code":"530624","name":"大关县"},{"code":"530625","name":"永善县"},{"code":"530626","name":"绥江县"},{"code":"530627","name":"镇雄县"},{"code":"530628","name":"彝良县"},{"code":"530629","name":"威信县"},{"code":"530681","name":"水富市"}]},{"code":"5307","name":"丽江市","children":[{"code":"530702","name":"古城区"},{"code":"530721","name":"玉龙纳西族自治县"},{"code":"530722","name":"永胜县"},{"code":"530723","name":"华坪县"},{"code":"530724","name":"宁蒗彝族自治县"}]},{"code":"5308","name":"普洱市","children":[{"code":"530802","name":"思茅区"},{"code":"530821","name":"宁洱哈尼族彝族自治县"},{"code":"530822","name":"墨江哈尼族自治县"},{"code":"530823","name":"景东彝族自治县"},{"code":"530824","name":"景谷傣族彝族自治县"},{"code":"530825","name":"镇沅彝族哈尼族拉祜族自治县"},{"code":"530826","name":"江城哈尼族彝族自治县"},{"code":"530827","name":"孟连傣族拉祜族佤族自治县"},{"code":"530828","name":"澜沧拉祜族自治县"},{"code":"530829","name":"西盟佤族自治县"}]},{"code":"5309","name":"临沧市","children":[{"code":"530902","name":"临翔区"},{"code":"530921","name":"凤庆县"},{"code":"530922","name":"云县"},{"code":"530923","name":"永德县"},{"code":"530924","name":"镇康县"},{"code":"530925","name":"双江拉祜族佤族布朗族傣族自治县"},{"code":"530926","name":"耿马傣族佤族自治县"},{"code":"530927","name":"沧源佤族自治县"}]},{"code":"5323","name":"楚雄彝族自治州","children":[{"code":"532301","name":"楚雄市"},{"code":"532302","name":"禄丰市"},{"code":"532322","name":"双柏县"},{"code":"532323","name":"牟定县"},{"code":"532324","name":"南华县"},{"code":"532325","name":"姚安县"},{"code":"532326","name":"大姚县"},{"code":"532327","name":"永仁县"},{"code":"532328","name":"元谋县"},{"code":"532329","name":"武定县"}]},{"code":"5325","name":"红河哈尼族彝族自治州","children":[{"code":"532501","name":"个旧市"},{"code":"532502","name":"开远市"},{"code":"532503","name":"蒙自市"},{"code":"532504","name":"弥勒市"},{"code":"532523","name":"屏边苗族自治县"},{"code":"532524","name":"建水县"},{"code":"532525","name":"石屏县"},{"code":"532527","name":"泸西县"},{"code":"532528","name":"元阳县"},{"code":"532529","name":"红河县"},{"code":"532530","name":"金平苗族瑶族傣族自治县"},{"code":"532531","name":"绿春县"},{"code":"532532","name":"河口瑶族自治县"}]},{"code":"5326","name":"文山壮族苗族自治州","children":[{"code":"532601","name":"文山市"},{"code":"532622","name":"砚山县"},{"code":"532623","name":"西畴县"},{"code":"532624","name":"麻栗坡县"},{"code":"532625","name":"马关县"},{"code":"532626","name":"丘北县"},{"code":"532627","name":"广南县"},{"code":"532628","name":"富宁县"}]},{"code":"5328","name":"西双版纳傣族自治州","children":[{"code":"532801","name":"景洪市"},{"code":"532822","name":"勐海县"},{"code":"532823","name":"勐腊县"}]},{"code":"5329","name":"大理白族自治州","children":[{"code":"532901","name":"大理市"},{"code":"532922","name":"漾濞彝族自治县"},{"code":"532923","name":"祥云县"},{"code":"532924","name":"宾川县"},{"code":"532925","name":"弥渡县"},{"code":"532926","name":"南涧彝族自治县"},{"code":"532927","name":"巍山彝族回族自治县"},{"code":"532928","name":"永平县"},{"code":"532929","name":"云龙县"},{"code":"532930","name":"洱源县"},{"code":"532931","name":"剑川县"},{"code":"532932","name":"鹤庆县"}]},{"code":"5331","name":"德宏傣族景颇族自治州","children":[{"code":"533102","name":"瑞丽市"},{"code":"533103","name":"芒市"},{"code":"533122","name":"梁河县"},{"code":"533123","name":"盈江县"},{"code":"533124","name":"陇川县"}]},{"code":"5333","name":"怒江傈僳族自治州","children":[{"code":"533301","name":"泸水市"},{"code":"533323","name":"福贡县"},{"code":"533324","name":"贡山独龙族怒族自治县"},{"code":"533325","name":"兰坪白族普米族自治县"}]},{"code":"5334","name":"迪庆藏族自治州","children":[{"code":"533401","name":"香格里拉市"},{"code":"533422","name":"德钦县"},{"code":"533423","name":"维西傈僳族自治县"}]}]},{"code":"54","name":"西藏自治区","children":[{"code":"5401","name":"拉萨市","children":[{"code":"540102","name":"城关区"},{"code":"540103","name":"堆龙德庆区"},{"code":"540104","name":"达孜区"},{"code":"540121","name":"林周县"},{"code":"540122","name":"当雄县"},{"code":"540123","name":"尼木县"},{"code":"540124","name":"曲水县"},{"code":"540127","name":"墨竹工卡县"},{"code":"540171","name":"格尔木藏青工业园区"},{"code":"540172","name":"拉萨经济技术开发区"},{"code":"540173","name":"西藏文化旅游创意园区"},{"code":"540174","name":"达孜工业园区"}]},{"code":"5402","name":"日喀则市","children":[{"code":"540202","name":"桑珠孜区"},{"code":"540221","name":"南木林县"},{"code":"540222","name":"江孜县"},{"code":"540223","name":"定日县"},{"code":"540224","name":"萨迦县"},{"code":"540225","name":"拉孜县"},{"code":"540226","name":"昂仁县"},{"code":"540227","name":"谢通门县"},{"code":"540228","name":"白朗县"},{"code":"540229","name":"仁布县"},{"code":"540230","name":"康马县"},{"code":"540231","name":"定结县"},{"code":"540232","name":"仲巴县"},{"code":"540233","name":"亚东县"},{"code":"540234","name":"吉隆县"},{"code":"540235","name":"聂拉木县"},{"code":"540236","name":"萨嘎县"},{"code":"540237","name":"岗巴县"}]},{"code":"5403","name":"昌都市","children":[{"code":"540302","name":"卡若区"},{"code":"540321","name":"江达县"},{"code":"540322","name":"贡觉县"},{"code":"540323","name":"类乌齐县"},{"code":"540324","name":"丁青县"},{"code":"540325","name":"察雅县"},{"code":"540326","name":"八宿县"},{"code":"540327","name":"左贡县"},{"code":"540328","name":"芒康县"},{"code":"540329","name":"洛隆县"},{"code":"540330","name":"边坝县"}]},{"code":"5404","name":"林芝市","children":[{"code":"540402","name":"巴宜区"},{"code":"540421","name":"工布江达县"},{"code":"540423","name":"墨脱县"},{"code":"540424","name":"波密县"},{"code":"540425","name":"察隅县"},{"code":"540426","name":"朗县"},{"code":"540481","name":"米林市"}]},{"code":"5405","name":"山南市","children":[{"code":"540502","name":"乃东区"},{"code":"540521","name":"扎囊县"},{"code":"540522","name":"贡嘎县"},{"code":"540523","name":"桑日县"},{"code":"540524","name":"琼结县"},{"code":"540525","name":"曲松县"},{"code":"540526","name":"措美县"},{"code":"540527","name":"洛扎县"},{"code":"540528","name":"加查县"},{"code":"540529","name":"隆子县"},{"code":"540531","name":"浪卡子县"},{"code":"540581","name":"错那市"}]},{"code":"5406","name":"那曲市","children":[{"code":"540602","name":"色尼区"},{"code":"540621","name":"嘉黎县"},{"code":"540622","name":"比如县"},{"code":"540623","name":"聂荣县"},{"code":"540624","name":"安多县"},{"code":"540625","name":"申扎县"},{"code":"540626","name":"索县"},{"code":"540627","name":"班戈县"},{"code":"540628","name":"巴青县"},{"code":"540629","name":"尼玛县"},{"code":"540630","name":"双湖县"}]},{"code":"5425","name":"阿里地区","children":[{"code":"542521","name":"普兰县"},{"code":"542522","name":"札达县"},{"code":"542523","name":"噶尔县"},{"code":"542524","name":"日土县"},{"code":"542525","name":"革吉县"},{"code":"542526","name":"改则县"},{"code":"542527","name":"措勤县"}]}]},{"code":"61","name":"陕西省","children":[{"code":"6101","name":"西安市","children":[{"code":"610102","name":"新城区"},{"code":"610103","name":"碑林区"},{"code":"610104","name":"莲湖区"},{"code":"610111","name":"灞桥区"},{"code":"610112","name":"未央区"},{"code":"610113","name":"雁塔区"},{"code":"610114","name":"阎良区"},{"code":"610115","name":"临潼区"},{"code":"610116","name":"长安区"},{"code":"610117","name":"高陵区"},{"code":"610118","name":"鄠邑区"},{"code":"610122","name":"蓝田县"},{"code":"610124","name":"周至县"}]},{"code":"6102","name":"铜川市","children":[{"code":"610202","name":"王益区"},{"code":"610203","name":"印台区"},{"code":"610204","name":"耀州区"},{"code":"610222","name":"宜君县"}]},{"code":"6103","name":"宝鸡市","children":[{"code":"610302","name":"渭滨区"},{"code":"610303","name":"金台区"},{"code":"610304","name":"陈仓区"},{"code":"610305","name":"凤翔区"},{"code":"610323","name":"岐山县"},{"code":"610324","name":"扶风县"},{"code":"610326","name":"眉县"},{"code":"610327","name":"陇县"},{"code":"610328","name":"千阳县"},{"code":"610329","name":"麟游县"},{"code":"610330","name":"凤县"},{"code":"610331","name":"太白县"}]},{"code":"6104","name":"咸阳市","children":[{"code":"610402","name":"秦都区"},{"code":"610403","name":"杨陵区"},{"code":"610404","name":"渭城区"},{"code":"610422","name":"三原县"},{"code":"610423","name":"泾阳县"},{"code":"610424","name":"乾县"},{"code":"610425","name":"礼泉县"},{"code":"610426","name":"永寿县"},{"code":"610428","name":"长武县"},{"code":"610429","name":"旬邑县"},{"code":"610430","name":"淳化县"},{"code":"610431","name":"武功县"},{"code":"610481","name":"兴平市"},{"code":"610482","name":"彬州市"}]},{"code":"6105","name":"渭南市","children":[{"code":"610502","name":"临渭区"},{"code":"610503","name":"华州区"},{"code":"610522","name":"潼关县"},{"code":"610523","name":"大荔县"},{"code":"610524","name":"合阳县"},{"code":"610525","name":"澄城县"},{"code":"610526","name":"蒲城县"},{"code":"610527","name":"白水县"},{"code":"610528","name":"富平县"},{"code":"610581","name":"韩城市"},{"code":"610582","name":"华阴市"}]},{"code":"6106","name":"延安市","children":[{"code":"610602","name":"宝塔区"},{"code":"610603","name":"安塞区"},{"code":"610621","name":"延长县"},{"code":"610622","name":"延川县"},{"code":"610625","name":"志丹县"},{"code":"610626","name":"吴起县"},{"code":"610627","name":"甘泉县"},{"code":"610628","name":"富县"},{"code":"610629","name":"洛川县"},{"code":"610630","name":"宜川县"},{"code":"610631","name":"黄龙县"},{"code":"610632","name":"黄陵县"},{"code":"610681","name":"子长市"}]},{"code":"6107","name":"汉中市","children":[{"code":"610702","name":"汉台区"},{"code":"610703","name":"南郑区"},{"code":"610722","name":"城固县"},{"code":"610723","name":"洋县"},{"code":"610724","name":"西乡县"},{"code":"610725","name":"勉县"},{"code":"610726","name":"宁强县"},{"code":"610727","name":"略阳县"},{"code":"610728","name":"镇巴县"},{"code":"610729","name":"留坝县"},{"code":"610730","name":"佛坪县"}]},{"code":"6108","name":"榆林市","children":[{"code":"610802","name":"榆阳区"},{"code":"610803","name":"横山区"},{"code":"610822","name":"府谷县"},{"code":"610824","name":"靖边县"},{"code":"610825","name":"定边县"},{"code":"610826","name":"绥德县"},{"code":"610827","name":"米脂县"},{"code":"610828","name":"佳县"},{"code":"610829","name":"吴堡县"},{"code":"610830","name":"清涧县"},{"code":"610831","name":"子洲县"},{"code":"610881","name":"神木市"}]},{"code":"6109","name":"安康市","children":[{"code":"610902","name":"汉滨区"},{"code":"610921","name":"汉阴县"},{"code":"610922","name":"石泉县"},{"code":"610923","name":"宁陕县"},{"code":"610924","name":"紫阳县"},{"code":"610925","name":"岚皋县"},{"code":"610926","name":"平利县"},{"code":"610927","name":"镇坪县"},{"code":"610929","name":"白河县"},{"code":"610981","name":"旬阳市"}]},{"code":"6110","name":"商洛市","children":[{"code":"611002","name":"商州区"},{"code":"611021","name":"洛南县"},{"code":"611022","name":"丹凤县"},{"code":"611023","name":"商南县"},{"code":"611024","name":"山阳县"},{"code":"611025","name":"镇安县"},{"code":"611026","name":"柞水县"}]}]},{"code":"62","name":"甘肃省","children":[{"code":"6201","name":"兰州市","children":[{"code":"620102","name":"城关区"},{"code":"620103","name":"七里河区"},{"code":"620104","name":"西固区"},{"code":"620105","name":"安宁区"},{"code":"620111","name":"红古区"},{"code":"620121","name":"永登县"},{"code":"620122","name":"皋兰县"},{"code":"620123","name":"榆中县"},{"code":"620171","name":"兰州新区"}]},{"code":"6202","name":"嘉峪关市","children":[{"code":"620201001","name":"雄关街道"},{"code":"620201002","name":"钢城街道"},{"code":"620201100","name":"新城镇"},{"code":"620201101","name":"峪泉镇"},{"code":"620201102","name":"文殊镇"}]},{"code":"6203","name":"金昌市","children":[{"code":"620302","name":"金川区"},{"code":"620321","name":"永昌县"}]},{"code":"6204","name":"白银市","children":[{"code":"620402","name":"白银区"},{"code":"620403","name":"平川区"},{"code":"620421","name":"靖远县"},{"code":"620422","name":"会宁县"},{"code":"620423","name":"景泰县"}]},{"code":"6205","name":"天水市","children":[{"code":"620502","name":"秦州区"},{"code":"620503","name":"麦积区"},{"code":"620521","name":"清水县"},{"code":"620522","name":"秦安县"},{"code":"620523","name":"甘谷县"},{"code":"620524","name":"武山县"},{"code":"620525","name":"张家川回族自治县"}]},{"code":"6206","name":"武威市","children":[{"code":"620602","name":"凉州区"},{"code":"620621","name":"民勤县"},{"code":"620622","name":"古浪县"},{"code":"620623","name":"天祝藏族自治县"}]},{"code":"6207","name":"张掖市","children":[{"code":"620702","name":"甘州区"},{"code":"620721","name":"肃南裕固族自治县"},{"code":"620722","name":"民乐县"},{"code":"620723","name":"临泽县"},{"code":"620724","name":"高台县"},{"code":"620725","name":"山丹县"}]},{"code":"6208","name":"平凉市","children":[{"code":"620802","name":"崆峒区"},{"code":"620821","name":"泾川县"},{"code":"620822","name":"灵台县"},{"code":"620823","name":"崇信县"},{"code":"620825","name":"庄浪县"},{"code":"620826","name":"静宁县"},{"code":"620881","name":"华亭市"}]},{"code":"6209","name":"酒泉市","children":[{"code":"620902","name":"肃州区"},{"code":"620921","name":"金塔县"},{"code":"620922","name":"瓜州县"},{"code":"620923","name":"肃北蒙古族自治县"},{"code":"620924","name":"阿克塞哈萨克族自治县"},{"code":"620981","name":"玉门市"},{"code":"620982","name":"敦煌市"}]},{"code":"6210","name":"庆阳市","children":[{"code":"621002","name":"西峰区"},{"code":"621021","name":"庆城县"},{"code":"621022","name":"环县"},{"code":"621023","name":"华池县"},{"code":"621024","name":"合水县"},{"code":"621025","name":"正宁县"},{"code":"621026","name":"宁县"},{"code":"621027","name":"镇原县"}]},{"code":"6211","name":"定西市","children":[{"code":"621102","name":"安定区"},{"code":"621121","name":"通渭县"},{"code":"621122","name":"陇西县"},{"code":"621123","name":"渭源县"},{"code":"621124","name":"临洮县"},{"code":"621125","name":"漳县"},{"code":"621126","name":"岷县"}]},{"code":"6212","name":"陇南市","children":[{"code":"621202","name":"武都区"},{"code":"621221","name":"成县"},{"code":"621222","name":"文县"},{"code":"621223","name":"宕昌县"},{"code":"621224","name":"康县"},{"code":"621225","name":"西和县"},{"code":"621226","name":"礼县"},{"code":"621227","name":"徽县"},{"code":"621228","name":"两当县"}]},{"code":"6229","name":"临夏回族自治州","children":[{"code":"622901","name":"临夏市"},{"code":"622921","name":"临夏县"},{"code":"622922","name":"康乐县"},{"code":"622923","name":"永靖县"},{"code":"622924","name":"广河县"},{"code":"622925","name":"和政县"},{"code":"622926","name":"东乡族自治县"},{"code":"622927","name":"积石山保安族东乡族撒拉族自治县"}]},{"code":"6230","name":"甘南藏族自治州","children":[{"code":"623001","name":"合作市"},{"code":"623021","name":"临潭县"},{"code":"623022","name":"卓尼县"},{"code":"623023","name":"舟曲县"},{"code":"623024","name":"迭部县"},{"code":"623025","name":"玛曲县"},{"code":"623026","name":"碌曲县"},{"code":"623027","name":"夏河县"}]}]},{"code":"63","name":"青海省","children":[{"code":"6301","name":"西宁市","children":[{"code":"630102","name":"城东区"},{"code":"630103","name":"城中区"},{"code":"630104","name":"城西区"},{"code":"630105","name":"城北区"},{"code":"630106","name":"湟中区"},{"code":"630121","name":"大通回族土族自治县"},{"code":"630123","name":"湟源县"}]},{"code":"6302","name":"海东市","children":[{"code":"630202","name":"乐都区"},{"code":"630203","name":"平安区"},{"code":"630222","name":"民和回族土族自治县"},{"code":"630223","name":"互助土族自治县"},{"code":"630224","name":"化隆回族自治县"},{"code":"630225","name":"循化撒拉族自治县"}]},{"code":"6322","name":"海北藏族自治州","children":[{"code":"632221","name":"门源回族自治县"},{"code":"632222","name":"祁连县"},{"code":"632223","name":"海晏县"},{"code":"632224","name":"刚察县"}]},{"code":"6323","name":"黄南藏族自治州","children":[{"code":"632301","name":"同仁市"},{"code":"632322","name":"尖扎县"},{"code":"632323","name":"泽库县"},{"code":"632324","name":"河南蒙古族自治县"}]},{"code":"6325","name":"海南藏族自治州","children":[{"code":"632521","name":"共和县"},{"code":"632522","name":"同德县"},{"code":"632523","name":"贵德县"},{"code":"632524","name":"兴海县"},{"code":"632525","name":"贵南县"}]},{"code":"6326","name":"果洛藏族自治州","children":[{"code":"632621","name":"玛沁县"},{"code":"632622","name":"班玛县"},{"code":"632623","name":"甘德县"},{"code":"632624","name":"达日县"},{"code":"632625","name":"久治县"},{"code":"632626","name":"玛多县"}]},{"code":"6327","name":"玉树藏族自治州","children":[{"code":"632701","name":"玉树市"},{"code":"632722","name":"杂多县"},{"code":"632723","name":"称多县"},{"code":"632724","name":"治多县"},{"code":"632725","name":"囊谦县"},{"code":"632726","name":"曲麻莱县"}]},{"code":"6328","name":"海西蒙古族藏族自治州","children":[{"code":"632801","name":"格尔木市"},{"code":"632802","name":"德令哈市"},{"code":"632803","name":"茫崖市"},{"code":"632821","name":"乌兰县"},{"code":"632822","name":"都兰县"},{"code":"632823","name":"天峻县"},{"code":"632857","name":"大柴旦行政委员会"}]}]},{"code":"64","name":"宁夏回族自治区","children":[{"code":"6401","name":"银川市","children":[{"code":"640104","name":"兴庆区"},{"code":"640105","name":"西夏区"},{"code":"640106","name":"金凤区"},{"code":"640121","name":"永宁县"},{"code":"640122","name":"贺兰县"},{"code":"640181","name":"灵武市"}]},{"code":"6402","name":"石嘴山市","children":[{"code":"640202","name":"大武口区"},{"code":"640205","name":"惠农区"},{"code":"640221","name":"平罗县"}]},{"code":"6403","name":"吴忠市","children":[{"code":"640302","name":"利通区"},{"code":"640303","name":"红寺堡区"},{"code":"640323","name":"盐池县"},{"code":"640324","name":"同心县"},{"code":"640381","name":"青铜峡市"}]},{"code":"6404","name":"固原市","children":[{"code":"640402","name":"原州区"},{"code":"640422","name":"西吉县"},{"code":"640423","name":"隆德县"},{"code":"640424","name":"泾源县"},{"code":"640425","name":"彭阳县"}]},{"code":"6405","name":"中卫市","children":[{"code":"640502","name":"沙坡头区"},{"code":"640521","name":"中宁县"},{"code":"640522","name":"海原县"}]}]},{"code":"65","name":"新疆维吾尔自治区","children":[{"code":"6501","name":"乌鲁木齐市","children":[{"code":"650102","name":"天山区"},{"code":"650103","name":"沙依巴克区"},{"code":"650104","name":"新市区"},{"code":"650105","name":"水磨沟区"},{"code":"650106","name":"头屯河区"},{"code":"650107","name":"达坂城区"},{"code":"650109","name":"米东区"},{"code":"650121","name":"乌鲁木齐县"}]},{"code":"6502","name":"克拉玛依市","children":[{"code":"650202","name":"独山子区"},{"code":"650203","name":"克拉玛依区"},{"code":"650204","name":"白碱滩区"},{"code":"650205","name":"乌尔禾区"}]},{"code":"6504","name":"吐鲁番市","children":[{"code":"650402","name":"高昌区"},{"code":"650421","name":"鄯善县"},{"code":"650422","name":"托克逊县"}]},{"code":"6505","name":"哈密市","children":[{"code":"650502","name":"伊州区"},{"code":"650521","name":"巴里坤哈萨克自治县"},{"code":"650522","name":"伊吾县"}]},{"code":"6523","name":"昌吉回族自治州","children":[{"code":"652301","name":"昌吉市"},{"code":"652302","name":"阜康市"},{"code":"652323","name":"呼图壁县"},{"code":"652324","name":"玛纳斯县"},{"code":"652325","name":"奇台县"},{"code":"652327","name":"吉木萨尔县"},{"code":"652328","name":"木垒哈萨克自治县"}]},{"code":"6527","name":"博尔塔拉蒙古自治州","children":[{"code":"652701","name":"博乐市"},{"code":"652702","name":"阿拉山口市"},{"code":"652722","name":"精河县"},{"code":"652723","name":"温泉县"}]},{"code":"6528","name":"巴音郭楞蒙古自治州","children":[{"code":"652801","name":"库尔勒市"},{"code":"652822","name":"轮台县"},{"code":"652823","name":"尉犁县"},{"code":"652824","name":"若羌县"},{"code":"652825","name":"且末县"},{"code":"652826","name":"焉耆回族自治县"},{"code":"652827","name":"和静县"},{"code":"652828","name":"和硕县"},{"code":"652829","name":"博湖县"}]},{"code":"6529","name":"阿克苏地区","children":[{"code":"652901","name":"阿克苏市"},{"code":"652902","name":"库车市"},{"code":"652922","name":"温宿县"},{"code":"652924","name":"沙雅县"},{"code":"652925","name":"新和县"},{"code":"652926","name":"拜城县"},{"code":"652927","name":"乌什县"},{"code":"652928","name":"阿瓦提县"},{"code":"652929","name":"柯坪县"}]},{"code":"6530","name":"克孜勒苏柯尔克孜自治州","children":[{"code":"653001","name":"阿图什市"},{"code":"653022","name":"阿克陶县"},{"code":"653023","name":"阿合奇县"},{"code":"653024","name":"乌恰县"}]},{"code":"6531","name":"喀什地区","children":[{"code":"653101","name":"喀什市"},{"code":"653121","name":"疏附县"},{"code":"653122","name":"疏勒县"},{"code":"653123","name":"英吉沙县"},{"code":"653124","name":"泽普县"},{"code":"653125","name":"莎车县"},{"code":"653126","name":"叶城县"},{"code":"653127","name":"麦盖提县"},{"code":"653128","name":"岳普湖县"},{"code":"653129","name":"伽师县"},{"code":"653130","name":"巴楚县"},{"code":"653131","name":"塔什库尔干塔吉克自治县"}]},{"code":"6532","name":"和田地区","children":[{"code":"653201","name":"和田市"},{"code":"653221","name":"和田县"},{"code":"653222","name":"墨玉县"},{"code":"653223","name":"皮山县"},{"code":"653224","name":"洛浦县"},{"code":"653225","name":"策勒县"},{"code":"653226","name":"于田县"},{"code":"653227","name":"民丰县"}]},{"code":"6540","name":"伊犁哈萨克自治州","children":[{"code":"654002","name":"伊宁市"},{"code":"654003","name":"奎屯市"},{"code":"654004","name":"霍尔果斯市"},{"code":"654021","name":"伊宁县"},{"code":"654022","name":"察布查尔锡伯自治县"},{"code":"654023","name":"霍城县"},{"code":"654024","name":"巩留县"},{"code":"654025","name":"新源县"},{"code":"654026","name":"昭苏县"},{"code":"654027","name":"特克斯县"},{"code":"654028","name":"尼勒克县"}]},{"code":"6542","name":"塔城地区","children":[{"code":"654201","name":"塔城市"},{"code":"654202","name":"乌苏市"},{"code":"654203","name":"沙湾市"},{"code":"654221","name":"额敏县"},{"code":"654224","name":"托里县"},{"code":"654225","name":"裕民县"},{"code":"654226","name":"和布克赛尔蒙古自治县"}]},{"code":"6543","name":"阿勒泰地区","children":[{"code":"654301","name":"阿勒泰市"},{"code":"654321","name":"布尔津县"},{"code":"654322","name":"富蕴县"},{"code":"654323","name":"福海县"},{"code":"654324","name":"哈巴河县"},{"code":"654325","name":"青河县"},{"code":"654326","name":"吉木乃县"}]},{"code":"6590","name":"自治区直辖县级行政区划","children":[{"code":"659001","name":"石河子市"},{"code":"659002","name":"阿拉尔市"},{"code":"659003","name":"图木舒克市"},{"code":"659004","name":"五家渠市"},{"code":"659005","name":"北屯市"},{"code":"659006","name":"铁门关市"},{"code":"659007","name":"双河市"},{"code":"659008","name":"可克达拉市"},{"code":"659009","name":"昆玉市"},{"code":"659010","name":"胡杨河市"},{"code":"659011","name":"新星市"},{"code":"659012","name":"白杨市"}]}]}]'), F1 = { class: "selector" }, U1 = /* @__PURE__ */ f({
  __name: "index",
  emits: ["change"],
  setup(t, { emit: e }) {
    let n = N(""), a = N(""), r = N(""), o = N(C2), i = I(() => n.value ? [...o.value.find((d) => d.code === n.value)?.children || []] : []), l = I(() => a.value ? [...i.value?.find((d) => d.code === a.value)?.children || []] : []);
    le(n, () => {
      a.value = "", r.value = "";
    }), le(a, () => {
      r.value = "";
    }), le(() => r.value, (u) => {
      if (u) {
        let d = {
          code: n.value,
          name: n && C2.find((p) => p.code === n.value).name
        }, g = {
          code: a.value,
          name: a.value && i.value.find((p) => p.code === a.value).name
        }, v = {
          code: u,
          name: u && l.value.find((p) => p.code === u).name
        };
        s("change", {
          province: d,
          city: g,
          area: v
        });
      }
    });
    let s = e;
    return (u, d) => {
      const g = q("el-option"), v = q("el-select");
      return m(), h("div", F1, [
        F(v, {
          placeholder: "请选择省份",
          modelValue: x(n),
          "onUpdate:modelValue": d[0] || (d[0] = (p) => Ce(n) ? n.value = p : n = p)
        }, {
          default: U(() => [
            (m(!0), h(
              ee,
              null,
              ue(x(o), (p) => (m(), B(g, {
                key: p.code,
                value: p.code,
                label: p.name
              }, null, 8, ["value", "label"]))),
              128
              /* KEYED_FRAGMENT */
            ))
          ]),
          _: 1
          /* STABLE */
        }, 8, ["modelValue"]),
        F(v, {
          disabled: !x(n),
          style: { margin: "0 10px" },
          placeholder: "请选择城市",
          modelValue: x(a),
          "onUpdate:modelValue": d[1] || (d[1] = (p) => Ce(a) ? a.value = p : a = p)
        }, {
          default: U(() => [
            (m(!0), h(
              ee,
              null,
              ue(x(i), (p) => (m(), B(g, {
                key: p.code,
                value: p.code,
                label: p.name
              }, null, 8, ["value", "label"]))),
              128
              /* KEYED_FRAGMENT */
            ))
          ]),
          _: 1
          /* STABLE */
        }, 8, ["disabled", "modelValue"]),
        F(v, {
          disabled: !x(n) || !x(a),
          placeholder: "请选择区域",
          modelValue: x(r),
          "onUpdate:modelValue": d[2] || (d[2] = (p) => Ce(r) ? r.value = p : r = p)
        }, {
          default: U(() => [
            (m(!0), h(
              ee,
              null,
              ue(x(l), (p) => (m(), B(g, {
                key: p.code,
                value: p.code,
                label: p.name
              }, null, 8, ["value", "label"]))),
              128
              /* KEYED_FRAGMENT */
            ))
          ]),
          _: 1
          /* STABLE */
        }, 8, ["disabled", "modelValue"])
      ]);
    };
  }
}), Ye = (t, e) => {
  const n = t.__vccOpts || t;
  for (const [a, r] of e)
    n[a] = r;
  return n;
}, W1 = /* @__PURE__ */ Ye(U1, [["__scopeId", "data-v-7185f890"]]), G1 = {
  install(t) {
    t.component("x-choose-area", W1);
  }
};
var $1 = /* @__PURE__ */ f({
  name: "AddLocation",
  __name: "add-location",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M288 896h448q32 0 32 32t-32 32H288q-32 0-32-32t32-32"
      }),
      c("path", {
        fill: "currentColor",
        d: "M800 416a288 288 0 1 0-576 0c0 118.144 94.528 272.128 288 456.576C705.472 688.128 800 534.144 800 416M512 960C277.312 746.688 160 565.312 160 416a352 352 0 0 1 704 0c0 149.312-117.312 330.688-352 544"
      }),
      c("path", {
        fill: "currentColor",
        d: "M544 384h96a32 32 0 1 1 0 64h-96v96a32 32 0 0 1-64 0v-96h-96a32 32 0 0 1 0-64h96v-96a32 32 0 0 1 64 0z"
      })
    ]));
  }
}), Q1 = $1, Y1 = /* @__PURE__ */ f({
  name: "Aim",
  __name: "aim",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M512 896a384 384 0 1 0 0-768 384 384 0 0 0 0 768m0 64a448 448 0 1 1 0-896 448 448 0 0 1 0 896"
      }),
      c("path", {
        fill: "currentColor",
        d: "M512 96a32 32 0 0 1 32 32v192a32 32 0 0 1-64 0V128a32 32 0 0 1 32-32m0 576a32 32 0 0 1 32 32v192a32 32 0 1 1-64 0V704a32 32 0 0 1 32-32M96 512a32 32 0 0 1 32-32h192a32 32 0 0 1 0 64H128a32 32 0 0 1-32-32m576 0a32 32 0 0 1 32-32h192a32 32 0 1 1 0 64H704a32 32 0 0 1-32-32"
      })
    ]));
  }
}), Z1 = Y1, K1 = /* @__PURE__ */ f({
  name: "AlarmClock",
  __name: "alarm-clock",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M512 832a320 320 0 1 0 0-640 320 320 0 0 0 0 640m0 64a384 384 0 1 1 0-768 384 384 0 0 1 0 768"
      }),
      c("path", {
        fill: "currentColor",
        d: "m292.288 824.576 55.424 32-48 83.136a32 32 0 1 1-55.424-32zm439.424 0-55.424 32 48 83.136a32 32 0 1 0 55.424-32zM512 512h160a32 32 0 1 1 0 64H480a32 32 0 0 1-32-32V320a32 32 0 0 1 64 0zM90.496 312.256A160 160 0 0 1 312.32 90.496l-46.848 46.848a96 96 0 0 0-128 128L90.56 312.256zm835.264 0A160 160 0 0 0 704 90.496l46.848 46.848a96 96 0 0 1 128 128z"
      })
    ]));
  }
}), X1 = K1, J1 = /* @__PURE__ */ f({
  name: "Apple",
  __name: "apple",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M599.872 203.776a189.4 189.4 0 0 1 64.384-4.672l2.624.128c31.168 1.024 51.2 4.096 79.488 16.32 37.632 16.128 74.496 45.056 111.488 89.344 96.384 115.264 82.752 372.8-34.752 521.728-7.68 9.728-32 41.6-30.72 39.936a427 427 0 0 1-30.08 35.776c-31.232 32.576-65.28 49.216-110.08 50.048-31.36.64-53.568-5.312-84.288-18.752l-6.528-2.88c-20.992-9.216-30.592-11.904-47.296-11.904-18.112 0-28.608 2.88-51.136 12.672l-6.464 2.816c-28.416 12.224-48.32 18.048-76.16 19.2-74.112 2.752-116.928-38.08-180.672-132.16-96.64-142.08-132.608-349.312-55.04-486.4 46.272-81.92 129.92-133.632 220.672-135.04 32.832-.576 60.288 6.848 99.648 22.72 27.136 10.88 34.752 13.76 37.376 14.272 16.256-20.16 27.776-36.992 34.56-50.24 13.568-26.304 27.2-59.968 40.704-100.8a32 32 0 1 1 60.8 20.224c-12.608 37.888-25.408 70.4-38.528 97.664m-51.52 78.08c-14.528 17.792-31.808 37.376-51.904 58.816a32 32 0 1 1-46.72-43.776l12.288-13.248c-28.032-11.2-61.248-26.688-95.68-26.112-70.4 1.088-135.296 41.6-171.648 105.792C121.6 492.608 176 684.16 247.296 788.992c34.816 51.328 76.352 108.992 130.944 106.944 52.48-2.112 72.32-34.688 135.872-34.688s81.28 34.688 136.96 33.536c56.448-1.088 75.776-39.04 126.848-103.872 107.904-136.768 107.904-362.752 35.776-449.088-72.192-86.272-124.672-84.096-151.68-85.12-41.472-4.288-81.6 12.544-113.664 25.152"
      })
    ]));
  }
}), ed = J1, td = /* @__PURE__ */ f({
  name: "ArrowDownBold",
  __name: "arrow-down-bold",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M104.704 338.752a64 64 0 0 1 90.496 0l316.8 316.8 316.8-316.8a64 64 0 0 1 90.496 90.496L557.248 791.296a64 64 0 0 1-90.496 0L104.704 429.248a64 64 0 0 1 0-90.496"
      })
    ]));
  }
}), nd = td, ad = /* @__PURE__ */ f({
  name: "ArrowDown",
  __name: "arrow-down",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M831.872 340.864 512 652.672 192.128 340.864a30.59 30.59 0 0 0-42.752 0 29.12 29.12 0 0 0 0 41.6L489.664 714.24a32 32 0 0 0 44.672 0l340.288-331.712a29.12 29.12 0 0 0 0-41.728 30.59 30.59 0 0 0-42.752 0z"
      })
    ]));
  }
}), rd = ad, od = /* @__PURE__ */ f({
  name: "ArrowLeftBold",
  __name: "arrow-left-bold",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M685.248 104.704a64 64 0 0 1 0 90.496L368.448 512l316.8 316.8a64 64 0 0 1-90.496 90.496L232.704 557.248a64 64 0 0 1 0-90.496l362.048-362.048a64 64 0 0 1 90.496 0"
      })
    ]));
  }
}), id = od, ld = /* @__PURE__ */ f({
  name: "ArrowLeft",
  __name: "arrow-left",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M609.408 149.376 277.76 489.6a32 32 0 0 0 0 44.672l331.648 340.352a29.12 29.12 0 0 0 41.728 0 30.59 30.59 0 0 0 0-42.752L339.264 511.936l311.872-319.872a30.59 30.59 0 0 0 0-42.688 29.12 29.12 0 0 0-41.728 0"
      })
    ]));
  }
}), sd = ld, cd = /* @__PURE__ */ f({
  name: "ArrowRightBold",
  __name: "arrow-right-bold",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M338.752 104.704a64 64 0 0 0 0 90.496l316.8 316.8-316.8 316.8a64 64 0 0 0 90.496 90.496l362.048-362.048a64 64 0 0 0 0-90.496L429.248 104.704a64 64 0 0 0-90.496 0"
      })
    ]));
  }
}), dd = cd, ud = /* @__PURE__ */ f({
  name: "ArrowRight",
  __name: "arrow-right",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M340.864 149.312a30.59 30.59 0 0 0 0 42.752L652.736 512 340.864 831.872a30.59 30.59 0 0 0 0 42.752 29.12 29.12 0 0 0 41.728 0L714.24 534.336a32 32 0 0 0 0-44.672L382.592 149.376a29.12 29.12 0 0 0-41.728 0z"
      })
    ]));
  }
}), md = ud, hd = /* @__PURE__ */ f({
  name: "ArrowUpBold",
  __name: "arrow-up-bold",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M104.704 685.248a64 64 0 0 0 90.496 0l316.8-316.8 316.8 316.8a64 64 0 0 0 90.496-90.496L557.248 232.704a64 64 0 0 0-90.496 0L104.704 594.752a64 64 0 0 0 0 90.496"
      })
    ]));
  }
}), fd = hd, pd = /* @__PURE__ */ f({
  name: "ArrowUp",
  __name: "arrow-up",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "m488.832 344.32-339.84 356.672a32 32 0 0 0 0 44.16l.384.384a29.44 29.44 0 0 0 42.688 0l320-335.872 319.872 335.872a29.44 29.44 0 0 0 42.688 0l.384-.384a32 32 0 0 0 0-44.16L535.168 344.32a32 32 0 0 0-46.336 0"
      })
    ]));
  }
}), gd = pd, vd = /* @__PURE__ */ f({
  name: "Avatar",
  __name: "avatar",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M628.736 528.896A416 416 0 0 1 928 928H96a415.87 415.87 0 0 1 299.264-399.104L512 704zM720 304a208 208 0 1 1-416 0 208 208 0 0 1 416 0"
      })
    ]));
  }
}), _d = vd, wd = /* @__PURE__ */ f({
  name: "Back",
  __name: "back",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M224 480h640a32 32 0 1 1 0 64H224a32 32 0 0 1 0-64"
      }),
      c("path", {
        fill: "currentColor",
        d: "m237.248 512 265.408 265.344a32 32 0 0 1-45.312 45.312l-288-288a32 32 0 0 1 0-45.312l288-288a32 32 0 1 1 45.312 45.312z"
      })
    ]));
  }
}), yd = wd, bd = /* @__PURE__ */ f({
  name: "Baseball",
  __name: "baseball",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M195.2 828.8a448 448 0 1 1 633.6-633.6 448 448 0 0 1-633.6 633.6m45.248-45.248a384 384 0 1 0 543.104-543.104 384 384 0 0 0-543.104 543.104"
      }),
      c("path", {
        fill: "currentColor",
        d: "M497.472 96.896c22.784 4.672 44.416 9.472 64.896 14.528a256.128 256.128 0 0 0 350.208 350.208c5.056 20.48 9.856 42.112 14.528 64.896A320.128 320.128 0 0 1 497.472 96.896M108.48 491.904a320.128 320.128 0 0 1 423.616 423.68c-23.04-3.648-44.992-7.424-65.728-11.52a256.128 256.128 0 0 0-346.496-346.432 1737 1737 0 0 1-11.392-65.728"
      })
    ]));
  }
}), Cd = bd, Ad = /* @__PURE__ */ f({
  name: "Basketball",
  __name: "basketball",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M778.752 788.224a382.46 382.46 0 0 0 116.032-245.632 256.51 256.51 0 0 0-241.728-13.952 762.9 762.9 0 0 1 125.696 259.584m-55.04 44.224a699.65 699.65 0 0 0-125.056-269.632 256.13 256.13 0 0 0-56.064 331.968 382.7 382.7 0 0 0 181.12-62.336m-254.08 61.248A320.13 320.13 0 0 1 557.76 513.6a716 716 0 0 0-48.192-48.128 320.13 320.13 0 0 1-379.264 88.384 382.4 382.4 0 0 0 110.144 229.696 382.4 382.4 0 0 0 229.184 110.08zM129.28 481.088a256.13 256.13 0 0 0 331.072-56.448 699.65 699.65 0 0 0-268.8-124.352 382.66 382.66 0 0 0-62.272 180.8m106.56-235.84a762.9 762.9 0 0 1 258.688 125.056 256.51 256.51 0 0 0-13.44-241.088A382.46 382.46 0 0 0 235.84 245.248m318.08-114.944c40.576 89.536 37.76 193.92-8.448 281.344a780 780 0 0 1 66.176 66.112 320.83 320.83 0 0 1 282.112-8.128 382.4 382.4 0 0 0-110.144-229.12 382.4 382.4 0 0 0-229.632-110.208zM828.8 828.8a448 448 0 1 1-633.6-633.6 448 448 0 0 1 633.6 633.6"
      })
    ]));
  }
}), xd = Ad, Ed = /* @__PURE__ */ f({
  name: "BellFilled",
  __name: "bell-filled",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M640 832a128 128 0 0 1-256 0zm192-64H134.4a38.4 38.4 0 0 1 0-76.8H192V448c0-154.88 110.08-284.16 256.32-313.6a64 64 0 1 1 127.36 0A320.13 320.13 0 0 1 832 448v243.2h57.6a38.4 38.4 0 0 1 0 76.8z"
      })
    ]));
  }
}), Sd = Ed, Md = /* @__PURE__ */ f({
  name: "Bell",
  __name: "bell",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M512 64a64 64 0 0 1 64 64v64H448v-64a64 64 0 0 1 64-64"
      }),
      c("path", {
        fill: "currentColor",
        d: "M256 768h512V448a256 256 0 1 0-512 0zm256-640a320 320 0 0 1 320 320v384H192V448a320 320 0 0 1 320-320"
      }),
      c("path", {
        fill: "currentColor",
        d: "M96 768h832q32 0 32 32t-32 32H96q-32 0-32-32t32-32m352 128h128a64 64 0 0 1-128 0"
      })
    ]));
  }
}), Dd = Md, Td = /* @__PURE__ */ f({
  name: "Bicycle",
  __name: "bicycle",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M256 832a128 128 0 1 0 0-256 128 128 0 0 0 0 256m0 64a192 192 0 1 1 0-384 192 192 0 0 1 0 384"
      }),
      c("path", {
        fill: "currentColor",
        d: "M288 672h320q32 0 32 32t-32 32H288q-32 0-32-32t32-32"
      }),
      c("path", {
        fill: "currentColor",
        d: "M768 832a128 128 0 1 0 0-256 128 128 0 0 0 0 256m0 64a192 192 0 1 1 0-384 192 192 0 0 1 0 384"
      }),
      c("path", {
        fill: "currentColor",
        d: "M480 192a32 32 0 0 1 0-64h160a32 32 0 0 1 31.04 24.256l96 384a32 32 0 0 1-62.08 15.488L615.04 192zM96 384a32 32 0 0 1 0-64h128a32 32 0 0 1 30.336 21.888l64 192a32 32 0 1 1-60.672 20.224L200.96 384z"
      }),
      c("path", {
        fill: "currentColor",
        d: "m373.376 599.808-42.752-47.616 320-288 42.752 47.616z"
      })
    ]));
  }
}), Rd = Td, Hd = /* @__PURE__ */ f({
  name: "BottomLeft",
  __name: "bottom-left",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M256 768h416a32 32 0 1 1 0 64H224a32 32 0 0 1-32-32V352a32 32 0 0 1 64 0z"
      }),
      c("path", {
        fill: "currentColor",
        d: "M246.656 822.656a32 32 0 0 1-45.312-45.312l544-544a32 32 0 0 1 45.312 45.312z"
      })
    ]));
  }
}), Id = Hd, kd = /* @__PURE__ */ f({
  name: "BottomRight",
  __name: "bottom-right",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M352 768a32 32 0 1 0 0 64h448a32 32 0 0 0 32-32V352a32 32 0 0 0-64 0v416z"
      }),
      c("path", {
        fill: "currentColor",
        d: "M777.344 822.656a32 32 0 0 0 45.312-45.312l-544-544a32 32 0 0 0-45.312 45.312z"
      })
    ]));
  }
}), zd = kd, Vd = /* @__PURE__ */ f({
  name: "Bottom",
  __name: "bottom",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M544 805.888V168a32 32 0 1 0-64 0v637.888L246.656 557.952a30.72 30.72 0 0 0-45.312 0 35.52 35.52 0 0 0 0 48.064l288 306.048a30.72 30.72 0 0 0 45.312 0l288-306.048a35.52 35.52 0 0 0 0-48 30.72 30.72 0 0 0-45.312 0L544 805.824z"
      })
    ]));
  }
}), Od = Vd, Bd = /* @__PURE__ */ f({
  name: "Bowl",
  __name: "bowl",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M714.432 704a351.74 351.74 0 0 0 148.16-256H161.408a351.74 351.74 0 0 0 148.16 256zM288 766.592A415.68 415.68 0 0 1 96 416a32 32 0 0 1 32-32h768a32 32 0 0 1 32 32 415.68 415.68 0 0 1-192 350.592V832a64 64 0 0 1-64 64H352a64 64 0 0 1-64-64zM493.248 320h-90.496l254.4-254.4a32 32 0 1 1 45.248 45.248zm187.328 0h-128l269.696-155.712a32 32 0 0 1 32 55.424zM352 768v64h320v-64z"
      })
    ]));
  }
}), Ld = Bd, Nd = /* @__PURE__ */ f({
  name: "Box",
  __name: "box",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M317.056 128 128 344.064V896h768V344.064L706.944 128zm-14.528-64h418.944a32 32 0 0 1 24.064 10.88l206.528 236.096A32 32 0 0 1 960 332.032V928a32 32 0 0 1-32 32H96a32 32 0 0 1-32-32V332.032a32 32 0 0 1 7.936-21.12L278.4 75.008A32 32 0 0 1 302.528 64"
      }),
      c("path", {
        fill: "currentColor",
        d: "M64 320h896v64H64z"
      }),
      c("path", {
        fill: "currentColor",
        d: "M448 327.872V640h128V327.872L526.08 128h-28.16zM448 64h128l64 256v352a32 32 0 0 1-32 32H416a32 32 0 0 1-32-32V320z"
      })
    ]));
  }
}), Pd = Nd, jd = /* @__PURE__ */ f({
  name: "Briefcase",
  __name: "briefcase",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M320 320V128h384v192h192v192H128V320zM128 576h768v320H128zm256-256h256.064V192H384z"
      })
    ]));
  }
}), qd = jd, Fd = /* @__PURE__ */ f({
  name: "BrushFilled",
  __name: "brush-filled",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M608 704v160a96 96 0 0 1-192 0V704h-96a128 128 0 0 1-128-128h640a128 128 0 0 1-128 128zM192 512V128.064h640V512z"
      })
    ]));
  }
}), Ud = Fd, Wd = /* @__PURE__ */ f({
  name: "Brush",
  __name: "brush",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M896 448H128v192a64 64 0 0 0 64 64h192v192h256V704h192a64 64 0 0 0 64-64zm-770.752-64c0-47.552 5.248-90.24 15.552-128 14.72-54.016 42.496-107.392 83.2-160h417.28l-15.36 70.336L736 96h211.2c-24.832 42.88-41.92 96.256-51.2 160a664 664 0 0 0-6.144 128H960v256a128 128 0 0 1-128 128H704v160a32 32 0 0 1-32 32H352a32 32 0 0 1-32-32V768H192A128 128 0 0 1 64 640V384zm64 0h636.544c-2.048-45.824.256-91.584 6.848-137.216 4.48-30.848 10.688-59.776 18.688-86.784h-96.64l-221.12 141.248L561.92 160H256.512c-25.856 37.888-43.776 75.456-53.952 112.832-8.768 32.064-13.248 69.12-13.312 111.168"
      })
    ]));
  }
}), Gd = Wd, $d = /* @__PURE__ */ f({
  name: "Burger",
  __name: "burger",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M160 512a32 32 0 0 0-32 32v64a32 32 0 0 0 30.08 32H864a32 32 0 0 0 32-32v-64a32 32 0 0 0-32-32zm736-58.56A96 96 0 0 1 960 544v64a96 96 0 0 1-51.968 85.312L855.36 833.6a96 96 0 0 1-89.856 62.272H258.496A96 96 0 0 1 168.64 833.6l-52.608-140.224A96 96 0 0 1 64 608v-64a96 96 0 0 1 64-90.56V448a384 384 0 1 1 768 5.44M832 448a320 320 0 0 0-640 0zM512 704H188.352l40.192 107.136a32 32 0 0 0 29.952 20.736h507.008a32 32 0 0 0 29.952-20.736L835.648 704z"
      })
    ]));
  }
}), Qd = $d, Yd = /* @__PURE__ */ f({
  name: "Calendar",
  __name: "calendar",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M128 384v512h768V192H768v32a32 32 0 1 1-64 0v-32H320v32a32 32 0 0 1-64 0v-32H128v128h768v64zm192-256h384V96a32 32 0 1 1 64 0v32h160a32 32 0 0 1 32 32v768a32 32 0 0 1-32 32H96a32 32 0 0 1-32-32V160a32 32 0 0 1 32-32h160V96a32 32 0 0 1 64 0zm-32 384h64a32 32 0 0 1 0 64h-64a32 32 0 0 1 0-64m0 192h64a32 32 0 1 1 0 64h-64a32 32 0 1 1 0-64m192-192h64a32 32 0 0 1 0 64h-64a32 32 0 0 1 0-64m0 192h64a32 32 0 1 1 0 64h-64a32 32 0 1 1 0-64m192-192h64a32 32 0 1 1 0 64h-64a32 32 0 1 1 0-64m0 192h64a32 32 0 1 1 0 64h-64a32 32 0 1 1 0-64"
      })
    ]));
  }
}), Zd = Yd, Kd = /* @__PURE__ */ f({
  name: "CameraFilled",
  __name: "camera-filled",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M160 224a64 64 0 0 0-64 64v512a64 64 0 0 0 64 64h704a64 64 0 0 0 64-64V288a64 64 0 0 0-64-64H748.416l-46.464-92.672A64 64 0 0 0 644.736 96H379.328a64 64 0 0 0-57.216 35.392L275.776 224zm352 435.2a115.2 115.2 0 1 0 0-230.4 115.2 115.2 0 0 0 0 230.4m0 140.8a256 256 0 1 1 0-512 256 256 0 0 1 0 512"
      })
    ]));
  }
}), Xd = Kd, Jd = /* @__PURE__ */ f({
  name: "Camera",
  __name: "camera",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M896 256H128v576h768zm-199.424-64-32.064-64h-304.96l-32 64zM96 192h160l46.336-92.608A64 64 0 0 1 359.552 64h304.96a64 64 0 0 1 57.216 35.328L768.192 192H928a32 32 0 0 1 32 32v640a32 32 0 0 1-32 32H96a32 32 0 0 1-32-32V224a32 32 0 0 1 32-32m416 512a160 160 0 1 0 0-320 160 160 0 0 0 0 320m0 64a224 224 0 1 1 0-448 224 224 0 0 1 0 448"
      })
    ]));
  }
}), e4 = Jd, t4 = /* @__PURE__ */ f({
  name: "CaretBottom",
  __name: "caret-bottom",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "m192 384 320 384 320-384z"
      })
    ]));
  }
}), n4 = t4, a4 = /* @__PURE__ */ f({
  name: "CaretLeft",
  __name: "caret-left",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M672 192 288 511.936 672 832z"
      })
    ]));
  }
}), r4 = a4, o4 = /* @__PURE__ */ f({
  name: "CaretRight",
  __name: "caret-right",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M384 192v640l384-320.064z"
      })
    ]));
  }
}), i4 = o4, l4 = /* @__PURE__ */ f({
  name: "CaretTop",
  __name: "caret-top",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M512 320 192 704h639.936z"
      })
    ]));
  }
}), s4 = l4, c4 = /* @__PURE__ */ f({
  name: "Cellphone",
  __name: "cellphone",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M256 128a64 64 0 0 0-64 64v640a64 64 0 0 0 64 64h512a64 64 0 0 0 64-64V192a64 64 0 0 0-64-64zm0-64h512a128 128 0 0 1 128 128v640a128 128 0 0 1-128 128H256a128 128 0 0 1-128-128V192A128 128 0 0 1 256 64m128 128h256a32 32 0 1 1 0 64H384a32 32 0 0 1 0-64m128 640a64 64 0 1 1 0-128 64 64 0 0 1 0 128"
      })
    ]));
  }
}), d4 = c4, u4 = /* @__PURE__ */ f({
  name: "ChatDotRound",
  __name: "chat-dot-round",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "m174.72 855.68 135.296-45.12 23.68 11.84C388.096 849.536 448.576 864 512 864c211.84 0 384-166.784 384-352S723.84 160 512 160 128 326.784 128 512c0 69.12 24.96 139.264 70.848 199.232l22.08 28.8-46.272 115.584zm-45.248 82.56A32 32 0 0 1 89.6 896l58.368-145.92C94.72 680.32 64 596.864 64 512 64 299.904 256 96 512 96s448 203.904 448 416-192 416-448 416a461.06 461.06 0 0 1-206.912-48.384l-175.616 58.56z"
      }),
      c("path", {
        fill: "currentColor",
        d: "M512 563.2a51.2 51.2 0 1 1 0-102.4 51.2 51.2 0 0 1 0 102.4m192 0a51.2 51.2 0 1 1 0-102.4 51.2 51.2 0 0 1 0 102.4m-384 0a51.2 51.2 0 1 1 0-102.4 51.2 51.2 0 0 1 0 102.4"
      })
    ]));
  }
}), m4 = u4, h4 = /* @__PURE__ */ f({
  name: "ChatDotSquare",
  __name: "chat-dot-square",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M273.536 736H800a64 64 0 0 0 64-64V256a64 64 0 0 0-64-64H224a64 64 0 0 0-64 64v570.88zM296 800 147.968 918.4A32 32 0 0 1 96 893.44V256a128 128 0 0 1 128-128h576a128 128 0 0 1 128 128v416a128 128 0 0 1-128 128z"
      }),
      c("path", {
        fill: "currentColor",
        d: "M512 499.2a51.2 51.2 0 1 1 0-102.4 51.2 51.2 0 0 1 0 102.4m192 0a51.2 51.2 0 1 1 0-102.4 51.2 51.2 0 0 1 0 102.4m-384 0a51.2 51.2 0 1 1 0-102.4 51.2 51.2 0 0 1 0 102.4"
      })
    ]));
  }
}), f4 = h4, p4 = /* @__PURE__ */ f({
  name: "ChatLineRound",
  __name: "chat-line-round",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "m174.72 855.68 135.296-45.12 23.68 11.84C388.096 849.536 448.576 864 512 864c211.84 0 384-166.784 384-352S723.84 160 512 160 128 326.784 128 512c0 69.12 24.96 139.264 70.848 199.232l22.08 28.8-46.272 115.584zm-45.248 82.56A32 32 0 0 1 89.6 896l58.368-145.92C94.72 680.32 64 596.864 64 512 64 299.904 256 96 512 96s448 203.904 448 416-192 416-448 416a461.06 461.06 0 0 1-206.912-48.384l-175.616 58.56z"
      }),
      c("path", {
        fill: "currentColor",
        d: "M352 576h320q32 0 32 32t-32 32H352q-32 0-32-32t32-32m32-192h256q32 0 32 32t-32 32H384q-32 0-32-32t32-32"
      })
    ]));
  }
}), g4 = p4, v4 = /* @__PURE__ */ f({
  name: "ChatLineSquare",
  __name: "chat-line-square",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M160 826.88 273.536 736H800a64 64 0 0 0 64-64V256a64 64 0 0 0-64-64H224a64 64 0 0 0-64 64zM296 800 147.968 918.4A32 32 0 0 1 96 893.44V256a128 128 0 0 1 128-128h576a128 128 0 0 1 128 128v416a128 128 0 0 1-128 128z"
      }),
      c("path", {
        fill: "currentColor",
        d: "M352 512h320q32 0 32 32t-32 32H352q-32 0-32-32t32-32m0-192h320q32 0 32 32t-32 32H352q-32 0-32-32t32-32"
      })
    ]));
  }
}), _4 = v4, w4 = /* @__PURE__ */ f({
  name: "ChatRound",
  __name: "chat-round",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "m174.72 855.68 130.048-43.392 23.424 11.392C382.4 849.984 444.352 864 512 864c223.744 0 384-159.872 384-352 0-192.832-159.104-352-384-352S128 319.168 128 512a341.12 341.12 0 0 0 69.248 204.288l21.632 28.8-44.16 110.528zm-45.248 82.56A32 32 0 0 1 89.6 896l56.512-141.248A405.12 405.12 0 0 1 64 512C64 299.904 235.648 96 512 96s448 203.904 448 416-173.44 416-448 416c-79.68 0-150.848-17.152-211.712-46.72l-170.88 56.96z"
      })
    ]));
  }
}), y4 = w4, b4 = /* @__PURE__ */ f({
  name: "ChatSquare",
  __name: "chat-square",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M273.536 736H800a64 64 0 0 0 64-64V256a64 64 0 0 0-64-64H224a64 64 0 0 0-64 64v570.88zM296 800 147.968 918.4A32 32 0 0 1 96 893.44V256a128 128 0 0 1 128-128h576a128 128 0 0 1 128 128v416a128 128 0 0 1-128 128z"
      })
    ]));
  }
}), C4 = b4, A4 = /* @__PURE__ */ f({
  name: "Check",
  __name: "check",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M406.656 706.944 195.84 496.256a32 32 0 1 0-45.248 45.248l256 256 512-512a32 32 0 0 0-45.248-45.248L406.592 706.944z"
      })
    ]));
  }
}), x4 = A4, E4 = /* @__PURE__ */ f({
  name: "Checked",
  __name: "checked",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M704 192h160v736H160V192h160.064v64H704zM311.616 537.28l-45.312 45.248L447.36 763.52l316.8-316.8-45.312-45.184L447.36 673.024zM384 192V96h256v96z"
      })
    ]));
  }
}), S4 = E4, M4 = /* @__PURE__ */ f({
  name: "Cherry",
  __name: "cherry",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M261.056 449.6c13.824-69.696 34.88-128.96 63.36-177.728 23.744-40.832 61.12-88.64 112.256-143.872H320a32 32 0 0 1 0-64h384a32 32 0 1 1 0 64H554.752c14.912 39.168 41.344 86.592 79.552 141.76 47.36 68.48 84.8 106.752 106.304 114.304a224 224 0 1 1-84.992 14.784c-22.656-22.912-47.04-53.76-73.92-92.608-38.848-56.128-67.008-105.792-84.352-149.312-55.296 58.24-94.528 107.52-117.76 147.2-23.168 39.744-41.088 88.768-53.568 147.072a224.064 224.064 0 1 1-64.96-1.6M288 832a160 160 0 1 0 0-320 160 160 0 0 0 0 320m448-64a160 160 0 1 0 0-320 160 160 0 0 0 0 320"
      })
    ]));
  }
}), D4 = M4, T4 = /* @__PURE__ */ f({
  name: "Chicken",
  __name: "chicken",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M349.952 716.992 478.72 588.16a106.7 106.7 0 0 1-26.176-19.072 106.7 106.7 0 0 1-19.072-26.176L304.704 671.744c.768 3.072 1.472 6.144 2.048 9.216l2.048 31.936 31.872 1.984c3.136.64 6.208 1.28 9.28 2.112m57.344 33.152a128 128 0 1 1-216.32 114.432l-1.92-32-32-1.92a128 128 0 1 1 114.432-216.32L416.64 469.248c-2.432-101.44 58.112-239.104 149.056-330.048 107.328-107.328 231.296-85.504 316.8 0 85.44 85.44 107.328 209.408 0 316.8-91.008 90.88-228.672 151.424-330.112 149.056L407.296 750.08zm90.496-226.304c49.536 49.536 233.344-7.04 339.392-113.088 78.208-78.208 63.232-163.072 0-226.304-63.168-63.232-148.032-78.208-226.24 0C504.896 290.496 448.32 474.368 497.792 523.84M244.864 708.928a64 64 0 1 0-59.84 59.84l56.32-3.52zm8.064 127.68a64 64 0 1 0 59.84-59.84l-56.32 3.52z"
      })
    ]));
  }
}), R4 = T4, H4 = /* @__PURE__ */ f({
  name: "ChromeFilled",
  __name: "chrome-filled",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      "xml:space": "preserve",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M938.67 512.01c0-44.59-6.82-87.6-19.54-128H682.67a212.37 212.37 0 0 1 42.67 128c.06 38.71-10.45 76.7-30.42 109.87l-182.91 316.8c235.65-.01 426.66-191.02 426.66-426.67"
      }),
      c("path", {
        fill: "currentColor",
        d: "M576.79 401.63a127.9 127.9 0 0 0-63.56-17.6c-22.36-.22-44.39 5.43-63.89 16.38s-35.79 26.82-47.25 46.02a128 128 0 0 0-2.16 127.44l1.24 2.13a127.9 127.9 0 0 0 46.36 46.61 127.9 127.9 0 0 0 63.38 17.44c22.29.2 44.24-5.43 63.68-16.33a127.94 127.94 0 0 0 47.16-45.79v-.01l1.11-1.92a127.98 127.98 0 0 0 .29-127.46 127.96 127.96 0 0 0-46.36-46.91"
      }),
      c("path", {
        fill: "currentColor",
        d: "M394.45 333.96A213.34 213.34 0 0 1 512 298.67h369.58A426.5 426.5 0 0 0 512 85.34a425.6 425.6 0 0 0-171.74 35.98 425.6 425.6 0 0 0-142.62 102.22l118.14 204.63a213.4 213.4 0 0 1 78.67-94.21m117.56 604.72H512zm-97.25-236.73a213.3 213.3 0 0 1-89.54-86.81L142.48 298.6c-36.35 62.81-57.13 135.68-57.13 213.42 0 203.81 142.93 374.22 333.95 416.55h.04l118.19-204.71a213.3 213.3 0 0 1-122.77-21.91"
      })
    ]));
  }
}), I4 = H4, k4 = /* @__PURE__ */ f({
  name: "CircleCheckFilled",
  __name: "circle-check-filled",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M512 64a448 448 0 1 1 0 896 448 448 0 0 1 0-896m-55.808 536.384-99.52-99.584a38.4 38.4 0 1 0-54.336 54.336l126.72 126.72a38.27 38.27 0 0 0 54.336 0l262.4-262.464a38.4 38.4 0 1 0-54.272-54.336z"
      })
    ]));
  }
}), z4 = k4, V4 = /* @__PURE__ */ f({
  name: "CircleCheck",
  __name: "circle-check",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M512 896a384 384 0 1 0 0-768 384 384 0 0 0 0 768m0 64a448 448 0 1 1 0-896 448 448 0 0 1 0 896"
      }),
      c("path", {
        fill: "currentColor",
        d: "M745.344 361.344a32 32 0 0 1 45.312 45.312l-288 288a32 32 0 0 1-45.312 0l-160-160a32 32 0 1 1 45.312-45.312L480 626.752z"
      })
    ]));
  }
}), O4 = V4, B4 = /* @__PURE__ */ f({
  name: "CircleCloseFilled",
  __name: "circle-close-filled",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M512 64a448 448 0 1 1 0 896 448 448 0 0 1 0-896m0 393.664L407.936 353.6a38.4 38.4 0 1 0-54.336 54.336L457.664 512 353.6 616.064a38.4 38.4 0 1 0 54.336 54.336L512 566.336 616.064 670.4a38.4 38.4 0 1 0 54.336-54.336L566.336 512 670.4 407.936a38.4 38.4 0 1 0-54.336-54.336z"
      })
    ]));
  }
}), Gl = B4, L4 = /* @__PURE__ */ f({
  name: "CircleClose",
  __name: "circle-close",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "m466.752 512-90.496-90.496a32 32 0 0 1 45.248-45.248L512 466.752l90.496-90.496a32 32 0 1 1 45.248 45.248L557.248 512l90.496 90.496a32 32 0 1 1-45.248 45.248L512 557.248l-90.496 90.496a32 32 0 0 1-45.248-45.248z"
      }),
      c("path", {
        fill: "currentColor",
        d: "M512 896a384 384 0 1 0 0-768 384 384 0 0 0 0 768m0 64a448 448 0 1 1 0-896 448 448 0 0 1 0 896"
      })
    ]));
  }
}), N4 = L4, P4 = /* @__PURE__ */ f({
  name: "CirclePlusFilled",
  __name: "circle-plus-filled",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M512 64a448 448 0 1 1 0 896 448 448 0 0 1 0-896m-38.4 409.6H326.4a38.4 38.4 0 1 0 0 76.8h147.2v147.2a38.4 38.4 0 0 0 76.8 0V550.4h147.2a38.4 38.4 0 0 0 0-76.8H550.4V326.4a38.4 38.4 0 1 0-76.8 0z"
      })
    ]));
  }
}), j4 = P4, q4 = /* @__PURE__ */ f({
  name: "CirclePlus",
  __name: "circle-plus",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M352 480h320a32 32 0 1 1 0 64H352a32 32 0 0 1 0-64"
      }),
      c("path", {
        fill: "currentColor",
        d: "M480 672V352a32 32 0 1 1 64 0v320a32 32 0 0 1-64 0"
      }),
      c("path", {
        fill: "currentColor",
        d: "M512 896a384 384 0 1 0 0-768 384 384 0 0 0 0 768m0 64a448 448 0 1 1 0-896 448 448 0 0 1 0 896"
      })
    ]));
  }
}), F4 = q4, U4 = /* @__PURE__ */ f({
  name: "Clock",
  __name: "clock",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M512 896a384 384 0 1 0 0-768 384 384 0 0 0 0 768m0 64a448 448 0 1 1 0-896 448 448 0 0 1 0 896"
      }),
      c("path", {
        fill: "currentColor",
        d: "M480 256a32 32 0 0 1 32 32v256a32 32 0 0 1-64 0V288a32 32 0 0 1 32-32"
      }),
      c("path", {
        fill: "currentColor",
        d: "M480 512h256q32 0 32 32t-32 32H480q-32 0-32-32t32-32"
      })
    ]));
  }
}), W4 = U4, G4 = /* @__PURE__ */ f({
  name: "CloseBold",
  __name: "close-bold",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M195.2 195.2a64 64 0 0 1 90.496 0L512 421.504 738.304 195.2a64 64 0 0 1 90.496 90.496L602.496 512 828.8 738.304a64 64 0 0 1-90.496 90.496L512 602.496 285.696 828.8a64 64 0 0 1-90.496-90.496L421.504 512 195.2 285.696a64 64 0 0 1 0-90.496"
      })
    ]));
  }
}), $4 = G4, Q4 = /* @__PURE__ */ f({
  name: "Close",
  __name: "close",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M764.288 214.592 512 466.88 259.712 214.592a31.936 31.936 0 0 0-45.12 45.12L466.752 512 214.528 764.224a31.936 31.936 0 1 0 45.12 45.184L512 557.184l252.288 252.288a31.936 31.936 0 0 0 45.12-45.12L557.12 512.064l252.288-252.352a31.936 31.936 0 1 0-45.12-45.184z"
      })
    ]));
  }
}), $l = Q4, Y4 = /* @__PURE__ */ f({
  name: "Cloudy",
  __name: "cloudy",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M598.4 831.872H328.192a256 256 0 0 1-34.496-510.528A352 352 0 1 1 598.4 831.872m-271.36-64h272.256a288 288 0 1 0-248.512-417.664L335.04 381.44l-34.816 3.584a192 192 0 0 0 26.88 382.848z"
      })
    ]));
  }
}), Z4 = Y4, K4 = /* @__PURE__ */ f({
  name: "CoffeeCup",
  __name: "coffee-cup",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M768 192a192 192 0 1 1-8 383.808A256.13 256.13 0 0 1 512 768H320A256 256 0 0 1 64 512V160a32 32 0 0 1 32-32h640a32 32 0 0 1 32 32zm0 64v256a128 128 0 1 0 0-256M96 832h640a32 32 0 1 1 0 64H96a32 32 0 1 1 0-64m32-640v320a192 192 0 0 0 192 192h192a192 192 0 0 0 192-192V192z"
      })
    ]));
  }
}), X4 = K4, J4 = /* @__PURE__ */ f({
  name: "Coffee",
  __name: "coffee",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M822.592 192h14.272a32 32 0 0 1 31.616 26.752l21.312 128A32 32 0 0 1 858.24 384h-49.344l-39.04 546.304A32 32 0 0 1 737.92 960H285.824a32 32 0 0 1-32-29.696L214.912 384H165.76a32 32 0 0 1-31.552-37.248l21.312-128A32 32 0 0 1 187.136 192h14.016l-6.72-93.696A32 32 0 0 1 226.368 64h571.008a32 32 0 0 1 31.936 34.304zm-64.128 0 4.544-64H260.736l4.544 64zm-548.16 128H820.48l-10.688-64H214.208l-10.688 64zm68.736 64 36.544 512H708.16l36.544-512z"
      })
    ]));
  }
}), e3 = J4, t3 = /* @__PURE__ */ f({
  name: "Coin",
  __name: "coin",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "m161.92 580.736 29.888 58.88C171.328 659.776 160 681.728 160 704c0 82.304 155.328 160 352 160s352-77.696 352-160c0-22.272-11.392-44.16-31.808-64.32l30.464-58.432C903.936 615.808 928 657.664 928 704c0 129.728-188.544 224-416 224S96 833.728 96 704c0-46.592 24.32-88.576 65.92-123.264"
      }),
      c("path", {
        fill: "currentColor",
        d: "m161.92 388.736 29.888 58.88C171.328 467.84 160 489.792 160 512c0 82.304 155.328 160 352 160s352-77.696 352-160c0-22.272-11.392-44.16-31.808-64.32l30.464-58.432C903.936 423.808 928 465.664 928 512c0 129.728-188.544 224-416 224S96 641.728 96 512c0-46.592 24.32-88.576 65.92-123.264"
      }),
      c("path", {
        fill: "currentColor",
        d: "M512 544c-227.456 0-416-94.272-416-224S284.544 96 512 96s416 94.272 416 224-188.544 224-416 224m0-64c196.672 0 352-77.696 352-160S708.672 160 512 160s-352 77.696-352 160 155.328 160 352 160"
      })
    ]));
  }
}), n3 = t3, a3 = /* @__PURE__ */ f({
  name: "ColdDrink",
  __name: "cold-drink",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M768 64a192 192 0 1 1-69.952 370.88L480 725.376V896h96a32 32 0 1 1 0 64H320a32 32 0 1 1 0-64h96V725.376L76.8 273.536a64 64 0 0 1-12.8-38.4v-10.688a32 32 0 0 1 32-32h71.808l-65.536-83.84a32 32 0 0 1 50.432-39.424l96.256 123.264h337.728A192.06 192.06 0 0 1 768 64M656.896 192.448H800a32 32 0 0 1 32 32v10.624a64 64 0 0 1-12.8 38.4l-80.448 107.2a128 128 0 1 0-81.92-188.16v-.064zm-357.888 64 129.472 165.76a32 32 0 0 1-50.432 39.36l-160.256-205.12H144l304 404.928 304-404.928z"
      })
    ]));
  }
}), r3 = a3, o3 = /* @__PURE__ */ f({
  name: "CollectionTag",
  __name: "collection-tag",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M256 128v698.88l196.032-156.864a96 96 0 0 1 119.936 0L768 826.816V128zm-32-64h576a32 32 0 0 1 32 32v797.44a32 32 0 0 1-51.968 24.96L531.968 720a32 32 0 0 0-39.936 0L243.968 918.4A32 32 0 0 1 192 893.44V96a32 32 0 0 1 32-32"
      })
    ]));
  }
}), i3 = o3, l3 = /* @__PURE__ */ f({
  name: "Collection",
  __name: "collection",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M192 736h640V128H256a64 64 0 0 0-64 64zm64-672h608a32 32 0 0 1 32 32v672a32 32 0 0 1-32 32H160l-32 57.536V192A128 128 0 0 1 256 64"
      }),
      c("path", {
        fill: "currentColor",
        d: "M240 800a48 48 0 1 0 0 96h592v-96zm0-64h656v160a64 64 0 0 1-64 64H240a112 112 0 0 1 0-224m144-608v250.88l96-76.8 96 76.8V128zm-64-64h320v381.44a32 32 0 0 1-51.968 24.96L480 384l-108.032 86.4A32 32 0 0 1 320 445.44z"
      })
    ]));
  }
}), s3 = l3, c3 = /* @__PURE__ */ f({
  name: "Comment",
  __name: "comment",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M736 504a56 56 0 1 1 0-112 56 56 0 0 1 0 112m-224 0a56 56 0 1 1 0-112 56 56 0 0 1 0 112m-224 0a56 56 0 1 1 0-112 56 56 0 0 1 0 112M128 128v640h192v160l224-160h352V128z"
      })
    ]));
  }
}), d3 = c3, u3 = /* @__PURE__ */ f({
  name: "Compass",
  __name: "compass",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M512 896a384 384 0 1 0 0-768 384 384 0 0 0 0 768m0 64a448 448 0 1 1 0-896 448 448 0 0 1 0 896"
      }),
      c("path", {
        fill: "currentColor",
        d: "M725.888 315.008C676.48 428.672 624 513.28 568.576 568.64c-55.424 55.424-139.968 107.904-253.568 157.312a12.8 12.8 0 0 1-16.896-16.832c49.536-113.728 102.016-198.272 157.312-253.632 55.36-55.296 139.904-107.776 253.632-157.312a12.8 12.8 0 0 1 16.832 16.832"
      })
    ]));
  }
}), m3 = u3, h3 = /* @__PURE__ */ f({
  name: "Connection",
  __name: "connection",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M640 384v64H448a128 128 0 0 0-128 128v128a128 128 0 0 0 128 128h320a128 128 0 0 0 128-128V576a128 128 0 0 0-64-110.848V394.88c74.56 26.368 128 97.472 128 181.056v128a192 192 0 0 1-192 192H448a192 192 0 0 1-192-192V576a192 192 0 0 1 192-192z"
      }),
      c("path", {
        fill: "currentColor",
        d: "M384 640v-64h192a128 128 0 0 0 128-128V320a128 128 0 0 0-128-128H256a128 128 0 0 0-128 128v128a128 128 0 0 0 64 110.848v70.272A192.06 192.06 0 0 1 64 448V320a192 192 0 0 1 192-192h320a192 192 0 0 1 192 192v128a192 192 0 0 1-192 192z"
      })
    ]));
  }
}), f3 = h3, p3 = /* @__PURE__ */ f({
  name: "Coordinate",
  __name: "coordinate",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M480 512h64v320h-64z"
      }),
      c("path", {
        fill: "currentColor",
        d: "M192 896h640a64 64 0 0 0-64-64H256a64 64 0 0 0-64 64m64-128h512a128 128 0 0 1 128 128v64H128v-64a128 128 0 0 1 128-128m256-256a192 192 0 1 0 0-384 192 192 0 0 0 0 384m0 64a256 256 0 1 1 0-512 256 256 0 0 1 0 512"
      })
    ]));
  }
}), g3 = p3, v3 = /* @__PURE__ */ f({
  name: "CopyDocument",
  __name: "copy-document",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M768 832a128 128 0 0 1-128 128H192A128 128 0 0 1 64 832V384a128 128 0 0 1 128-128v64a64 64 0 0 0-64 64v448a64 64 0 0 0 64 64h448a64 64 0 0 0 64-64z"
      }),
      c("path", {
        fill: "currentColor",
        d: "M384 128a64 64 0 0 0-64 64v448a64 64 0 0 0 64 64h448a64 64 0 0 0 64-64V192a64 64 0 0 0-64-64zm0-64h448a128 128 0 0 1 128 128v448a128 128 0 0 1-128 128H384a128 128 0 0 1-128-128V192A128 128 0 0 1 384 64"
      })
    ]));
  }
}), _3 = v3, w3 = /* @__PURE__ */ f({
  name: "Cpu",
  __name: "cpu",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M320 256a64 64 0 0 0-64 64v384a64 64 0 0 0 64 64h384a64 64 0 0 0 64-64V320a64 64 0 0 0-64-64zm0-64h384a128 128 0 0 1 128 128v384a128 128 0 0 1-128 128H320a128 128 0 0 1-128-128V320a128 128 0 0 1 128-128"
      }),
      c("path", {
        fill: "currentColor",
        d: "M512 64a32 32 0 0 1 32 32v128h-64V96a32 32 0 0 1 32-32m160 0a32 32 0 0 1 32 32v128h-64V96a32 32 0 0 1 32-32m-320 0a32 32 0 0 1 32 32v128h-64V96a32 32 0 0 1 32-32m160 896a32 32 0 0 1-32-32V800h64v128a32 32 0 0 1-32 32m160 0a32 32 0 0 1-32-32V800h64v128a32 32 0 0 1-32 32m-320 0a32 32 0 0 1-32-32V800h64v128a32 32 0 0 1-32 32M64 512a32 32 0 0 1 32-32h128v64H96a32 32 0 0 1-32-32m0-160a32 32 0 0 1 32-32h128v64H96a32 32 0 0 1-32-32m0 320a32 32 0 0 1 32-32h128v64H96a32 32 0 0 1-32-32m896-160a32 32 0 0 1-32 32H800v-64h128a32 32 0 0 1 32 32m0-160a32 32 0 0 1-32 32H800v-64h128a32 32 0 0 1 32 32m0 320a32 32 0 0 1-32 32H800v-64h128a32 32 0 0 1 32 32"
      })
    ]));
  }
}), y3 = w3, b3 = /* @__PURE__ */ f({
  name: "CreditCard",
  __name: "credit-card",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M896 324.096c0-42.368-2.496-55.296-9.536-68.48a52.35 52.35 0 0 0-22.144-22.08c-13.12-7.04-26.048-9.536-68.416-9.536H228.096c-42.368 0-55.296 2.496-68.48 9.536a52.35 52.35 0 0 0-22.08 22.144c-7.04 13.12-9.536 26.048-9.536 68.416v375.808c0 42.368 2.496 55.296 9.536 68.48a52.35 52.35 0 0 0 22.144 22.08c13.12 7.04 26.048 9.536 68.416 9.536h567.808c42.368 0 55.296-2.496 68.48-9.536a52.35 52.35 0 0 0 22.08-22.144c7.04-13.12 9.536-26.048 9.536-68.416zm64 0v375.808c0 57.088-5.952 77.76-17.088 98.56-11.136 20.928-27.52 37.312-48.384 48.448S852.928 864 795.968 864H228.032c-57.088 0-77.76-5.952-98.56-17.088a116.3 116.3 0 0 1-48.448-48.384c-11.136-20.864-17.088-41.6-17.088-98.56V324.032c0-57.088 5.952-77.76 17.088-98.56 11.136-20.928 27.52-37.312 48.384-48.448s41.6-17.088 98.56-17.088H795.84c57.088 0 77.76 5.952 98.56 17.088 20.928 11.136 37.312 27.52 48.448 48.384s17.088 41.6 17.088 98.56z"
      }),
      c("path", {
        fill: "currentColor",
        d: "M64 320h896v64H64zm0 128h896v64H64zm128 192h256v64H192z"
      })
    ]));
  }
}), C3 = b3, A3 = /* @__PURE__ */ f({
  name: "Crop",
  __name: "crop",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M256 768h672a32 32 0 1 1 0 64H224a32 32 0 0 1-32-32V96a32 32 0 0 1 64 0z"
      }),
      c("path", {
        fill: "currentColor",
        d: "M832 224v704a32 32 0 1 1-64 0V256H96a32 32 0 0 1 0-64h704a32 32 0 0 1 32 32"
      })
    ]));
  }
}), x3 = A3, E3 = /* @__PURE__ */ f({
  name: "DArrowLeft",
  __name: "d-arrow-left",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M529.408 149.376a29.12 29.12 0 0 1 41.728 0 30.59 30.59 0 0 1 0 42.688L259.264 511.936l311.872 319.936a30.59 30.59 0 0 1-.512 43.264 29.12 29.12 0 0 1-41.216-.512L197.76 534.272a32 32 0 0 1 0-44.672zm256 0a29.12 29.12 0 0 1 41.728 0 30.59 30.59 0 0 1 0 42.688L515.264 511.936l311.872 319.936a30.59 30.59 0 0 1-.512 43.264 29.12 29.12 0 0 1-41.216-.512L453.76 534.272a32 32 0 0 1 0-44.672z"
      })
    ]));
  }
}), S3 = E3, M3 = /* @__PURE__ */ f({
  name: "DArrowRight",
  __name: "d-arrow-right",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M452.864 149.312a29.12 29.12 0 0 1 41.728.064L826.24 489.664a32 32 0 0 1 0 44.672L494.592 874.624a29.12 29.12 0 0 1-41.728 0 30.59 30.59 0 0 1 0-42.752L764.736 512 452.864 192a30.59 30.59 0 0 1 0-42.688m-256 0a29.12 29.12 0 0 1 41.728.064L570.24 489.664a32 32 0 0 1 0 44.672L238.592 874.624a29.12 29.12 0 0 1-41.728 0 30.59 30.59 0 0 1 0-42.752L508.736 512 196.864 192a30.59 30.59 0 0 1 0-42.688"
      })
    ]));
  }
}), D3 = M3, T3 = /* @__PURE__ */ f({
  name: "DCaret",
  __name: "d-caret",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "m512 128 288 320H224zM224 576h576L512 896z"
      })
    ]));
  }
}), R3 = T3, H3 = /* @__PURE__ */ f({
  name: "DataAnalysis",
  __name: "data-analysis",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "m665.216 768 110.848 192h-73.856L591.36 768H433.024L322.176 960H248.32l110.848-192H160a32 32 0 0 1-32-32V192H64a32 32 0 0 1 0-64h896a32 32 0 1 1 0 64h-64v544a32 32 0 0 1-32 32zM832 192H192v512h640zM352 448a32 32 0 0 1 32 32v64a32 32 0 0 1-64 0v-64a32 32 0 0 1 32-32m160-64a32 32 0 0 1 32 32v128a32 32 0 0 1-64 0V416a32 32 0 0 1 32-32m160-64a32 32 0 0 1 32 32v192a32 32 0 1 1-64 0V352a32 32 0 0 1 32-32"
      })
    ]));
  }
}), I3 = H3, k3 = /* @__PURE__ */ f({
  name: "DataBoard",
  __name: "data-board",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M32 128h960v64H32z"
      }),
      c("path", {
        fill: "currentColor",
        d: "M192 192v512h640V192zm-64-64h768v608a32 32 0 0 1-32 32H160a32 32 0 0 1-32-32z"
      }),
      c("path", {
        fill: "currentColor",
        d: "M322.176 960H248.32l144.64-250.56 55.424 32zm453.888 0h-73.856L576 741.44l55.424-32z"
      })
    ]));
  }
}), z3 = k3, V3 = /* @__PURE__ */ f({
  name: "DataLine",
  __name: "data-line",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M359.168 768H160a32 32 0 0 1-32-32V192H64a32 32 0 0 1 0-64h896a32 32 0 1 1 0 64h-64v544a32 32 0 0 1-32 32H665.216l110.848 192h-73.856L591.36 768H433.024L322.176 960H248.32zM832 192H192v512h640zM342.656 534.656a32 32 0 1 1-45.312-45.312L444.992 341.76l125.44 94.08L679.04 300.032a32 32 0 1 1 49.92 39.936L581.632 524.224 451.008 426.24 342.656 534.592z"
      })
    ]));
  }
}), O3 = V3, B3 = /* @__PURE__ */ f({
  name: "DeleteFilled",
  __name: "delete-filled",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M352 192V95.936a32 32 0 0 1 32-32h256a32 32 0 0 1 32 32V192h256a32 32 0 1 1 0 64H96a32 32 0 0 1 0-64zm64 0h192v-64H416zM192 960a32 32 0 0 1-32-32V256h704v672a32 32 0 0 1-32 32zm224-192a32 32 0 0 0 32-32V416a32 32 0 0 0-64 0v320a32 32 0 0 0 32 32m192 0a32 32 0 0 0 32-32V416a32 32 0 0 0-64 0v320a32 32 0 0 0 32 32"
      })
    ]));
  }
}), L3 = B3, N3 = /* @__PURE__ */ f({
  name: "DeleteLocation",
  __name: "delete-location",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M288 896h448q32 0 32 32t-32 32H288q-32 0-32-32t32-32"
      }),
      c("path", {
        fill: "currentColor",
        d: "M800 416a288 288 0 1 0-576 0c0 118.144 94.528 272.128 288 456.576C705.472 688.128 800 534.144 800 416M512 960C277.312 746.688 160 565.312 160 416a352 352 0 0 1 704 0c0 149.312-117.312 330.688-352 544"
      }),
      c("path", {
        fill: "currentColor",
        d: "M384 384h256q32 0 32 32t-32 32H384q-32 0-32-32t32-32"
      })
    ]));
  }
}), P3 = N3, j3 = /* @__PURE__ */ f({
  name: "Delete",
  __name: "delete",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M160 256H96a32 32 0 0 1 0-64h256V95.936a32 32 0 0 1 32-32h256a32 32 0 0 1 32 32V192h256a32 32 0 1 1 0 64h-64v672a32 32 0 0 1-32 32H192a32 32 0 0 1-32-32zm448-64v-64H416v64zM224 896h576V256H224zm192-128a32 32 0 0 1-32-32V416a32 32 0 0 1 64 0v320a32 32 0 0 1-32 32m192 0a32 32 0 0 1-32-32V416a32 32 0 0 1 64 0v320a32 32 0 0 1-32 32"
      })
    ]));
  }
}), q3 = j3, F3 = /* @__PURE__ */ f({
  name: "Dessert",
  __name: "dessert",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M128 416v-48a144 144 0 0 1 168.64-141.888 224.128 224.128 0 0 1 430.72 0A144 144 0 0 1 896 368v48a384 384 0 0 1-352 382.72V896h-64v-97.28A384 384 0 0 1 128 416m287.104-32.064h193.792a143.81 143.81 0 0 1 58.88-132.736 160.064 160.064 0 0 0-311.552 0 143.81 143.81 0 0 1 58.88 132.8zm-72.896 0a72 72 0 1 0-140.48 0zm339.584 0h140.416a72 72 0 1 0-140.48 0zM512 736a320 320 0 0 0 318.4-288.064H193.6A320 320 0 0 0 512 736M384 896.064h256a32 32 0 1 1 0 64H384a32 32 0 1 1 0-64"
      })
    ]));
  }
}), U3 = F3, W3 = /* @__PURE__ */ f({
  name: "Discount",
  __name: "discount",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M224 704h576V318.336L552.512 115.84a64 64 0 0 0-81.024 0L224 318.336zm0 64v128h576V768zM593.024 66.304l259.2 212.096A32 32 0 0 1 864 303.168V928a32 32 0 0 1-32 32H192a32 32 0 0 1-32-32V303.168a32 32 0 0 1 11.712-24.768l259.2-212.096a128 128 0 0 1 162.112 0"
      }),
      c("path", {
        fill: "currentColor",
        d: "M512 448a64 64 0 1 0 0-128 64 64 0 0 0 0 128m0 64a128 128 0 1 1 0-256 128 128 0 0 1 0 256"
      })
    ]));
  }
}), G3 = W3, $3 = /* @__PURE__ */ f({
  name: "DishDot",
  __name: "dish-dot",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "m384.064 274.56.064-50.688A128 128 0 0 1 512.128 96c70.528 0 127.68 57.152 127.68 127.68v50.752A448.19 448.19 0 0 1 955.392 768H68.544A448.19 448.19 0 0 1 384 274.56zM96 832h832a32 32 0 1 1 0 64H96a32 32 0 1 1 0-64m32-128h768a384 384 0 1 0-768 0m447.808-448v-32.32a63.68 63.68 0 0 0-63.68-63.68 64 64 0 0 0-64 63.936V256z"
      })
    ]));
  }
}), Q3 = $3, Y3 = /* @__PURE__ */ f({
  name: "Dish",
  __name: "dish",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M480 257.152V192h-96a32 32 0 0 1 0-64h256a32 32 0 1 1 0 64h-96v65.152A448 448 0 0 1 955.52 768H68.48A448 448 0 0 1 480 257.152M128 704h768a384 384 0 1 0-768 0M96 832h832a32 32 0 1 1 0 64H96a32 32 0 1 1 0-64"
      })
    ]));
  }
}), Z3 = Y3, K3 = /* @__PURE__ */ f({
  name: "DocumentAdd",
  __name: "document-add",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M832 384H576V128H192v768h640zm-26.496-64L640 154.496V320zM160 64h480l256 256v608a32 32 0 0 1-32 32H160a32 32 0 0 1-32-32V96a32 32 0 0 1 32-32m320 512V448h64v128h128v64H544v128h-64V640H352v-64z"
      })
    ]));
  }
}), X3 = K3, J3 = /* @__PURE__ */ f({
  name: "DocumentChecked",
  __name: "document-checked",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M805.504 320 640 154.496V320zM832 384H576V128H192v768h640zM160 64h480l256 256v608a32 32 0 0 1-32 32H160a32 32 0 0 1-32-32V96a32 32 0 0 1 32-32m318.4 582.144 180.992-180.992L704.64 510.4 478.4 736.64 320 578.304l45.248-45.312z"
      })
    ]));
  }
}), e6 = J3, t6 = /* @__PURE__ */ f({
  name: "DocumentCopy",
  __name: "document-copy",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M128 320v576h576V320zm-32-64h640a32 32 0 0 1 32 32v640a32 32 0 0 1-32 32H96a32 32 0 0 1-32-32V288a32 32 0 0 1 32-32M960 96v704a32 32 0 0 1-32 32h-96v-64h64V128H384v64h-64V96a32 32 0 0 1 32-32h576a32 32 0 0 1 32 32M256 672h320v64H256zm0-192h320v64H256z"
      })
    ]));
  }
}), n6 = t6, a6 = /* @__PURE__ */ f({
  name: "DocumentDelete",
  __name: "document-delete",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M805.504 320 640 154.496V320zM832 384H576V128H192v768h640zM160 64h480l256 256v608a32 32 0 0 1-32 32H160a32 32 0 0 1-32-32V96a32 32 0 0 1 32-32m308.992 546.304-90.496-90.624 45.248-45.248 90.56 90.496 90.496-90.432 45.248 45.248-90.496 90.56 90.496 90.496-45.248 45.248-90.496-90.496-90.56 90.496-45.248-45.248z"
      })
    ]));
  }
}), r6 = a6, o6 = /* @__PURE__ */ f({
  name: "DocumentRemove",
  __name: "document-remove",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M805.504 320 640 154.496V320zM832 384H576V128H192v768h640zM160 64h480l256 256v608a32 32 0 0 1-32 32H160a32 32 0 0 1-32-32V96a32 32 0 0 1 32-32m192 512h320v64H352z"
      })
    ]));
  }
}), i6 = o6, l6 = /* @__PURE__ */ f({
  name: "Document",
  __name: "document",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M832 384H576V128H192v768h640zm-26.496-64L640 154.496V320zM160 64h480l256 256v608a32 32 0 0 1-32 32H160a32 32 0 0 1-32-32V96a32 32 0 0 1 32-32m160 448h384v64H320zm0-192h160v64H320zm0 384h384v64H320z"
      })
    ]));
  }
}), s6 = l6, c6 = /* @__PURE__ */ f({
  name: "Download",
  __name: "download",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M160 832h704a32 32 0 1 1 0 64H160a32 32 0 1 1 0-64m384-253.696 236.288-236.352 45.248 45.248L508.8 704 192 387.2l45.248-45.248L480 584.704V128h64z"
      })
    ]));
  }
}), d6 = c6, u6 = /* @__PURE__ */ f({
  name: "Drizzling",
  __name: "drizzling",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "m739.328 291.328-35.2-6.592-12.8-33.408a192.064 192.064 0 0 0-365.952 23.232l-9.92 40.896-41.472 7.04a176.32 176.32 0 0 0-146.24 173.568c0 97.28 78.72 175.936 175.808 175.936h400a192 192 0 0 0 35.776-380.672M959.552 480a256 256 0 0 1-256 256h-400A239.81 239.81 0 0 1 63.744 496.192a240.32 240.32 0 0 1 199.488-236.8 256.128 256.128 0 0 1 487.872-30.976A256.064 256.064 0 0 1 959.552 480M288 800h64v64h-64zm192 0h64v64h-64zm-96 96h64v64h-64zm192 0h64v64h-64zm96-96h64v64h-64z"
      })
    ]));
  }
}), m6 = u6, h6 = /* @__PURE__ */ f({
  name: "EditPen",
  __name: "edit-pen",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "m199.04 672.64 193.984 112 224-387.968-193.92-112-224 388.032zm-23.872 60.16 32.896 148.288 144.896-45.696zM455.04 229.248l193.92 112 56.704-98.112-193.984-112zM104.32 708.8l384-665.024 304.768 175.936L409.152 884.8h.064l-248.448 78.336zm384 254.272v-64h448v64z"
      })
    ]));
  }
}), f6 = h6, p6 = /* @__PURE__ */ f({
  name: "Edit",
  __name: "edit",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M832 512a32 32 0 1 1 64 0v352a32 32 0 0 1-32 32H160a32 32 0 0 1-32-32V160a32 32 0 0 1 32-32h352a32 32 0 0 1 0 64H192v640h640z"
      }),
      c("path", {
        fill: "currentColor",
        d: "m469.952 554.24 52.8-7.552L847.104 222.4a32 32 0 1 0-45.248-45.248L477.44 501.44l-7.552 52.8zm422.4-422.4a96 96 0 0 1 0 135.808l-331.84 331.84a32 32 0 0 1-18.112 9.088L436.8 623.68a32 32 0 0 1-36.224-36.224l15.104-105.6a32 32 0 0 1 9.024-18.112l331.904-331.84a96 96 0 0 1 135.744 0z"
      })
    ]));
  }
}), g6 = p6, v6 = /* @__PURE__ */ f({
  name: "ElemeFilled",
  __name: "eleme-filled",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M176 64h672c61.824 0 112 50.176 112 112v672a112 112 0 0 1-112 112H176A112 112 0 0 1 64 848V176c0-61.824 50.176-112 112-112m150.528 173.568c-152.896 99.968-196.544 304.064-97.408 456.96a330.69 330.69 0 0 0 456.96 96.64c9.216-5.888 17.6-11.776 25.152-18.56a18.24 18.24 0 0 0 4.224-24.32L700.352 724.8a47.55 47.55 0 0 0-65.536-14.272A234.56 234.56 0 0 1 310.592 641.6C240 533.248 271.104 387.968 379.456 316.48a234.3 234.3 0 0 1 276.352 15.168c1.664.832 2.56 2.56 3.392 4.224 5.888 8.384 3.328 19.328-5.12 25.216L456.832 489.6a47.55 47.55 0 0 0-14.336 65.472l16 24.384c5.888 8.384 16.768 10.88 25.216 5.056l308.224-199.936a19.584 19.584 0 0 0 6.72-23.488v-.896c-4.992-9.216-10.048-17.6-15.104-26.88-99.968-151.168-304.064-194.88-456.96-95.744zM786.88 504.704l-62.208 40.32c-8.32 5.888-10.88 16.768-4.992 25.216L760 632.32c5.888 8.448 16.768 11.008 25.152 5.12l31.104-20.16a55.36 55.36 0 0 0 16-76.48l-20.224-31.04a19.52 19.52 0 0 0-25.152-5.12z"
      })
    ]));
  }
}), _6 = v6, w6 = /* @__PURE__ */ f({
  name: "Eleme",
  __name: "eleme",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M300.032 188.8c174.72-113.28 408-63.36 522.24 109.44 5.76 10.56 11.52 20.16 17.28 30.72v.96a22.4 22.4 0 0 1-7.68 26.88l-352.32 228.48c-9.6 6.72-22.08 3.84-28.8-5.76l-18.24-27.84a54.336 54.336 0 0 1 16.32-74.88l225.6-146.88c9.6-6.72 12.48-19.2 5.76-28.8-.96-1.92-1.92-3.84-3.84-4.8a267.84 267.84 0 0 0-315.84-17.28c-123.84 81.6-159.36 247.68-78.72 371.52a268.096 268.096 0 0 0 370.56 78.72 54.336 54.336 0 0 1 74.88 16.32l17.28 26.88c5.76 9.6 3.84 21.12-4.8 27.84-8.64 7.68-18.24 14.4-28.8 21.12a377.92 377.92 0 0 1-522.24-110.4c-113.28-174.72-63.36-408 111.36-522.24m526.08 305.28a22.336 22.336 0 0 1 28.8 5.76l23.04 35.52a63.23 63.23 0 0 1-18.24 87.36l-35.52 23.04c-9.6 6.72-22.08 3.84-28.8-5.76l-46.08-71.04c-6.72-9.6-3.84-22.08 5.76-28.8z"
      })
    ]));
  }
}), y6 = w6, b6 = /* @__PURE__ */ f({
  name: "ElementPlus",
  __name: "element-plus",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M839.7 734.7c0 33.3-17.9 41-17.9 41S519.7 949.8 499.2 960c-10.2 5.1-20.5 5.1-30.7 0 0 0-314.9-184.3-325.1-192-5.1-5.1-10.2-12.8-12.8-20.5V368.6c0-17.9 20.5-28.2 20.5-28.2L466 158.6q19.2-7.65 38.4 0s279 161.3 309.8 179.2c17.9 7.7 28.2 25.6 25.6 46.1-.1-5-.1 317.5-.1 350.8M714.2 371.2c-64-35.8-217.6-125.4-217.6-125.4-7.7-5.1-20.5-5.1-30.7 0L217.6 389.1s-17.9 10.2-17.9 23v297c0 5.1 5.1 12.8 7.7 17.9 7.7 5.1 256 148.5 256 148.5 7.7 5.1 17.9 5.1 25.6 0 15.4-7.7 250.9-145.9 250.9-145.9s12.8-5.1 12.8-30.7v-74.2l-276.5 169v-64c0-17.9 7.7-30.7 20.5-46.1L745 535c5.1-7.7 10.2-20.5 10.2-30.7v-66.6l-279 169v-69.1c0-15.4 5.1-30.7 17.9-38.4zM919 135.7c0-5.1-5.1-7.7-7.7-7.7h-58.9V66.6c0-5.1-5.1-5.1-10.2-5.1l-30.7 5.1c-5.1 0-5.1 2.6-5.1 5.1V128h-56.3c-5.1 0-5.1 5.1-7.7 5.1v38.4h69.1v64c0 5.1 5.1 5.1 10.2 5.1l30.7-5.1c5.1 0 5.1-2.6 5.1-5.1v-56.3h64z"
      })
    ]));
  }
}), C6 = b6, A6 = /* @__PURE__ */ f({
  name: "Expand",
  __name: "expand",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M128 192h768v128H128zm0 256h512v128H128zm0 256h768v128H128zm576-352 192 160-192 128z"
      })
    ]));
  }
}), x6 = A6, E6 = /* @__PURE__ */ f({
  name: "Failed",
  __name: "failed",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "m557.248 608 135.744-135.744-45.248-45.248-135.68 135.744-135.808-135.68-45.248 45.184L466.752 608l-135.68 135.68 45.184 45.312L512 653.248l135.744 135.744 45.248-45.248L557.312 608zM704 192h160v736H160V192h160v64h384zm-320 0V96h256v96z"
      })
    ]));
  }
}), S6 = E6, M6 = /* @__PURE__ */ f({
  name: "Female",
  __name: "female",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M512 640a256 256 0 1 0 0-512 256 256 0 0 0 0 512m0 64a320 320 0 1 1 0-640 320 320 0 0 1 0 640"
      }),
      c("path", {
        fill: "currentColor",
        d: "M512 640q32 0 32 32v256q0 32-32 32t-32-32V672q0-32 32-32"
      }),
      c("path", {
        fill: "currentColor",
        d: "M352 800h320q32 0 32 32t-32 32H352q-32 0-32-32t32-32"
      })
    ]));
  }
}), D6 = M6, T6 = /* @__PURE__ */ f({
  name: "Files",
  __name: "files",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M128 384v448h768V384zm-32-64h832a32 32 0 0 1 32 32v512a32 32 0 0 1-32 32H96a32 32 0 0 1-32-32V352a32 32 0 0 1 32-32m64-128h704v64H160zm96-128h512v64H256z"
      })
    ]));
  }
}), R6 = T6, H6 = /* @__PURE__ */ f({
  name: "Film",
  __name: "film",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M160 160v704h704V160zm-32-64h768a32 32 0 0 1 32 32v768a32 32 0 0 1-32 32H128a32 32 0 0 1-32-32V128a32 32 0 0 1 32-32"
      }),
      c("path", {
        fill: "currentColor",
        d: "M320 288V128h64v352h256V128h64v160h160v64H704v128h160v64H704v128h160v64H704v160h-64V544H384v352h-64V736H128v-64h192V544H128v-64h192V352H128v-64z"
      })
    ]));
  }
}), I6 = H6, k6 = /* @__PURE__ */ f({
  name: "Filter",
  __name: "filter",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M384 523.392V928a32 32 0 0 0 46.336 28.608l192-96A32 32 0 0 0 640 832V523.392l280.768-343.104a32 32 0 1 0-49.536-40.576l-288 352A32 32 0 0 0 576 512v300.224l-128 64V512a32 32 0 0 0-7.232-20.288L195.52 192H704a32 32 0 1 0 0-64H128a32 32 0 0 0-24.768 52.288z"
      })
    ]));
  }
}), z6 = k6, V6 = /* @__PURE__ */ f({
  name: "Finished",
  __name: "finished",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M280.768 753.728 691.456 167.04a32 32 0 1 1 52.416 36.672L314.24 817.472a32 32 0 0 1-45.44 7.296l-230.4-172.8a32 32 0 0 1 38.4-51.2zM736 448a32 32 0 1 1 0-64h192a32 32 0 1 1 0 64zM608 640a32 32 0 0 1 0-64h319.936a32 32 0 1 1 0 64zM480 832a32 32 0 1 1 0-64h447.936a32 32 0 1 1 0 64z"
      })
    ]));
  }
}), O6 = V6, B6 = /* @__PURE__ */ f({
  name: "FirstAidKit",
  __name: "first-aid-kit",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M192 256a64 64 0 0 0-64 64v448a64 64 0 0 0 64 64h640a64 64 0 0 0 64-64V320a64 64 0 0 0-64-64zm0-64h640a128 128 0 0 1 128 128v448a128 128 0 0 1-128 128H192A128 128 0 0 1 64 768V320a128 128 0 0 1 128-128"
      }),
      c("path", {
        fill: "currentColor",
        d: "M544 512h96a32 32 0 0 1 0 64h-96v96a32 32 0 0 1-64 0v-96h-96a32 32 0 0 1 0-64h96v-96a32 32 0 0 1 64 0zM352 128v64h320v-64zm-32-64h384a32 32 0 0 1 32 32v128a32 32 0 0 1-32 32H320a32 32 0 0 1-32-32V96a32 32 0 0 1 32-32"
      })
    ]));
  }
}), L6 = B6, N6 = /* @__PURE__ */ f({
  name: "Flag",
  __name: "flag",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M288 128h608L736 384l160 256H288v320h-96V64h96z"
      })
    ]));
  }
}), P6 = N6, j6 = /* @__PURE__ */ f({
  name: "Fold",
  __name: "fold",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M896 192H128v128h768zm0 256H384v128h512zm0 256H128v128h768zM320 384 128 512l192 128z"
      })
    ]));
  }
}), q6 = j6, F6 = /* @__PURE__ */ f({
  name: "FolderAdd",
  __name: "folder-add",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M128 192v640h768V320H485.76L357.504 192zm-32-64h287.872l128.384 128H928a32 32 0 0 1 32 32v576a32 32 0 0 1-32 32H96a32 32 0 0 1-32-32V160a32 32 0 0 1 32-32m384 416V416h64v128h128v64H544v128h-64V608H352v-64z"
      })
    ]));
  }
}), U6 = F6, W6 = /* @__PURE__ */ f({
  name: "FolderChecked",
  __name: "folder-checked",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M128 192v640h768V320H485.76L357.504 192zm-32-64h287.872l128.384 128H928a32 32 0 0 1 32 32v576a32 32 0 0 1-32 32H96a32 32 0 0 1-32-32V160a32 32 0 0 1 32-32m414.08 502.144 180.992-180.992L736.32 494.4 510.08 720.64l-158.4-158.336 45.248-45.312z"
      })
    ]));
  }
}), G6 = W6, $6 = /* @__PURE__ */ f({
  name: "FolderDelete",
  __name: "folder-delete",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M128 192v640h768V320H485.76L357.504 192zm-32-64h287.872l128.384 128H928a32 32 0 0 1 32 32v576a32 32 0 0 1-32 32H96a32 32 0 0 1-32-32V160a32 32 0 0 1 32-32m370.752 448-90.496-90.496 45.248-45.248L512 530.752l90.496-90.496 45.248 45.248L557.248 576l90.496 90.496-45.248 45.248L512 621.248l-90.496 90.496-45.248-45.248z"
      })
    ]));
  }
}), Q6 = $6, Y6 = /* @__PURE__ */ f({
  name: "FolderOpened",
  __name: "folder-opened",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M878.08 448H241.92l-96 384h636.16zM832 384v-64H485.76L357.504 192H128v448l57.92-231.744A32 32 0 0 1 216.96 384zm-24.96 512H96a32 32 0 0 1-32-32V160a32 32 0 0 1 32-32h287.872l128.384 128H864a32 32 0 0 1 32 32v96h23.04a32 32 0 0 1 31.04 39.744l-112 448A32 32 0 0 1 807.04 896"
      })
    ]));
  }
}), Z6 = Y6, K6 = /* @__PURE__ */ f({
  name: "FolderRemove",
  __name: "folder-remove",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M128 192v640h768V320H485.76L357.504 192zm-32-64h287.872l128.384 128H928a32 32 0 0 1 32 32v576a32 32 0 0 1-32 32H96a32 32 0 0 1-32-32V160a32 32 0 0 1 32-32m256 416h320v64H352z"
      })
    ]));
  }
}), X6 = K6, J6 = /* @__PURE__ */ f({
  name: "Folder",
  __name: "folder",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M128 192v640h768V320H485.76L357.504 192zm-32-64h287.872l128.384 128H928a32 32 0 0 1 32 32v576a32 32 0 0 1-32 32H96a32 32 0 0 1-32-32V160a32 32 0 0 1 32-32"
      })
    ]));
  }
}), eu = J6, tu = /* @__PURE__ */ f({
  name: "Food",
  __name: "food",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M128 352.576V352a288 288 0 0 1 491.072-204.224 192 192 0 0 1 274.24 204.48 64 64 0 0 1 57.216 74.24C921.6 600.512 850.048 710.656 736 756.992V800a96 96 0 0 1-96 96H384a96 96 0 0 1-96-96v-43.008c-114.048-46.336-185.6-156.48-214.528-330.496A64 64 0 0 1 128 352.64zm64-.576h64a160 160 0 0 1 320 0h64a224 224 0 0 0-448 0m128 0h192a96 96 0 0 0-192 0m439.424 0h68.544A128.256 128.256 0 0 0 704 192c-15.36 0-29.952 2.688-43.52 7.616 11.328 18.176 20.672 37.76 27.84 58.304A64.128 64.128 0 0 1 759.424 352M672 768H352v32a32 32 0 0 0 32 32h256a32 32 0 0 0 32-32zm-342.528-64h365.056c101.504-32.64 165.76-124.928 192.896-288H136.576c27.136 163.072 91.392 255.36 192.896 288"
      })
    ]));
  }
}), nu = tu, au = /* @__PURE__ */ f({
  name: "Football",
  __name: "football",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M512 960a448 448 0 1 1 0-896 448 448 0 0 1 0 896m0-64a384 384 0 1 0 0-768 384 384 0 0 0 0 768"
      }),
      c("path", {
        fill: "currentColor",
        d: "M186.816 268.288c16-16.384 31.616-31.744 46.976-46.08 17.472 30.656 39.808 58.112 65.984 81.28l-32.512 56.448a386 386 0 0 1-80.448-91.648m653.696-5.312a385.9 385.9 0 0 1-83.776 96.96l-32.512-56.384a322.9 322.9 0 0 0 68.48-85.76c15.552 14.08 31.488 29.12 47.808 45.184M465.984 445.248l11.136-63.104a323.6 323.6 0 0 0 69.76 0l11.136 63.104a388 388 0 0 1-92.032 0m-62.72-12.8A381.8 381.8 0 0 1 320 396.544l32-55.424a320 320 0 0 0 62.464 27.712l-11.2 63.488zm300.8-35.84a381.8 381.8 0 0 1-83.328 35.84l-11.2-63.552A320 320 0 0 0 672 341.184l32 55.424zm-520.768 364.8a385.9 385.9 0 0 1 83.968-97.28l32.512 56.32c-26.88 23.936-49.856 52.352-67.52 84.032-16-13.44-32.32-27.712-48.96-43.072m657.536.128a1443 1443 0 0 1-49.024 43.072 321.4 321.4 0 0 0-67.584-84.16l32.512-56.32c33.216 27.456 61.696 60.352 84.096 97.408M465.92 578.752a388 388 0 0 1 92.032 0l-11.136 63.104a323.6 323.6 0 0 0-69.76 0zm-62.72 12.8 11.2 63.552a320 320 0 0 0-62.464 27.712L320 627.392a381.8 381.8 0 0 1 83.264-35.84zm300.8 35.84-32 55.424a318.3 318.3 0 0 0-62.528-27.712l11.2-63.488c29.44 8.64 57.28 20.736 83.264 35.776z"
      })
    ]));
  }
}), ru = au, ou = /* @__PURE__ */ f({
  name: "ForkSpoon",
  __name: "fork-spoon",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M256 410.304V96a32 32 0 0 1 64 0v314.304a96 96 0 0 0 64-90.56V96a32 32 0 0 1 64 0v223.744a160 160 0 0 1-128 156.8V928a32 32 0 1 1-64 0V476.544a160 160 0 0 1-128-156.8V96a32 32 0 0 1 64 0v223.744a96 96 0 0 0 64 90.56M672 572.48C581.184 552.128 512 446.848 512 320c0-141.44 85.952-256 192-256s192 114.56 192 256c0 126.848-69.184 232.128-160 252.48V928a32 32 0 1 1-64 0zM704 512c66.048 0 128-82.56 128-192s-61.952-192-128-192-128 82.56-128 192 61.952 192 128 192"
      })
    ]));
  }
}), iu = ou, lu = /* @__PURE__ */ f({
  name: "Fries",
  __name: "fries",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M608 224v-64a32 32 0 0 0-64 0v336h26.88A64 64 0 0 0 608 484.096zm101.12 160A64 64 0 0 0 672 395.904V384h64V224a32 32 0 1 0-64 0v160zm74.88 0a92.928 92.928 0 0 1 91.328 110.08l-60.672 323.584A96 96 0 0 1 720.32 896H303.68a96 96 0 0 1-94.336-78.336L148.672 494.08A92.928 92.928 0 0 1 240 384h-16V224a96 96 0 0 1 188.608-25.28A95.74 95.74 0 0 1 480 197.44V160a96 96 0 0 1 188.608-25.28A96 96 0 0 1 800 224v160zM670.784 512a128 128 0 0 1-99.904 48H453.12a128 128 0 0 1-99.84-48H352v-1.536a128 128 0 0 1-9.984-14.976L314.88 448H240a28.928 28.928 0 0 0-28.48 34.304L241.088 640h541.824l29.568-157.696A28.928 28.928 0 0 0 784 448h-74.88l-27.136 47.488A132 132 0 0 1 672 510.464V512zM480 288a32 32 0 0 0-64 0v196.096A64 64 0 0 0 453.12 496H480zm-128 96V224a32 32 0 0 0-64 0v160zh-37.12A64 64 0 0 1 352 395.904zm-98.88 320 19.072 101.888A32 32 0 0 0 303.68 832h416.64a32 32 0 0 0 31.488-26.112L770.88 704z"
      })
    ]));
  }
}), su = lu, cu = /* @__PURE__ */ f({
  name: "FullScreen",
  __name: "full-screen",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "m160 96.064 192 .192a32 32 0 0 1 0 64l-192-.192V352a32 32 0 0 1-64 0V96h64zm0 831.872V928H96V672a32 32 0 1 1 64 0v191.936l192-.192a32 32 0 1 1 0 64zM864 96.064V96h64v256a32 32 0 1 1-64 0V160.064l-192 .192a32 32 0 1 1 0-64zm0 831.872-192-.192a32 32 0 0 1 0-64l192 .192V672a32 32 0 1 1 64 0v256h-64z"
      })
    ]));
  }
}), du = cu, uu = /* @__PURE__ */ f({
  name: "GobletFull",
  __name: "goblet-full",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M256 320h512c0-78.592-12.608-142.4-36.928-192h-434.24C269.504 192.384 256 256.256 256 320m503.936 64H264.064a256.128 256.128 0 0 0 495.872 0M544 638.4V896h96a32 32 0 1 1 0 64H384a32 32 0 1 1 0-64h96V638.4A320 320 0 0 1 192 320c0-85.632 21.312-170.944 64-256h512c42.688 64.32 64 149.632 64 256a320 320 0 0 1-288 318.4"
      })
    ]));
  }
}), mu = uu, hu = /* @__PURE__ */ f({
  name: "GobletSquareFull",
  __name: "goblet-square-full",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M256 270.912c10.048 6.72 22.464 14.912 28.992 18.624a220.16 220.16 0 0 0 114.752 30.72c30.592 0 49.408-9.472 91.072-41.152l.64-.448c52.928-40.32 82.368-55.04 132.288-54.656 55.552.448 99.584 20.8 142.72 57.408l1.536 1.28V128H256zm.96 76.288C266.368 482.176 346.88 575.872 512 576c157.44.064 237.952-85.056 253.248-209.984a952 952 0 0 1-40.192-35.712c-32.704-27.776-63.36-41.92-101.888-42.24-31.552-.256-50.624 9.28-93.12 41.6l-.576.448c-52.096 39.616-81.024 54.208-129.792 54.208-54.784 0-100.48-13.376-142.784-37.056zM480 638.848C250.624 623.424 192 442.496 192 319.68V96a32 32 0 0 1 32-32h576a32 32 0 0 1 32 32v224c0 122.816-58.624 303.68-288 318.912V896h96a32 32 0 1 1 0 64H384a32 32 0 1 1 0-64h96z"
      })
    ]));
  }
}), fu = hu, pu = /* @__PURE__ */ f({
  name: "GobletSquare",
  __name: "goblet-square",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M544 638.912V896h96a32 32 0 1 1 0 64H384a32 32 0 1 1 0-64h96V638.848C250.624 623.424 192 442.496 192 319.68V96a32 32 0 0 1 32-32h576a32 32 0 0 1 32 32v224c0 122.816-58.624 303.68-288 318.912M256 319.68c0 149.568 80 256.192 256 256.256C688.128 576 768 469.568 768 320V128H256z"
      })
    ]));
  }
}), gu = pu, vu = /* @__PURE__ */ f({
  name: "Goblet",
  __name: "goblet",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M544 638.4V896h96a32 32 0 1 1 0 64H384a32 32 0 1 1 0-64h96V638.4A320 320 0 0 1 192 320c0-85.632 21.312-170.944 64-256h512c42.688 64.32 64 149.632 64 256a320 320 0 0 1-288 318.4M256 320a256 256 0 1 0 512 0c0-78.592-12.608-142.4-36.928-192h-434.24C269.504 192.384 256 256.256 256 320"
      })
    ]));
  }
}), _u = vu, wu = /* @__PURE__ */ f({
  name: "GoldMedal",
  __name: "gold-medal",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      "xml:space": "preserve",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "m772.13 452.84 53.86-351.81c1.32-10.01-1.17-18.68-7.49-26.02S804.35 64 795.01 64H228.99v-.01h-.06c-9.33 0-17.15 3.67-23.49 11.01s-8.83 16.01-7.49 26.02l53.87 351.89C213.54 505.73 193.59 568.09 192 640c2 90.67 33.17 166.17 93.5 226.5S421.33 957.99 512 960c90.67-2 166.17-33.17 226.5-93.5 60.33-60.34 91.49-135.83 93.5-226.5-1.59-71.94-21.56-134.32-59.87-187.16M640.01 128h117.02l-39.01 254.02c-20.75-10.64-40.74-19.73-59.94-27.28-5.92-3-11.95-5.8-18.08-8.41V128zM576 128v198.76c-13.18-2.58-26.74-4.43-40.67-5.55-8.07-.8-15.85-1.2-23.33-1.2-10.54 0-21.09.66-31.64 1.96a360 360 0 0 0-32.36 4.79V128zm-192 0h.04v218.3c-6.22 2.66-12.34 5.5-18.36 8.56-19.13 7.54-39.02 16.6-59.66 27.16L267.01 128zm308.99 692.99c-48 48-108.33 73-180.99 75.01-72.66-2.01-132.99-27.01-180.99-75.01S258.01 712.66 256 640c2.01-72.66 27.01-132.99 75.01-180.99 19.67-19.67 41.41-35.47 65.22-47.41 38.33-15.04 71.15-23.92 98.44-26.65 5.07-.41 10.2-.7 15.39-.88.63-.01 1.28-.03 1.91-.03.66 0 1.35.03 2.02.04 5.11.17 10.15.46 15.13.86 27.4 2.71 60.37 11.65 98.91 26.79 23.71 11.93 45.36 27.69 64.96 47.29 48 48 73 108.33 75.01 180.99-2.01 72.65-27.01 132.98-75.01 180.98"
      }),
      c("path", {
        fill: "currentColor",
        d: "M544 480H416v64h64v192h-64v64h192v-64h-64z"
      })
    ]));
  }
}), yu = wu, bu = /* @__PURE__ */ f({
  name: "GoodsFilled",
  __name: "goods-filled",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M192 352h640l64 544H128zm128 224h64V448h-64zm320 0h64V448h-64zM384 288h-64a192 192 0 1 1 384 0h-64a128 128 0 1 0-256 0"
      })
    ]));
  }
}), Cu = bu, Au = /* @__PURE__ */ f({
  name: "Goods",
  __name: "goods",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M320 288v-22.336C320 154.688 405.504 64 512 64s192 90.688 192 201.664v22.4h131.072a32 32 0 0 1 31.808 28.8l57.6 576a32 32 0 0 1-31.808 35.2H131.328a32 32 0 0 1-31.808-35.2l57.6-576a32 32 0 0 1 31.808-28.8H320zm64 0h256v-22.336C640 189.248 582.272 128 512 128s-128 61.248-128 137.664v22.4zm-64 64H217.92l-51.2 512h690.56l-51.264-512H704v96a32 32 0 1 1-64 0v-96H384v96a32 32 0 0 1-64 0z"
      })
    ]));
  }
}), xu = Au, Eu = /* @__PURE__ */ f({
  name: "Grape",
  __name: "grape",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M544 195.2a160 160 0 0 1 96 60.8 160 160 0 1 1 146.24 254.976 160 160 0 0 1-128 224 160 160 0 1 1-292.48 0 160 160 0 0 1-128-224A160 160 0 1 1 384 256a160 160 0 0 1 96-60.8V128h-64a32 32 0 0 1 0-64h192a32 32 0 0 1 0 64h-64zM512 448a96 96 0 1 0 0-192 96 96 0 0 0 0 192m-256 0a96 96 0 1 0 0-192 96 96 0 0 0 0 192m128 224a96 96 0 1 0 0-192 96 96 0 0 0 0 192m128 224a96 96 0 1 0 0-192 96 96 0 0 0 0 192m128-224a96 96 0 1 0 0-192 96 96 0 0 0 0 192m128-224a96 96 0 1 0 0-192 96 96 0 0 0 0 192"
      })
    ]));
  }
}), Su = Eu, Mu = /* @__PURE__ */ f({
  name: "Grid",
  __name: "grid",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M640 384v256H384V384zm64 0h192v256H704zm-64 512H384V704h256zm64 0V704h192v192zm-64-768v192H384V128zm64 0h192v192H704zM320 384v256H128V384zm0 512H128V704h192zm0-768v192H128V128z"
      })
    ]));
  }
}), Du = Mu, Tu = /* @__PURE__ */ f({
  name: "Guide",
  __name: "guide",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M640 608h-64V416h64zm0 160v160a32 32 0 0 1-32 32H416a32 32 0 0 1-32-32V768h64v128h128V768zM384 608V416h64v192zm256-352h-64V128H448v128h-64V96a32 32 0 0 1 32-32h192a32 32 0 0 1 32 32z"
      }),
      c("path", {
        fill: "currentColor",
        d: "m220.8 256-71.232 80 71.168 80H768V256zm-14.4-64H800a32 32 0 0 1 32 32v224a32 32 0 0 1-32 32H206.4a32 32 0 0 1-23.936-10.752l-99.584-112a32 32 0 0 1 0-42.496l99.584-112A32 32 0 0 1 206.4 192m678.784 496-71.104 80H266.816V608h547.2zm-56.768-144H234.88a32 32 0 0 0-32 32v224a32 32 0 0 0 32 32h593.6a32 32 0 0 0 23.936-10.752l99.584-112a32 32 0 0 0 0-42.496l-99.584-112A32 32 0 0 0 828.48 544z"
      })
    ]));
  }
}), Ru = Tu, Hu = /* @__PURE__ */ f({
  name: "Handbag",
  __name: "handbag",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      "xml:space": "preserve",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M887.01 264.99c-6-5.99-13.67-8.99-23.01-8.99H704c-1.34-54.68-20.01-100.01-56-136s-81.32-54.66-136-56c-54.68 1.34-100.01 20.01-136 56s-54.66 81.32-56 136H160c-9.35 0-17.02 3-23.01 8.99-5.99 6-8.99 13.67-8.99 23.01v640c0 9.35 2.99 17.02 8.99 23.01S150.66 960 160 960h704c9.35 0 17.02-2.99 23.01-8.99S896 937.34 896 928V288c0-9.35-2.99-17.02-8.99-23.01M421.5 165.5c24.32-24.34 54.49-36.84 90.5-37.5 35.99.68 66.16 13.18 90.5 37.5s36.84 54.49 37.5 90.5H384c.68-35.99 13.18-66.16 37.5-90.5M832 896H192V320h128v128h64V320h256v128h64V320h128z"
      })
    ]));
  }
}), Iu = Hu, ku = /* @__PURE__ */ f({
  name: "Headset",
  __name: "headset",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M896 529.152V512a384 384 0 1 0-768 0v17.152A128 128 0 0 1 320 640v128a128 128 0 1 1-256 0V512a448 448 0 1 1 896 0v256a128 128 0 1 1-256 0V640a128 128 0 0 1 192-110.848M896 640a64 64 0 0 0-128 0v128a64 64 0 0 0 128 0zm-768 0v128a64 64 0 0 0 128 0V640a64 64 0 1 0-128 0"
      })
    ]));
  }
}), zu = ku, Vu = /* @__PURE__ */ f({
  name: "HelpFilled",
  __name: "help-filled",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M926.784 480H701.312A192.51 192.51 0 0 0 544 322.688V97.216A416.064 416.064 0 0 1 926.784 480m0 64A416.064 416.064 0 0 1 544 926.784V701.312A192.51 192.51 0 0 0 701.312 544zM97.28 544h225.472A192.51 192.51 0 0 0 480 701.312v225.472A416.064 416.064 0 0 1 97.216 544zm0-64A416.064 416.064 0 0 1 480 97.216v225.472A192.51 192.51 0 0 0 322.688 480H97.216z"
      })
    ]));
  }
}), Ou = Vu, Bu = /* @__PURE__ */ f({
  name: "Help",
  __name: "help",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "m759.936 805.248-90.944-91.008A254.9 254.9 0 0 1 512 768a254.9 254.9 0 0 1-156.992-53.76l-90.944 91.008A382.46 382.46 0 0 0 512 896c94.528 0 181.12-34.176 247.936-90.752m45.312-45.312A382.46 382.46 0 0 0 896 512c0-94.528-34.176-181.12-90.752-247.936l-91.008 90.944C747.904 398.4 768 452.864 768 512s-20.096 113.6-53.76 156.992zm-45.312-541.184A382.46 382.46 0 0 0 512 128c-94.528 0-181.12 34.176-247.936 90.752l90.944 91.008A254.9 254.9 0 0 1 512 256c59.136 0 113.6 20.096 156.992 53.76zm-541.184 45.312A382.46 382.46 0 0 0 128 512c0 94.528 34.176 181.12 90.752 247.936l91.008-90.944A254.9 254.9 0 0 1 256 512c0-59.136 20.096-113.6 53.76-156.992zm417.28 394.496a194.6 194.6 0 0 0 22.528-22.528C686.912 602.56 704 559.232 704 512a191.23 191.23 0 0 0-67.968-146.56A191.3 191.3 0 0 0 512 320a191.23 191.23 0 0 0-146.56 67.968C337.088 421.44 320 464.768 320 512a191.23 191.23 0 0 0 67.968 146.56C421.44 686.912 464.768 704 512 704c47.296 0 90.56-17.088 124.032-45.44M512 960a448 448 0 1 1 0-896 448 448 0 0 1 0 896"
      })
    ]));
  }
}), Lu = Bu, Nu = /* @__PURE__ */ f({
  name: "Hide",
  __name: "hide",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M876.8 156.8c0-9.6-3.2-16-9.6-22.4s-12.8-9.6-22.4-9.6-16 3.2-22.4 9.6L736 220.8c-64-32-137.6-51.2-224-60.8-160 16-288 73.6-377.6 176S0 496 0 512s48 73.6 134.4 176c22.4 25.6 44.8 48 73.6 67.2l-86.4 89.6c-6.4 6.4-9.6 12.8-9.6 22.4s3.2 16 9.6 22.4 12.8 9.6 22.4 9.6 16-3.2 22.4-9.6l704-710.4c3.2-6.4 6.4-12.8 6.4-22.4m-646.4 528Q115.2 579.2 76.8 512q43.2-72 153.6-172.8C304 272 400 230.4 512 224c64 3.2 124.8 19.2 176 44.8l-54.4 54.4C598.4 300.8 560 288 512 288c-64 0-115.2 22.4-160 64s-64 96-64 160c0 48 12.8 89.6 35.2 124.8L256 707.2c-9.6-6.4-19.2-16-25.6-22.4m140.8-96Q352 555.2 352 512c0-44.8 16-83.2 48-112s67.2-48 112-48c28.8 0 54.4 6.4 73.6 19.2zM889.599 336c-12.8-16-28.8-28.8-41.6-41.6l-48 48c73.6 67.2 124.8 124.8 150.4 169.6q-43.2 72-153.6 172.8c-73.6 67.2-172.8 108.8-284.8 115.2-51.2-3.2-99.2-12.8-140.8-28.8l-48 48c57.6 22.4 118.4 38.4 188.8 44.8 160-16 288-73.6 377.6-176S1024 528 1024 512s-48.001-73.6-134.401-176"
      }),
      c("path", {
        fill: "currentColor",
        d: "M511.998 672c-12.8 0-25.6-3.2-38.4-6.4l-51.2 51.2c28.8 12.8 57.6 19.2 89.6 19.2 64 0 115.2-22.4 160-64 41.6-41.6 64-96 64-160 0-32-6.4-64-19.2-89.6l-51.2 51.2c3.2 12.8 6.4 25.6 6.4 38.4 0 44.8-16 83.2-48 112s-67.2 48-112 48"
      })
    ]));
  }
}), Pu = Nu, ju = /* @__PURE__ */ f({
  name: "Histogram",
  __name: "histogram",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M416 896V128h192v768zm-288 0V448h192v448zm576 0V320h192v576z"
      })
    ]));
  }
}), qu = ju, Fu = /* @__PURE__ */ f({
  name: "HomeFilled",
  __name: "home-filled",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M512 128 128 447.936V896h255.936V640H640v256h255.936V447.936z"
      })
    ]));
  }
}), Uu = Fu, Wu = /* @__PURE__ */ f({
  name: "HotWater",
  __name: "hot-water",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M273.067 477.867h477.866V409.6H273.067zm0 68.266v51.2A187.733 187.733 0 0 0 460.8 785.067h102.4a187.733 187.733 0 0 0 187.733-187.734v-51.2zm-34.134-204.8h546.134a34.133 34.133 0 0 1 34.133 34.134v221.866a256 256 0 0 1-256 256H460.8a256 256 0 0 1-256-256V375.467a34.133 34.133 0 0 1 34.133-34.134M512 34.133a34.133 34.133 0 0 1 34.133 34.134v170.666a34.133 34.133 0 0 1-68.266 0V68.267A34.133 34.133 0 0 1 512 34.133M375.467 102.4a34.133 34.133 0 0 1 34.133 34.133v102.4a34.133 34.133 0 0 1-68.267 0v-102.4a34.133 34.133 0 0 1 34.134-34.133m273.066 0a34.133 34.133 0 0 1 34.134 34.133v102.4a34.133 34.133 0 1 1-68.267 0v-102.4a34.133 34.133 0 0 1 34.133-34.133M170.667 921.668h682.666a34.133 34.133 0 1 1 0 68.267H170.667a34.133 34.133 0 1 1 0-68.267"
      })
    ]));
  }
}), Gu = Wu, $u = /* @__PURE__ */ f({
  name: "House",
  __name: "house",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M192 413.952V896h640V413.952L512 147.328zM139.52 374.4l352-293.312a32 32 0 0 1 40.96 0l352 293.312A32 32 0 0 1 896 398.976V928a32 32 0 0 1-32 32H160a32 32 0 0 1-32-32V398.976a32 32 0 0 1 11.52-24.576"
      })
    ]));
  }
}), Qu = $u, Yu = /* @__PURE__ */ f({
  name: "IceCreamRound",
  __name: "ice-cream-round",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "m308.352 489.344 226.304 226.304a32 32 0 0 0 45.248 0L783.552 512A192 192 0 1 0 512 240.448L308.352 444.16a32 32 0 0 0 0 45.248zm135.744 226.304L308.352 851.392a96 96 0 0 1-135.744-135.744l135.744-135.744-45.248-45.248a96 96 0 0 1 0-135.808L466.752 195.2A256 256 0 0 1 828.8 557.248L625.152 760.96a96 96 0 0 1-135.808 0l-45.248-45.248zM398.848 670.4 353.6 625.152 217.856 760.896a32 32 0 0 0 45.248 45.248zm248.96-384.64a32 32 0 0 1 0 45.248L466.624 512a32 32 0 1 1-45.184-45.248l180.992-181.056a32 32 0 0 1 45.248 0zm90.496 90.496a32 32 0 0 1 0 45.248L557.248 602.496A32 32 0 1 1 512 557.248l180.992-180.992a32 32 0 0 1 45.312 0"
      })
    ]));
  }
}), Zu = Yu, Ku = /* @__PURE__ */ f({
  name: "IceCreamSquare",
  __name: "ice-cream-square",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M416 640h256a32 32 0 0 0 32-32V160a32 32 0 0 0-32-32H352a32 32 0 0 0-32 32v448a32 32 0 0 0 32 32zm192 64v160a96 96 0 0 1-192 0V704h-64a96 96 0 0 1-96-96V160a96 96 0 0 1 96-96h320a96 96 0 0 1 96 96v448a96 96 0 0 1-96 96zm-64 0h-64v160a32 32 0 1 0 64 0z"
      })
    ]));
  }
}), Xu = Ku, Ju = /* @__PURE__ */ f({
  name: "IceCream",
  __name: "ice-cream",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M128.64 448a208 208 0 0 1 193.536-191.552 224 224 0 0 1 445.248 15.488A208.13 208.13 0 0 1 894.784 448H896L548.8 983.68a32 32 0 0 1-53.248.704L128 448zm64.256 0h286.208a144 144 0 0 0-286.208 0m351.36 0h286.272a144 144 0 0 0-286.272 0m-294.848 64 271.808 396.608L778.24 512zM511.68 352.64a207.87 207.87 0 0 1 189.184-96.192 160 160 0 0 0-314.752 5.632c52.608 12.992 97.28 46.08 125.568 90.56"
      })
    ]));
  }
}), em = Ju, tm = /* @__PURE__ */ f({
  name: "IceDrink",
  __name: "ice-drink",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M512 448v128h239.68l16.064-128zm-64 0H256.256l16.064 128H448zm64-255.36V384h247.744A256.13 256.13 0 0 0 512 192.64m-64 8.064A256.45 256.45 0 0 0 264.256 384H448zm64-72.064A320.13 320.13 0 0 1 825.472 384H896a32 32 0 1 1 0 64h-64v1.92l-56.96 454.016A64 64 0 0 1 711.552 960H312.448a64 64 0 0 1-63.488-56.064L192 449.92V448h-64a32 32 0 0 1 0-64h70.528A320.38 320.38 0 0 1 448 135.04V96a96 96 0 0 1 96-96h128a32 32 0 1 1 0 64H544a32 32 0 0 0-32 32zM743.68 640H280.32l32.128 256h399.104z"
      })
    ]));
  }
}), nm = tm, am = /* @__PURE__ */ f({
  name: "IceTea",
  __name: "ice-tea",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M197.696 259.648a320.128 320.128 0 0 1 628.608 0A96 96 0 0 1 896 352v64a96 96 0 0 1-71.616 92.864l-49.408 395.072A64 64 0 0 1 711.488 960H312.512a64 64 0 0 1-63.488-56.064l-49.408-395.072A96 96 0 0 1 128 416v-64a96 96 0 0 1 69.696-92.352M264.064 256h495.872a256.128 256.128 0 0 0-495.872 0m495.424 256H264.512l48 384h398.976zM224 448h576a32 32 0 0 0 32-32v-64a32 32 0 0 0-32-32H224a32 32 0 0 0-32 32v64a32 32 0 0 0 32 32m160 192h64v64h-64zm192 64h64v64h-64zm-128 64h64v64h-64zm64-192h64v64h-64z"
      })
    ]));
  }
}), rm = am, om = /* @__PURE__ */ f({
  name: "InfoFilled",
  __name: "info-filled",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M512 64a448 448 0 1 1 0 896.064A448 448 0 0 1 512 64m67.2 275.072c33.28 0 60.288-23.104 60.288-57.344s-27.072-57.344-60.288-57.344c-33.28 0-60.16 23.104-60.16 57.344s26.88 57.344 60.16 57.344M590.912 699.2c0-6.848 2.368-24.64 1.024-34.752l-52.608 60.544c-10.88 11.456-24.512 19.392-30.912 17.28a12.99 12.99 0 0 1-8.256-14.72l87.68-276.992c7.168-35.136-12.544-67.2-54.336-71.296-44.096 0-108.992 44.736-148.48 101.504 0 6.784-1.28 23.68.064 33.792l52.544-60.608c10.88-11.328 23.552-19.328 29.952-17.152a12.8 12.8 0 0 1 7.808 16.128L388.48 728.576c-10.048 32.256 8.96 63.872 55.04 71.04 67.84 0 107.904-43.648 147.456-100.416z"
      })
    ]));
  }
}), lo = om, im = /* @__PURE__ */ f({
  name: "Iphone",
  __name: "iphone",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M224 768v96.064a64 64 0 0 0 64 64h448a64 64 0 0 0 64-64V768zm0-64h576V160a64 64 0 0 0-64-64H288a64 64 0 0 0-64 64zm32 288a96 96 0 0 1-96-96V128a96 96 0 0 1 96-96h512a96 96 0 0 1 96 96v768a96 96 0 0 1-96 96zm304-144a48 48 0 1 1-96 0 48 48 0 0 1 96 0"
      })
    ]));
  }
}), lm = im, sm = /* @__PURE__ */ f({
  name: "Key",
  __name: "key",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M448 456.064V96a32 32 0 0 1 32-32.064L672 64a32 32 0 0 1 0 64H512v128h160a32 32 0 0 1 0 64H512v128a256 256 0 1 1-64 8.064M512 896a192 192 0 1 0 0-384 192 192 0 0 0 0 384"
      })
    ]));
  }
}), cm = sm, dm = /* @__PURE__ */ f({
  name: "KnifeFork",
  __name: "knife-fork",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M256 410.56V96a32 32 0 0 1 64 0v314.56A96 96 0 0 0 384 320V96a32 32 0 0 1 64 0v224a160 160 0 0 1-128 156.8V928a32 32 0 1 1-64 0V476.8A160 160 0 0 1 128 320V96a32 32 0 0 1 64 0v224a96 96 0 0 0 64 90.56m384-250.24V544h126.72c-3.328-78.72-12.928-147.968-28.608-207.744-14.336-54.528-46.848-113.344-98.112-175.872zM640 608v320a32 32 0 1 1-64 0V64h64c85.312 89.472 138.688 174.848 160 256s32 177.152 32 288z"
      })
    ]));
  }
}), um = dm, mm = /* @__PURE__ */ f({
  name: "Lightning",
  __name: "lightning",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M288 671.36v64.128A239.81 239.81 0 0 1 63.744 496.192a240.32 240.32 0 0 1 199.488-236.8 256.128 256.128 0 0 1 487.872-30.976A256.064 256.064 0 0 1 736 734.016v-64.768a192 192 0 0 0 3.328-377.92l-35.2-6.592-12.8-33.408a192.064 192.064 0 0 0-365.952 23.232l-9.92 40.896-41.472 7.04a176.32 176.32 0 0 0-146.24 173.568c0 91.968 70.464 167.36 160.256 175.232z"
      }),
      c("path", {
        fill: "currentColor",
        d: "M416 736a32 32 0 0 1-27.776-47.872l128-224a32 32 0 1 1 55.552 31.744L471.168 672H608a32 32 0 0 1 27.776 47.872l-128 224a32 32 0 1 1-55.68-31.744L552.96 736z"
      })
    ]));
  }
}), hm = mm, fm = /* @__PURE__ */ f({
  name: "Link",
  __name: "link",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M715.648 625.152 670.4 579.904l90.496-90.56c75.008-74.944 85.12-186.368 22.656-248.896-62.528-62.464-173.952-52.352-248.96 22.656L444.16 353.6l-45.248-45.248 90.496-90.496c100.032-99.968 251.968-110.08 339.456-22.656 87.488 87.488 77.312 239.424-22.656 339.456l-90.496 90.496zm-90.496 90.496-90.496 90.496C434.624 906.112 282.688 916.224 195.2 828.8c-87.488-87.488-77.312-239.424 22.656-339.456l90.496-90.496 45.248 45.248-90.496 90.56c-75.008 74.944-85.12 186.368-22.656 248.896 62.528 62.464 173.952 52.352 248.96-22.656l90.496-90.496zm0-362.048 45.248 45.248L398.848 670.4 353.6 625.152z"
      })
    ]));
  }
}), pm = fm, gm = /* @__PURE__ */ f({
  name: "List",
  __name: "list",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M704 192h160v736H160V192h160v64h384zM288 512h448v-64H288zm0 256h448v-64H288zm96-576V96h256v96z"
      })
    ]));
  }
}), vm = gm, _m = /* @__PURE__ */ f({
  name: "Loading",
  __name: "loading",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M512 64a32 32 0 0 1 32 32v192a32 32 0 0 1-64 0V96a32 32 0 0 1 32-32m0 640a32 32 0 0 1 32 32v192a32 32 0 1 1-64 0V736a32 32 0 0 1 32-32m448-192a32 32 0 0 1-32 32H736a32 32 0 1 1 0-64h192a32 32 0 0 1 32 32m-640 0a32 32 0 0 1-32 32H96a32 32 0 0 1 0-64h192a32 32 0 0 1 32 32M195.2 195.2a32 32 0 0 1 45.248 0L376.32 331.008a32 32 0 0 1-45.248 45.248L195.2 240.448a32 32 0 0 1 0-45.248m452.544 452.544a32 32 0 0 1 45.248 0L828.8 783.552a32 32 0 0 1-45.248 45.248L647.744 692.992a32 32 0 0 1 0-45.248M828.8 195.264a32 32 0 0 1 0 45.184L692.992 376.32a32 32 0 0 1-45.248-45.248l135.808-135.808a32 32 0 0 1 45.248 0m-452.544 452.48a32 32 0 0 1 0 45.248L240.448 828.8a32 32 0 0 1-45.248-45.248l135.808-135.808a32 32 0 0 1 45.248 0"
      })
    ]));
  }
}), wm = _m, ym = /* @__PURE__ */ f({
  name: "LocationFilled",
  __name: "location-filled",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M512 928c23.936 0 117.504-68.352 192.064-153.152C803.456 661.888 864 535.808 864 416c0-189.632-155.84-320-352-320S160 226.368 160 416c0 120.32 60.544 246.4 159.936 359.232C394.432 859.84 488 928 512 928m0-435.2a64 64 0 1 0 0-128 64 64 0 0 0 0 128m0 140.8a204.8 204.8 0 1 1 0-409.6 204.8 204.8 0 0 1 0 409.6"
      })
    ]));
  }
}), bm = ym, Cm = /* @__PURE__ */ f({
  name: "LocationInformation",
  __name: "location-information",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M288 896h448q32 0 32 32t-32 32H288q-32 0-32-32t32-32"
      }),
      c("path", {
        fill: "currentColor",
        d: "M800 416a288 288 0 1 0-576 0c0 118.144 94.528 272.128 288 456.576C705.472 688.128 800 534.144 800 416M512 960C277.312 746.688 160 565.312 160 416a352 352 0 0 1 704 0c0 149.312-117.312 330.688-352 544"
      }),
      c("path", {
        fill: "currentColor",
        d: "M512 512a96 96 0 1 0 0-192 96 96 0 0 0 0 192m0 64a160 160 0 1 1 0-320 160 160 0 0 1 0 320"
      })
    ]));
  }
}), Am = Cm, xm = /* @__PURE__ */ f({
  name: "Location",
  __name: "location",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M800 416a288 288 0 1 0-576 0c0 118.144 94.528 272.128 288 456.576C705.472 688.128 800 534.144 800 416M512 960C277.312 746.688 160 565.312 160 416a352 352 0 0 1 704 0c0 149.312-117.312 330.688-352 544"
      }),
      c("path", {
        fill: "currentColor",
        d: "M512 512a96 96 0 1 0 0-192 96 96 0 0 0 0 192m0 64a160 160 0 1 1 0-320 160 160 0 0 1 0 320"
      })
    ]));
  }
}), Em = xm, Sm = /* @__PURE__ */ f({
  name: "Lock",
  __name: "lock",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M224 448a32 32 0 0 0-32 32v384a32 32 0 0 0 32 32h576a32 32 0 0 0 32-32V480a32 32 0 0 0-32-32zm0-64h576a96 96 0 0 1 96 96v384a96 96 0 0 1-96 96H224a96 96 0 0 1-96-96V480a96 96 0 0 1 96-96"
      }),
      c("path", {
        fill: "currentColor",
        d: "M512 544a32 32 0 0 1 32 32v192a32 32 0 1 1-64 0V576a32 32 0 0 1 32-32m192-160v-64a192 192 0 1 0-384 0v64zM512 64a256 256 0 0 1 256 256v128H256V320A256 256 0 0 1 512 64"
      })
    ]));
  }
}), Mm = Sm, Dm = /* @__PURE__ */ f({
  name: "Lollipop",
  __name: "lollipop",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M513.28 448a64 64 0 1 1 76.544 49.728A96 96 0 0 0 768 448h64a160 160 0 0 1-320 0zm-126.976-29.696a256 256 0 1 0 43.52-180.48A256 256 0 0 1 832 448h-64a192 192 0 0 0-381.696-29.696m105.664 249.472L285.696 874.048a96 96 0 0 1-135.68-135.744l206.208-206.272a320 320 0 1 1 135.744 135.744m-54.464-36.032a322 322 0 0 1-45.248-45.248L195.2 783.552a32 32 0 1 0 45.248 45.248l197.056-197.12z"
      })
    ]));
  }
}), Tm = Dm, Rm = /* @__PURE__ */ f({
  name: "MagicStick",
  __name: "magic-stick",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M512 64h64v192h-64zm0 576h64v192h-64zM160 480v-64h192v64zm576 0v-64h192v64zM249.856 199.04l45.248-45.184L430.848 289.6 385.6 334.848 249.856 199.104zM657.152 606.4l45.248-45.248 135.744 135.744-45.248 45.248zM114.048 923.2 68.8 877.952l316.8-316.8 45.248 45.248zM702.4 334.848 657.152 289.6l135.744-135.744 45.248 45.248z"
      })
    ]));
  }
}), Hm = Rm, Im = /* @__PURE__ */ f({
  name: "Magnet",
  __name: "magnet",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M832 320V192H704v320a192 192 0 1 1-384 0V192H192v128h128v64H192v128a320 320 0 0 0 640 0V384H704v-64zM640 512V128h256v384a384 384 0 1 1-768 0V128h256v384a128 128 0 1 0 256 0"
      })
    ]));
  }
}), km = Im, zm = /* @__PURE__ */ f({
  name: "Male",
  __name: "male",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M399.5 849.5a225 225 0 1 0 0-450 225 225 0 0 0 0 450m0 56.25a281.25 281.25 0 1 1 0-562.5 281.25 281.25 0 0 1 0 562.5m253.125-787.5h225q28.125 0 28.125 28.125T877.625 174.5h-225q-28.125 0-28.125-28.125t28.125-28.125"
      }),
      c("path", {
        fill: "currentColor",
        d: "M877.625 118.25q28.125 0 28.125 28.125v225q0 28.125-28.125 28.125T849.5 371.375v-225q0-28.125 28.125-28.125"
      }),
      c("path", {
        fill: "currentColor",
        d: "M604.813 458.9 565.1 419.131l292.613-292.668 39.825 39.824z"
      })
    ]));
  }
}), Vm = zm, Om = /* @__PURE__ */ f({
  name: "Management",
  __name: "management",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M576 128v288l96-96 96 96V128h128v768H320V128zm-448 0h128v768H128z"
      })
    ]));
  }
}), Bm = Om, Lm = /* @__PURE__ */ f({
  name: "MapLocation",
  __name: "map-location",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M800 416a288 288 0 1 0-576 0c0 118.144 94.528 272.128 288 456.576C705.472 688.128 800 534.144 800 416M512 960C277.312 746.688 160 565.312 160 416a352 352 0 0 1 704 0c0 149.312-117.312 330.688-352 544"
      }),
      c("path", {
        fill: "currentColor",
        d: "M512 448a64 64 0 1 0 0-128 64 64 0 0 0 0 128m0 64a128 128 0 1 1 0-256 128 128 0 0 1 0 256m345.6 192L960 960H672v-64H352v64H64l102.4-256zm-68.928 0H235.328l-76.8 192h706.944z"
      })
    ]));
  }
}), Nm = Lm, Pm = /* @__PURE__ */ f({
  name: "Medal",
  __name: "medal",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M512 896a256 256 0 1 0 0-512 256 256 0 0 0 0 512m0 64a320 320 0 1 1 0-640 320 320 0 0 1 0 640"
      }),
      c("path", {
        fill: "currentColor",
        d: "M576 128H448v200a286.7 286.7 0 0 1 64-8c19.52 0 40.832 2.688 64 8zm64 0v219.648c24.448 9.088 50.56 20.416 78.4 33.92L757.44 128zm-256 0H266.624l39.04 253.568c27.84-13.504 53.888-24.832 78.336-33.92zM229.312 64h565.376a32 32 0 0 1 31.616 36.864L768 480c-113.792-64-199.104-96-256-96s-142.208 32-256 96l-58.304-379.136A32 32 0 0 1 229.312 64"
      })
    ]));
  }
}), jm = Pm, qm = /* @__PURE__ */ f({
  name: "Memo",
  __name: "memo",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      "xml:space": "preserve",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M480 320h192c21.33 0 32-10.67 32-32s-10.67-32-32-32H480c-21.33 0-32 10.67-32 32s10.67 32 32 32"
      }),
      c("path", {
        fill: "currentColor",
        d: "M887.01 72.99C881.01 67 873.34 64 864 64H160c-9.35 0-17.02 3-23.01 8.99C131 78.99 128 86.66 128 96v832c0 9.35 2.99 17.02 8.99 23.01S150.66 960 160 960h704c9.35 0 17.02-2.99 23.01-8.99S896 937.34 896 928V96c0-9.35-3-17.02-8.99-23.01M192 896V128h96v768zm640 0H352V128h480z"
      }),
      c("path", {
        fill: "currentColor",
        d: "M480 512h192c21.33 0 32-10.67 32-32s-10.67-32-32-32H480c-21.33 0-32 10.67-32 32s10.67 32 32 32m0 192h192c21.33 0 32-10.67 32-32s-10.67-32-32-32H480c-21.33 0-32 10.67-32 32s10.67 32 32 32"
      })
    ]));
  }
}), Fm = qm, Um = /* @__PURE__ */ f({
  name: "Menu",
  __name: "menu",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M160 448a32 32 0 0 1-32-32V160.064a32 32 0 0 1 32-32h256a32 32 0 0 1 32 32V416a32 32 0 0 1-32 32zm448 0a32 32 0 0 1-32-32V160.064a32 32 0 0 1 32-32h255.936a32 32 0 0 1 32 32V416a32 32 0 0 1-32 32zM160 896a32 32 0 0 1-32-32V608a32 32 0 0 1 32-32h256a32 32 0 0 1 32 32v256a32 32 0 0 1-32 32zm448 0a32 32 0 0 1-32-32V608a32 32 0 0 1 32-32h255.936a32 32 0 0 1 32 32v256a32 32 0 0 1-32 32z"
      })
    ]));
  }
}), Wm = Um, Gm = /* @__PURE__ */ f({
  name: "MessageBox",
  __name: "message-box",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M288 384h448v64H288zm96-128h256v64H384zM131.456 512H384v128h256V512h252.544L721.856 192H302.144zM896 576H704v128H320V576H128v256h768zM275.776 128h472.448a32 32 0 0 1 28.608 17.664l179.84 359.552A32 32 0 0 1 960 519.552V864a32 32 0 0 1-32 32H96a32 32 0 0 1-32-32V519.552a32 32 0 0 1 3.392-14.336l179.776-359.552A32 32 0 0 1 275.776 128"
      })
    ]));
  }
}), $m = Gm, Qm = /* @__PURE__ */ f({
  name: "Message",
  __name: "message",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M128 224v512a64 64 0 0 0 64 64h640a64 64 0 0 0 64-64V224zm0-64h768a64 64 0 0 1 64 64v512a128 128 0 0 1-128 128H192A128 128 0 0 1 64 736V224a64 64 0 0 1 64-64"
      }),
      c("path", {
        fill: "currentColor",
        d: "M904 224 656.512 506.88a192 192 0 0 1-289.024 0L120 224zm-698.944 0 210.56 240.704a128 128 0 0 0 192.704 0L818.944 224z"
      })
    ]));
  }
}), Ym = Qm, Zm = /* @__PURE__ */ f({
  name: "Mic",
  __name: "mic",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M480 704h160a64 64 0 0 0 64-64v-32h-96a32 32 0 0 1 0-64h96v-96h-96a32 32 0 0 1 0-64h96v-96h-96a32 32 0 0 1 0-64h96v-32a64 64 0 0 0-64-64H384a64 64 0 0 0-64 64v32h96a32 32 0 0 1 0 64h-96v96h96a32 32 0 0 1 0 64h-96v96h96a32 32 0 0 1 0 64h-96v32a64 64 0 0 0 64 64zm64 64v128h192a32 32 0 1 1 0 64H288a32 32 0 1 1 0-64h192V768h-96a128 128 0 0 1-128-128V192A128 128 0 0 1 384 64h256a128 128 0 0 1 128 128v448a128 128 0 0 1-128 128z"
      })
    ]));
  }
}), Km = Zm, Xm = /* @__PURE__ */ f({
  name: "Microphone",
  __name: "microphone",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M512 128a128 128 0 0 0-128 128v256a128 128 0 1 0 256 0V256a128 128 0 0 0-128-128m0-64a192 192 0 0 1 192 192v256a192 192 0 1 1-384 0V256A192 192 0 0 1 512 64m-32 832v-64a288 288 0 0 1-288-288v-32a32 32 0 0 1 64 0v32a224 224 0 0 0 224 224h64a224 224 0 0 0 224-224v-32a32 32 0 1 1 64 0v32a288 288 0 0 1-288 288v64h64a32 32 0 1 1 0 64H416a32 32 0 1 1 0-64z"
      })
    ]));
  }
}), Jm = Xm, e8 = /* @__PURE__ */ f({
  name: "MilkTea",
  __name: "milk-tea",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M416 128V96a96 96 0 0 1 96-96h128a32 32 0 1 1 0 64H512a32 32 0 0 0-32 32v32h320a96 96 0 0 1 11.712 191.296l-39.68 581.056A64 64 0 0 1 708.224 960H315.776a64 64 0 0 1-63.872-59.648l-39.616-581.056A96 96 0 0 1 224 128zM276.48 320l39.296 576h392.448l4.8-70.784a224.064 224.064 0 0 1 30.016-439.808L747.52 320zM224 256h576a32 32 0 1 0 0-64H224a32 32 0 0 0 0 64m493.44 503.872 21.12-309.12a160 160 0 0 0-21.12 309.12"
      })
    ]));
  }
}), t8 = e8, n8 = /* @__PURE__ */ f({
  name: "Minus",
  __name: "minus",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M128 544h768a32 32 0 1 0 0-64H128a32 32 0 0 0 0 64"
      })
    ]));
  }
}), a8 = n8, r8 = /* @__PURE__ */ f({
  name: "Money",
  __name: "money",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M256 640v192h640V384H768v-64h150.976c14.272 0 19.456 1.472 24.64 4.288a29.06 29.06 0 0 1 12.16 12.096c2.752 5.184 4.224 10.368 4.224 24.64v493.952c0 14.272-1.472 19.456-4.288 24.64a29.06 29.06 0 0 1-12.096 12.16c-5.184 2.752-10.368 4.224-24.64 4.224H233.024c-14.272 0-19.456-1.472-24.64-4.288a29.06 29.06 0 0 1-12.16-12.096c-2.688-5.184-4.224-10.368-4.224-24.576V640z"
      }),
      c("path", {
        fill: "currentColor",
        d: "M768 192H128v448h640zm64-22.976v493.952c0 14.272-1.472 19.456-4.288 24.64a29.06 29.06 0 0 1-12.096 12.16c-5.184 2.752-10.368 4.224-24.64 4.224H105.024c-14.272 0-19.456-1.472-24.64-4.288a29.06 29.06 0 0 1-12.16-12.096C65.536 682.432 64 677.248 64 663.04V169.024c0-14.272 1.472-19.456 4.288-24.64a29.06 29.06 0 0 1 12.096-12.16C85.568 129.536 90.752 128 104.96 128h685.952c14.272 0 19.456 1.472 24.64 4.288a29.06 29.06 0 0 1 12.16 12.096c2.752 5.184 4.224 10.368 4.224 24.64z"
      }),
      c("path", {
        fill: "currentColor",
        d: "M448 576a160 160 0 1 1 0-320 160 160 0 0 1 0 320m0-64a96 96 0 1 0 0-192 96 96 0 0 0 0 192"
      })
    ]));
  }
}), o8 = r8, i8 = /* @__PURE__ */ f({
  name: "Monitor",
  __name: "monitor",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M544 768v128h192a32 32 0 1 1 0 64H288a32 32 0 1 1 0-64h192V768H192A128 128 0 0 1 64 640V256a128 128 0 0 1 128-128h640a128 128 0 0 1 128 128v384a128 128 0 0 1-128 128zM192 192a64 64 0 0 0-64 64v384a64 64 0 0 0 64 64h640a64 64 0 0 0 64-64V256a64 64 0 0 0-64-64z"
      })
    ]));
  }
}), l8 = i8, s8 = /* @__PURE__ */ f({
  name: "MoonNight",
  __name: "moon-night",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M384 512a448 448 0 0 1 215.872-383.296A384 384 0 0 0 213.76 640h188.8A448.3 448.3 0 0 1 384 512M171.136 704a448 448 0 0 1 636.992-575.296A384 384 0 0 0 499.328 704h-328.32z"
      }),
      c("path", {
        fill: "currentColor",
        d: "M32 640h960q32 0 32 32t-32 32H32q-32 0-32-32t32-32m128 128h384a32 32 0 1 1 0 64H160a32 32 0 1 1 0-64m160 127.68 224 .256a32 32 0 0 1 32 32V928a32 32 0 0 1-32 32l-224-.384a32 32 0 0 1-32-32v-.064a32 32 0 0 1 32-32z"
      })
    ]));
  }
}), c8 = s8, d8 = /* @__PURE__ */ f({
  name: "Moon",
  __name: "moon",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M240.448 240.448a384 384 0 1 0 559.424 525.696 448 448 0 0 1-542.016-542.08 391 391 0 0 0-17.408 16.384m181.056 362.048a384 384 0 0 0 525.632 16.384A448 448 0 1 1 405.056 76.8a384 384 0 0 0 16.448 525.696"
      })
    ]));
  }
}), u8 = d8, m8 = /* @__PURE__ */ f({
  name: "MoreFilled",
  __name: "more-filled",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M176 416a112 112 0 1 1 0 224 112 112 0 0 1 0-224m336 0a112 112 0 1 1 0 224 112 112 0 0 1 0-224m336 0a112 112 0 1 1 0 224 112 112 0 0 1 0-224"
      })
    ]));
  }
}), h8 = m8, f8 = /* @__PURE__ */ f({
  name: "More",
  __name: "more",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M176 416a112 112 0 1 0 0 224 112 112 0 0 0 0-224m0 64a48 48 0 1 1 0 96 48 48 0 0 1 0-96m336-64a112 112 0 1 1 0 224 112 112 0 0 1 0-224m0 64a48 48 0 1 0 0 96 48 48 0 0 0 0-96m336-64a112 112 0 1 1 0 224 112 112 0 0 1 0-224m0 64a48 48 0 1 0 0 96 48 48 0 0 0 0-96"
      })
    ]));
  }
}), p8 = f8, g8 = /* @__PURE__ */ f({
  name: "MostlyCloudy",
  __name: "mostly-cloudy",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M737.216 357.952 704 349.824l-11.776-32a192.064 192.064 0 0 0-367.424 23.04l-8.96 39.04-39.04 8.96A192.064 192.064 0 0 0 320 768h368a207.81 207.81 0 0 0 207.808-208 208.32 208.32 0 0 0-158.592-202.048m15.168-62.208A272.32 272.32 0 0 1 959.744 560a271.81 271.81 0 0 1-271.552 272H320a256 256 0 0 1-57.536-505.536 256.128 256.128 0 0 1 489.92-30.72"
      })
    ]));
  }
}), v8 = g8, _8 = /* @__PURE__ */ f({
  name: "Mouse",
  __name: "mouse",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M438.144 256c-68.352 0-92.736 4.672-117.76 18.112q-30.144 16.128-46.272 46.272C260.672 345.408 256 369.792 256 438.144v275.712c0 68.352 4.672 92.736 18.112 117.76q16.128 30.144 46.272 46.272C345.408 891.328 369.792 896 438.144 896h147.712c68.352 0 92.736-4.672 117.76-18.112q30.144-16.128 46.272-46.272C763.328 806.592 768 782.208 768 713.856V438.144c0-68.352-4.672-92.736-18.112-117.76a110.46 110.46 0 0 0-46.272-46.272C678.592 260.672 654.208 256 585.856 256zm0-64h147.712c85.568 0 116.608 8.96 147.904 25.6 31.36 16.768 55.872 41.344 72.576 72.64C823.104 321.536 832 352.576 832 438.08v275.84c0 85.504-8.96 116.544-25.6 147.84a174.46 174.46 0 0 1-72.64 72.576C702.464 951.104 671.424 960 585.92 960H438.08c-85.504 0-116.544-8.96-147.84-25.6a174.46 174.46 0 0 1-72.64-72.704c-16.768-31.296-25.664-62.336-25.664-147.84v-275.84c0-85.504 8.96-116.544 25.6-147.84a174.46 174.46 0 0 1 72.768-72.576c31.232-16.704 62.272-25.6 147.776-25.6z"
      }),
      c("path", {
        fill: "currentColor",
        d: "M512 320q32 0 32 32v128q0 32-32 32t-32-32V352q0-32 32-32m32-96a32 32 0 0 1-64 0v-64a32 32 0 0 0-32-32h-96a32 32 0 0 1 0-64h96a96 96 0 0 1 96 96z"
      })
    ]));
  }
}), w8 = _8, y8 = /* @__PURE__ */ f({
  name: "Mug",
  __name: "mug",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M736 800V160H160v640a64 64 0 0 0 64 64h448a64 64 0 0 0 64-64m64-544h63.552a96 96 0 0 1 96 96v224a96 96 0 0 1-96 96H800v128a128 128 0 0 1-128 128H224A128 128 0 0 1 96 800V128a32 32 0 0 1 32-32h640a32 32 0 0 1 32 32zm0 64v288h63.552a32 32 0 0 0 32-32V352a32 32 0 0 0-32-32z"
      })
    ]));
  }
}), b8 = y8, C8 = /* @__PURE__ */ f({
  name: "MuteNotification",
  __name: "mute-notification",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "m241.216 832 63.616-64H768V448c0-42.368-10.24-82.304-28.48-117.504l46.912-47.232C815.36 331.392 832 387.84 832 448v320h96a32 32 0 1 1 0 64zm-90.24 0H96a32 32 0 1 1 0-64h96V448a320.13 320.13 0 0 1 256-313.6V128a64 64 0 1 1 128 0v6.4a319.55 319.55 0 0 1 171.648 97.088l-45.184 45.44A256 256 0 0 0 256 448v278.336L151.04 832zM448 896h128a64 64 0 0 1-128 0"
      }),
      c("path", {
        fill: "currentColor",
        d: "M150.72 859.072a32 32 0 0 1-45.44-45.056l704-708.544a32 32 0 0 1 45.44 45.056z"
      })
    ]));
  }
}), A8 = C8, x8 = /* @__PURE__ */ f({
  name: "Mute",
  __name: "mute",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "m412.16 592.128-45.44 45.44A191.23 191.23 0 0 1 320 512V256a192 192 0 1 1 384 0v44.352l-64 64V256a128 128 0 1 0-256 0v256c0 30.336 10.56 58.24 28.16 80.128m51.968 38.592A128 128 0 0 0 640 512v-57.152l64-64V512a192 192 0 0 1-287.68 166.528zM314.88 779.968l46.144-46.08A223 223 0 0 0 480 768h64a224 224 0 0 0 224-224v-32a32 32 0 1 1 64 0v32a288 288 0 0 1-288 288v64h64a32 32 0 1 1 0 64H416a32 32 0 1 1 0-64h64v-64c-61.44 0-118.4-19.2-165.12-52.032M266.752 737.6A286.98 286.98 0 0 1 192 544v-32a32 32 0 0 1 64 0v32c0 56.832 21.184 108.8 56.064 148.288z"
      }),
      c("path", {
        fill: "currentColor",
        d: "M150.72 859.072a32 32 0 0 1-45.44-45.056l704-708.544a32 32 0 0 1 45.44 45.056z"
      })
    ]));
  }
}), E8 = x8, S8 = /* @__PURE__ */ f({
  name: "NoSmoking",
  __name: "no-smoking",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M440.256 576H256v128h56.256l-64 64H224a32 32 0 0 1-32-32V544a32 32 0 0 1 32-32h280.256zm143.488 128H704V583.744L775.744 512H928a32 32 0 0 1 32 32v192a32 32 0 0 1-32 32H519.744zM768 576v128h128V576zm-29.696-207.552 45.248 45.248-497.856 497.856-45.248-45.248zM256 64h64v320h-64zM128 192h64v192h-64zM64 512h64v256H64z"
      })
    ]));
  }
}), M8 = S8, D8 = /* @__PURE__ */ f({
  name: "Notebook",
  __name: "notebook",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M192 128v768h640V128zm-32-64h704a32 32 0 0 1 32 32v832a32 32 0 0 1-32 32H160a32 32 0 0 1-32-32V96a32 32 0 0 1 32-32"
      }),
      c("path", {
        fill: "currentColor",
        d: "M672 128h64v768h-64zM96 192h128q32 0 32 32t-32 32H96q-32 0-32-32t32-32m0 192h128q32 0 32 32t-32 32H96q-32 0-32-32t32-32m0 192h128q32 0 32 32t-32 32H96q-32 0-32-32t32-32m0 192h128q32 0 32 32t-32 32H96q-32 0-32-32t32-32"
      })
    ]));
  }
}), T8 = D8, R8 = /* @__PURE__ */ f({
  name: "Notification",
  __name: "notification",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M512 128v64H256a64 64 0 0 0-64 64v512a64 64 0 0 0 64 64h512a64 64 0 0 0 64-64V512h64v256a128 128 0 0 1-128 128H256a128 128 0 0 1-128-128V256a128 128 0 0 1 128-128z"
      }),
      c("path", {
        fill: "currentColor",
        d: "M768 384a128 128 0 1 0 0-256 128 128 0 0 0 0 256m0 64a192 192 0 1 1 0-384 192 192 0 0 1 0 384"
      })
    ]));
  }
}), H8 = R8, I8 = /* @__PURE__ */ f({
  name: "Odometer",
  __name: "odometer",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M512 896a384 384 0 1 0 0-768 384 384 0 0 0 0 768m0 64a448 448 0 1 1 0-896 448 448 0 0 1 0 896"
      }),
      c("path", {
        fill: "currentColor",
        d: "M192 512a320 320 0 1 1 640 0 32 32 0 1 1-64 0 256 256 0 1 0-512 0 32 32 0 0 1-64 0"
      }),
      c("path", {
        fill: "currentColor",
        d: "M570.432 627.84A96 96 0 1 1 509.568 608l60.992-187.776A32 32 0 1 1 631.424 440l-60.992 187.776zM502.08 734.464a32 32 0 1 0 19.84-60.928 32 32 0 0 0-19.84 60.928"
      })
    ]));
  }
}), k8 = I8, z8 = /* @__PURE__ */ f({
  name: "OfficeBuilding",
  __name: "office-building",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M192 128v704h384V128zm-32-64h448a32 32 0 0 1 32 32v768a32 32 0 0 1-32 32H160a32 32 0 0 1-32-32V96a32 32 0 0 1 32-32"
      }),
      c("path", {
        fill: "currentColor",
        d: "M256 256h256v64H256zm0 192h256v64H256zm0 192h256v64H256zm384-128h128v64H640zm0 128h128v64H640zM64 832h896v64H64z"
      }),
      c("path", {
        fill: "currentColor",
        d: "M640 384v448h192V384zm-32-64h256a32 32 0 0 1 32 32v512a32 32 0 0 1-32 32H608a32 32 0 0 1-32-32V352a32 32 0 0 1 32-32"
      })
    ]));
  }
}), V8 = z8, O8 = /* @__PURE__ */ f({
  name: "Open",
  __name: "open",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M329.956 257.138a254.862 254.862 0 0 0 0 509.724h364.088a254.862 254.862 0 0 0 0-509.724zm0-72.818h364.088a327.68 327.68 0 1 1 0 655.36H329.956a327.68 327.68 0 1 1 0-655.36"
      }),
      c("path", {
        fill: "currentColor",
        d: "M694.044 621.227a109.227 109.227 0 1 0 0-218.454 109.227 109.227 0 0 0 0 218.454m0 72.817a182.044 182.044 0 1 1 0-364.088 182.044 182.044 0 0 1 0 364.088"
      })
    ]));
  }
}), B8 = O8, L8 = /* @__PURE__ */ f({
  name: "Operation",
  __name: "operation",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M389.44 768a96.064 96.064 0 0 1 181.12 0H896v64H570.56a96.064 96.064 0 0 1-181.12 0H128v-64zm192-288a96.064 96.064 0 0 1 181.12 0H896v64H762.56a96.064 96.064 0 0 1-181.12 0H128v-64zm-320-288a96.064 96.064 0 0 1 181.12 0H896v64H442.56a96.064 96.064 0 0 1-181.12 0H128v-64z"
      })
    ]));
  }
}), N8 = L8, P8 = /* @__PURE__ */ f({
  name: "Opportunity",
  __name: "opportunity",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M384 960v-64h192.064v64zm448-544a350.66 350.66 0 0 1-128.32 271.424C665.344 719.04 640 763.776 640 813.504V832H320v-14.336c0-48-19.392-95.36-57.216-124.992a351.55 351.55 0 0 1-128.448-344.256c25.344-136.448 133.888-248.128 269.76-276.48A352.384 352.384 0 0 1 832 416m-544 32c0-132.288 75.904-224 192-224v-64c-154.432 0-256 122.752-256 288z"
      })
    ]));
  }
}), j8 = P8, q8 = /* @__PURE__ */ f({
  name: "Orange",
  __name: "orange",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M544 894.72a382.34 382.34 0 0 0 215.936-89.472L577.024 622.272c-10.24 6.016-21.248 10.688-33.024 13.696v258.688zm261.248-134.784A382.34 382.34 0 0 0 894.656 544H635.968c-3.008 11.776-7.68 22.848-13.696 33.024zM894.656 480a382.34 382.34 0 0 0-89.408-215.936L622.272 446.976c6.016 10.24 10.688 21.248 13.696 33.024zm-134.72-261.248A382.34 382.34 0 0 0 544 129.344v258.688c11.776 3.008 22.848 7.68 33.024 13.696zM480 129.344a382.34 382.34 0 0 0-215.936 89.408l182.912 182.976c10.24-6.016 21.248-10.688 33.024-13.696zm-261.248 134.72A382.34 382.34 0 0 0 129.344 480h258.688c3.008-11.776 7.68-22.848 13.696-33.024zM129.344 544a382.34 382.34 0 0 0 89.408 215.936l182.976-182.912A127.2 127.2 0 0 1 388.032 544zm134.72 261.248A382.34 382.34 0 0 0 480 894.656V635.968a127.2 127.2 0 0 1-33.024-13.696zM512 960a448 448 0 1 1 0-896 448 448 0 0 1 0 896m0-384a64 64 0 1 0 0-128 64 64 0 0 0 0 128"
      })
    ]));
  }
}), F8 = q8, U8 = /* @__PURE__ */ f({
  name: "Paperclip",
  __name: "paperclip",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M602.496 240.448A192 192 0 1 1 874.048 512l-316.8 316.8A256 256 0 0 1 195.2 466.752L602.496 59.456l45.248 45.248L240.448 512A192 192 0 0 0 512 783.552l316.8-316.8a128 128 0 1 0-181.056-181.056L353.6 579.904a32 32 0 1 0 45.248 45.248l294.144-294.144 45.312 45.248L444.096 670.4a96 96 0 1 1-135.744-135.744z"
      })
    ]));
  }
}), W8 = U8, G8 = /* @__PURE__ */ f({
  name: "PartlyCloudy",
  __name: "partly-cloudy",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M598.4 895.872H328.192a256 256 0 0 1-34.496-510.528A352 352 0 1 1 598.4 895.872m-271.36-64h272.256a288 288 0 1 0-248.512-417.664L335.04 445.44l-34.816 3.584a192 192 0 0 0 26.88 382.848z"
      }),
      c("path", {
        fill: "currentColor",
        d: "M139.84 501.888a256 256 0 1 1 417.856-277.12c-17.728 2.176-38.208 8.448-61.504 18.816A192 192 0 1 0 189.12 460.48a6004 6004 0 0 0-49.28 41.408"
      })
    ]));
  }
}), $8 = G8, Q8 = /* @__PURE__ */ f({
  name: "Pear",
  __name: "pear",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M542.336 258.816a443 443 0 0 0-9.024 25.088 32 32 0 1 1-60.8-20.032l1.088-3.328a162.69 162.69 0 0 0-122.048 131.392l-17.088 102.72-20.736 15.36C256.192 552.704 224 610.88 224 672c0 120.576 126.4 224 288 224s288-103.424 288-224c0-61.12-32.192-119.296-89.728-161.92l-20.736-15.424-17.088-102.72a162.69 162.69 0 0 0-130.112-133.12m-40.128-66.56c7.936-15.552 16.576-30.08 25.92-43.776 23.296-33.92 49.408-59.776 78.528-77.12a32 32 0 1 1 32.704 55.04c-20.544 12.224-40.064 31.552-58.432 58.304a317 317 0 0 0-9.792 15.104 226.69 226.69 0 0 1 164.48 181.568l12.8 77.248C819.456 511.36 864 587.392 864 672c0 159.04-157.568 288-352 288S160 831.04 160 672c0-84.608 44.608-160.64 115.584-213.376l12.8-77.248a226.624 226.624 0 0 1 213.76-189.184z"
      })
    ]));
  }
}), Y8 = Q8, Z8 = /* @__PURE__ */ f({
  name: "PhoneFilled",
  __name: "phone-filled",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M199.232 125.568 90.624 379.008a32 32 0 0 0 6.784 35.2l512.384 512.384a32 32 0 0 0 35.2 6.784l253.44-108.608a32 32 0 0 0 10.048-52.032L769.6 633.92a32 32 0 0 0-36.928-5.952l-130.176 65.088-271.488-271.552 65.024-130.176a32 32 0 0 0-5.952-36.928L251.2 115.52a32 32 0 0 0-51.968 10.048"
      })
    ]));
  }
}), K8 = Z8, X8 = /* @__PURE__ */ f({
  name: "Phone",
  __name: "phone",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M79.36 432.256 591.744 944.64a32 32 0 0 0 35.2 6.784l253.44-108.544a32 32 0 0 0 9.984-52.032l-153.856-153.92a32 32 0 0 0-36.928-6.016l-69.888 34.944L358.08 394.24l35.008-69.888a32 32 0 0 0-5.952-36.928L233.152 133.568a32 32 0 0 0-52.032 10.048L72.512 397.056a32 32 0 0 0 6.784 35.2zm60.48-29.952 81.536-190.08L325.568 316.48l-24.64 49.216-20.608 41.216 32.576 32.64 271.552 271.552 32.64 32.64 41.216-20.672 49.28-24.576 104.192 104.128-190.08 81.472zM512 320v-64a256 256 0 0 1 256 256h-64a192 192 0 0 0-192-192m0-192V64a448 448 0 0 1 448 448h-64a384 384 0 0 0-384-384"
      })
    ]));
  }
}), J8 = X8, eh = /* @__PURE__ */ f({
  name: "PictureFilled",
  __name: "picture-filled",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M96 896a32 32 0 0 1-32-32V160a32 32 0 0 1 32-32h832a32 32 0 0 1 32 32v704a32 32 0 0 1-32 32zm315.52-228.48-68.928-68.928a32 32 0 0 0-45.248 0L128 768.064h778.688l-242.112-290.56a32 32 0 0 0-49.216 0L458.752 665.408a32 32 0 0 1-47.232 2.112M256 384a96 96 0 1 0 192.064-.064A96 96 0 0 0 256 384"
      })
    ]));
  }
}), th = eh, nh = /* @__PURE__ */ f({
  name: "PictureRounded",
  __name: "picture-rounded",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M512 128a384 384 0 1 0 0 768 384 384 0 0 0 0-768m0-64a448 448 0 1 1 0 896 448 448 0 0 1 0-896"
      }),
      c("path", {
        fill: "currentColor",
        d: "M640 288q64 0 64 64t-64 64-64-64 64-64M214.656 790.656l-45.312-45.312 185.664-185.6a96 96 0 0 1 123.712-10.24l138.24 98.688a32 32 0 0 0 39.872-2.176L906.688 422.4l42.624 47.744L699.52 693.696a96 96 0 0 1-119.808 6.592l-138.24-98.752a32 32 0 0 0-41.152 3.456l-185.664 185.6z"
      })
    ]));
  }
}), ah = nh, rh = /* @__PURE__ */ f({
  name: "Picture",
  __name: "picture",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M160 160v704h704V160zm-32-64h768a32 32 0 0 1 32 32v768a32 32 0 0 1-32 32H128a32 32 0 0 1-32-32V128a32 32 0 0 1 32-32"
      }),
      c("path", {
        fill: "currentColor",
        d: "M384 288q64 0 64 64t-64 64-64-64 64-64M185.408 876.992l-50.816-38.912L350.72 556.032a96 96 0 0 1 134.592-17.856l1.856 1.472 122.88 99.136a32 32 0 0 0 44.992-4.864l216-269.888 49.92 39.936-215.808 269.824-.256.32a96 96 0 0 1-135.04 14.464l-122.88-99.072-.64-.512a32 32 0 0 0-44.8 5.952z"
      })
    ]));
  }
}), oh = rh, ih = /* @__PURE__ */ f({
  name: "PieChart",
  __name: "pie-chart",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M448 68.48v64.832A384.128 384.128 0 0 0 512 896a384.13 384.13 0 0 0 378.688-320h64.768A448.128 448.128 0 0 1 64 512 448.13 448.13 0 0 1 448 68.48"
      }),
      c("path", {
        fill: "currentColor",
        d: "M576 97.28V448h350.72A384.064 384.064 0 0 0 576 97.28M512 64V33.152A448 448 0 0 1 990.848 512H512z"
      })
    ]));
  }
}), lh = ih, sh = /* @__PURE__ */ f({
  name: "Place",
  __name: "place",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M512 512a192 192 0 1 0 0-384 192 192 0 0 0 0 384m0 64a256 256 0 1 1 0-512 256 256 0 0 1 0 512"
      }),
      c("path", {
        fill: "currentColor",
        d: "M512 512a32 32 0 0 1 32 32v256a32 32 0 1 1-64 0V544a32 32 0 0 1 32-32"
      }),
      c("path", {
        fill: "currentColor",
        d: "M384 649.088v64.96C269.76 732.352 192 771.904 192 800c0 37.696 139.904 96 320 96s320-58.304 320-96c0-28.16-77.76-67.648-192-85.952v-64.96C789.12 671.04 896 730.368 896 800c0 88.32-171.904 160-384 160s-384-71.68-384-160c0-69.696 106.88-128.96 256-150.912"
      })
    ]));
  }
}), ch = sh, dh = /* @__PURE__ */ f({
  name: "Platform",
  __name: "platform",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M448 832v-64h128v64h192v64H256v-64zM128 704V128h768v576z"
      })
    ]));
  }
}), uh = dh, mh = /* @__PURE__ */ f({
  name: "Plus",
  __name: "plus",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M480 480V128a32 32 0 0 1 64 0v352h352a32 32 0 1 1 0 64H544v352a32 32 0 1 1-64 0V544H128a32 32 0 0 1 0-64z"
      })
    ]));
  }
}), hh = mh, fh = /* @__PURE__ */ f({
  name: "Pointer",
  __name: "pointer",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M511.552 128c-35.584 0-64.384 28.8-64.384 64.448v516.48L274.048 570.88a94.27 94.27 0 0 0-112.896-3.456 44.416 44.416 0 0 0-8.96 62.208L332.8 870.4A64 64 0 0 0 384 896h512V575.232a64 64 0 0 0-45.632-61.312l-205.952-61.76A96 96 0 0 1 576 360.192V192.448C576 156.8 547.2 128 511.552 128M359.04 556.8l24.128 19.2V192.448a128.448 128.448 0 1 1 256.832 0v167.744a32 32 0 0 0 22.784 30.656l206.016 61.76A128 128 0 0 1 960 575.232V896a64 64 0 0 1-64 64H384a128 128 0 0 1-102.4-51.2L101.056 668.032A108.416 108.416 0 0 1 128 512.512a158.27 158.27 0 0 1 185.984 8.32z"
      })
    ]));
  }
}), ph = fh, gh = /* @__PURE__ */ f({
  name: "Position",
  __name: "position",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "m249.6 417.088 319.744 43.072 39.168 310.272L845.12 178.88zm-129.024 47.168a32 32 0 0 1-7.68-61.44l777.792-311.04a32 32 0 0 1 41.6 41.6l-310.336 775.68a32 32 0 0 1-61.44-7.808L512 516.992z"
      })
    ]));
  }
}), vh = gh, _h = /* @__PURE__ */ f({
  name: "Postcard",
  __name: "postcard",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M160 224a32 32 0 0 0-32 32v512a32 32 0 0 0 32 32h704a32 32 0 0 0 32-32V256a32 32 0 0 0-32-32zm0-64h704a96 96 0 0 1 96 96v512a96 96 0 0 1-96 96H160a96 96 0 0 1-96-96V256a96 96 0 0 1 96-96"
      }),
      c("path", {
        fill: "currentColor",
        d: "M704 320a64 64 0 1 1 0 128 64 64 0 0 1 0-128M288 448h256q32 0 32 32t-32 32H288q-32 0-32-32t32-32m0 128h256q32 0 32 32t-32 32H288q-32 0-32-32t32-32"
      })
    ]));
  }
}), wh = _h, yh = /* @__PURE__ */ f({
  name: "Pouring",
  __name: "pouring",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "m739.328 291.328-35.2-6.592-12.8-33.408a192.064 192.064 0 0 0-365.952 23.232l-9.92 40.896-41.472 7.04a176.32 176.32 0 0 0-146.24 173.568c0 97.28 78.72 175.936 175.808 175.936h400a192 192 0 0 0 35.776-380.672M959.552 480a256 256 0 0 1-256 256h-400A239.81 239.81 0 0 1 63.744 496.192a240.32 240.32 0 0 1 199.488-236.8 256.128 256.128 0 0 1 487.872-30.976A256.064 256.064 0 0 1 959.552 480M224 800a32 32 0 0 1 32 32v96a32 32 0 1 1-64 0v-96a32 32 0 0 1 32-32m192 0a32 32 0 0 1 32 32v96a32 32 0 1 1-64 0v-96a32 32 0 0 1 32-32m192 0a32 32 0 0 1 32 32v96a32 32 0 1 1-64 0v-96a32 32 0 0 1 32-32m192 0a32 32 0 0 1 32 32v96a32 32 0 1 1-64 0v-96a32 32 0 0 1 32-32"
      })
    ]));
  }
}), bh = yh, Ch = /* @__PURE__ */ f({
  name: "Present",
  __name: "present",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M480 896V640H192v-64h288V320H192v576zm64 0h288V320H544v256h288v64H544zM128 256h768v672a32 32 0 0 1-32 32H160a32 32 0 0 1-32-32z"
      }),
      c("path", {
        fill: "currentColor",
        d: "M96 256h832q32 0 32 32t-32 32H96q-32 0-32-32t32-32"
      }),
      c("path", {
        fill: "currentColor",
        d: "M416 256a64 64 0 1 0 0-128 64 64 0 0 0 0 128m0 64a128 128 0 1 1 0-256 128 128 0 0 1 0 256"
      }),
      c("path", {
        fill: "currentColor",
        d: "M608 256a64 64 0 1 0 0-128 64 64 0 0 0 0 128m0 64a128 128 0 1 1 0-256 128 128 0 0 1 0 256"
      })
    ]));
  }
}), Ah = Ch, xh = /* @__PURE__ */ f({
  name: "PriceTag",
  __name: "price-tag",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M224 318.336V896h576V318.336L552.512 115.84a64 64 0 0 0-81.024 0zM593.024 66.304l259.2 212.096A32 32 0 0 1 864 303.168V928a32 32 0 0 1-32 32H192a32 32 0 0 1-32-32V303.168a32 32 0 0 1 11.712-24.768l259.2-212.096a128 128 0 0 1 162.112 0"
      }),
      c("path", {
        fill: "currentColor",
        d: "M512 448a64 64 0 1 0 0-128 64 64 0 0 0 0 128m0 64a128 128 0 1 1 0-256 128 128 0 0 1 0 256"
      })
    ]));
  }
}), Eh = xh, Sh = /* @__PURE__ */ f({
  name: "Printer",
  __name: "printer",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M256 768H105.024c-14.272 0-19.456-1.472-24.64-4.288a29.06 29.06 0 0 1-12.16-12.096C65.536 746.432 64 741.248 64 727.04V379.072c0-42.816 4.48-58.304 12.8-73.984 8.384-15.616 20.672-27.904 36.288-36.288 15.68-8.32 31.168-12.8 73.984-12.8H256V64h512v192h68.928c42.816 0 58.304 4.48 73.984 12.8 15.616 8.384 27.904 20.672 36.288 36.288 8.32 15.68 12.8 31.168 12.8 73.984v347.904c0 14.272-1.472 19.456-4.288 24.64a29.06 29.06 0 0 1-12.096 12.16c-5.184 2.752-10.368 4.224-24.64 4.224H768v192H256zm64-192v320h384V576zm-64 128V512h512v192h128V379.072c0-29.376-1.408-36.48-5.248-43.776a23.3 23.3 0 0 0-10.048-10.048c-7.232-3.84-14.4-5.248-43.776-5.248H187.072c-29.376 0-36.48 1.408-43.776 5.248a23.3 23.3 0 0 0-10.048 10.048c-3.84 7.232-5.248 14.4-5.248 43.776V704zm64-448h384V128H320zm-64 128h64v64h-64zm128 0h64v64h-64z"
      })
    ]));
  }
}), Mh = Sh, Dh = /* @__PURE__ */ f({
  name: "Promotion",
  __name: "promotion",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "m64 448 832-320-128 704-446.08-243.328L832 192 242.816 545.472zm256 512V657.024L512 768z"
      })
    ]));
  }
}), Th = Dh, Rh = /* @__PURE__ */ f({
  name: "QuartzWatch",
  __name: "quartz-watch",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      "xml:space": "preserve",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M422.02 602.01v-.03c-6.68-5.99-14.35-8.83-23.01-8.51q-13.005.48-22.5 10.02c-6.33 6.36-9.5 13.7-9.5 22.02s3 15.82 8.99 22.5c8.68 8.68 19.02 11.35 31.01 8s19.49-10.85 22.5-22.5.51-22.15-7.49-31.49zM384 512c0-9.35-3-17.02-8.99-23.01-6-5.99-13.66-8.99-23.01-8.99s-17.02 3-23.01 8.99c-5.99 6-8.99 13.66-8.99 23.01s3 17.02 8.99 23.01c6 5.99 13.66 8.99 23.01 8.99s17.02-3 23.01-8.99c5.99-6 8.99-13.67 8.99-23.01m6.53-82.49c11.65 3.01 22.15.51 31.49-7.49h.04c5.99-6.68 8.83-14.34 8.51-23.01s-3.66-16.16-10.02-22.5c-6.36-6.33-13.7-9.5-22.02-9.5s-15.82 3-22.5 8.99c-8.68 8.69-11.35 19.02-8 31.01q5.025 17.985 22.5 22.5m242.94 0q17.505-4.545 22.02-22.02c3.01-11.65.51-22.15-7.49-31.49h.01c-6.68-5.99-14.18-8.99-22.5-8.99s-15.66 3.16-22.02 9.5q-9.54 9.51-10.02 22.5c-.32 8.66 2.52 16.33 8.51 23.01 9.32 8.02 19.82 10.52 31.49 7.49M512 640c-9.35 0-17.02 3-23.01 8.99-5.99 6-8.99 13.66-8.99 23.01s3 17.02 8.99 23.01c6 5.99 13.67 8.99 23.01 8.99 9.35 0 17.02-3 23.01-8.99 5.99-6 8.99-13.66 8.99-23.01s-3-17.02-8.99-23.01c-6-5.99-13.66-8.99-23.01-8.99m183.01-151.01c-6-5.99-13.66-8.99-23.01-8.99s-17.02 3-23.01 8.99c-5.99 6-8.99 13.66-8.99 23.01s3 17.02 8.99 23.01c6 5.99 13.66 8.99 23.01 8.99s17.02-3 23.01-8.99c5.99-6 8.99-13.67 8.99-23.01 0-9.35-3-17.02-8.99-23.01"
      }),
      c("path", {
        fill: "currentColor",
        d: "M832 512c-2-90.67-33.17-166.17-93.5-226.5-20.43-20.42-42.6-37.49-66.5-51.23V64H352v170.26c-23.9 13.74-46.07 30.81-66.5 51.24-60.33 60.33-91.49 135.83-93.5 226.5 2 90.67 33.17 166.17 93.5 226.5 20.43 20.43 42.6 37.5 66.5 51.24V960h320V789.74c23.9-13.74 46.07-30.81 66.5-51.24 60.33-60.34 91.49-135.83 93.5-226.5M416 128h192v78.69c-29.85-9.03-61.85-13.93-96-14.69-34.15.75-66.15 5.65-96 14.68zm192 768H416v-78.68c29.85 9.03 61.85 13.93 96 14.68 34.15-.75 66.15-5.65 96-14.68zm-96-128c-72.66-2.01-132.99-27.01-180.99-75.01S258.01 584.66 256 512c2.01-72.66 27.01-132.99 75.01-180.99S439.34 258.01 512 256c72.66 2.01 132.99 27.01 180.99 75.01S765.99 439.34 768 512c-2.01 72.66-27.01 132.99-75.01 180.99S584.66 765.99 512 768"
      }),
      c("path", {
        fill: "currentColor",
        d: "M512 320c-9.35 0-17.02 3-23.01 8.99-5.99 6-8.99 13.66-8.99 23.01s3 17.02 8.99 23.01c6 5.99 13.67 8.99 23.01 8.99 9.35 0 17.02-3 23.01-8.99 5.99-6 8.99-13.66 8.99-23.01s-3-17.02-8.99-23.01c-6-5.99-13.66-8.99-23.01-8.99m112.99 273.5c-8.66-.32-16.33 2.52-23.01 8.51-7.98 9.32-10.48 19.82-7.49 31.49s10.49 19.17 22.5 22.5 22.35.66 31.01-8v.04c5.99-6.68 8.99-14.18 8.99-22.5s-3.16-15.66-9.5-22.02-13.84-9.7-22.5-10.02"
      })
    ]));
  }
}), Hh = Rh, Ih = /* @__PURE__ */ f({
  name: "QuestionFilled",
  __name: "question-filled",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M512 64a448 448 0 1 1 0 896 448 448 0 0 1 0-896m23.744 191.488c-52.096 0-92.928 14.784-123.2 44.352-30.976 29.568-45.76 70.4-45.76 122.496h80.256c0-29.568 5.632-52.8 17.6-68.992 13.376-19.712 35.2-28.864 66.176-28.864 23.936 0 42.944 6.336 56.32 19.712 12.672 13.376 19.712 31.68 19.712 54.912 0 17.6-6.336 34.496-19.008 49.984l-8.448 9.856c-45.76 40.832-73.216 70.4-82.368 89.408-9.856 19.008-14.08 42.24-14.08 68.992v9.856h80.96v-9.856c0-16.896 3.52-31.68 10.56-45.76 6.336-12.672 15.488-24.64 28.16-35.2 33.792-29.568 54.208-48.576 60.544-55.616 16.896-22.528 26.048-51.392 26.048-86.592q0-64.416-42.24-101.376c-28.16-25.344-65.472-37.312-111.232-37.312m-12.672 406.208a54.27 54.27 0 0 0-38.72 14.784 49.4 49.4 0 0 0-15.488 38.016c0 15.488 4.928 28.16 15.488 38.016A54.85 54.85 0 0 0 523.072 768c15.488 0 28.16-4.928 38.72-14.784a51.52 51.52 0 0 0 16.192-38.72 51.97 51.97 0 0 0-15.488-38.016 55.94 55.94 0 0 0-39.424-14.784"
      })
    ]));
  }
}), kh = Ih, zh = /* @__PURE__ */ f({
  name: "Rank",
  __name: "rank",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "m186.496 544 41.408 41.344a32 32 0 1 1-45.248 45.312l-96-96a32 32 0 0 1 0-45.312l96-96a32 32 0 1 1 45.248 45.312L186.496 480h290.816V186.432l-41.472 41.472a32 32 0 1 1-45.248-45.184l96-96.128a32 32 0 0 1 45.312 0l96 96.064a32 32 0 0 1-45.248 45.184l-41.344-41.28V480H832l-41.344-41.344a32 32 0 0 1 45.248-45.312l96 96a32 32 0 0 1 0 45.312l-96 96a32 32 0 0 1-45.248-45.312L832 544H541.312v293.44l41.344-41.28a32 32 0 1 1 45.248 45.248l-96 96a32 32 0 0 1-45.312 0l-96-96a32 32 0 1 1 45.312-45.248l41.408 41.408V544z"
      })
    ]));
  }
}), Vh = zh, Oh = /* @__PURE__ */ f({
  name: "ReadingLamp",
  __name: "reading-lamp",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M352 896h320q32 0 32 32t-32 32H352q-32 0-32-32t32-32m-44.672-768-99.52 448h608.384l-99.52-448zm-25.6-64h460.608a32 32 0 0 1 31.232 25.088l113.792 512A32 32 0 0 1 856.128 640H167.872a32 32 0 0 1-31.232-38.912l113.792-512A32 32 0 0 1 281.664 64z"
      }),
      c("path", {
        fill: "currentColor",
        d: "M672 576q32 0 32 32v128q0 32-32 32t-32-32V608q0-32 32-32m-192-.064h64V960h-64z"
      })
    ]));
  }
}), Bh = Oh, Lh = /* @__PURE__ */ f({
  name: "Reading",
  __name: "reading",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "m512 863.36 384-54.848v-638.72L525.568 222.72a96 96 0 0 1-27.136 0L128 169.792v638.72zM137.024 106.432l370.432 52.928a32 32 0 0 0 9.088 0l370.432-52.928A64 64 0 0 1 960 169.792v638.72a64 64 0 0 1-54.976 63.36l-388.48 55.488a32 32 0 0 1-9.088 0l-388.48-55.488A64 64 0 0 1 64 808.512v-638.72a64 64 0 0 1 73.024-63.36"
      }),
      c("path", {
        fill: "currentColor",
        d: "M480 192h64v704h-64z"
      })
    ]));
  }
}), Nh = Lh, Ph = /* @__PURE__ */ f({
  name: "RefreshLeft",
  __name: "refresh-left",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M289.088 296.704h92.992a32 32 0 0 1 0 64H232.96a32 32 0 0 1-32-32V179.712a32 32 0 0 1 64 0v50.56a384 384 0 0 1 643.84 282.88 384 384 0 0 1-383.936 384 384 384 0 0 1-384-384h64a320 320 0 1 0 640 0 320 320 0 0 0-555.712-216.448z"
      })
    ]));
  }
}), jh = Ph, qh = /* @__PURE__ */ f({
  name: "RefreshRight",
  __name: "refresh-right",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M784.512 230.272v-50.56a32 32 0 1 1 64 0v149.056a32 32 0 0 1-32 32H667.52a32 32 0 1 1 0-64h92.992A320 320 0 1 0 524.8 833.152a320 320 0 0 0 320-320h64a384 384 0 0 1-384 384 384 384 0 0 1-384-384 384 384 0 0 1 643.712-282.88"
      })
    ]));
  }
}), Fh = qh, Uh = /* @__PURE__ */ f({
  name: "Refresh",
  __name: "refresh",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M771.776 794.88A384 384 0 0 1 128 512h64a320 320 0 0 0 555.712 216.448H654.72a32 32 0 1 1 0-64h149.056a32 32 0 0 1 32 32v148.928a32 32 0 1 1-64 0v-50.56zM276.288 295.616h92.992a32 32 0 0 1 0 64H220.16a32 32 0 0 1-32-32V178.56a32 32 0 0 1 64 0v50.56A384 384 0 0 1 896.128 512h-64a320 320 0 0 0-555.776-216.384z"
      })
    ]));
  }
}), Wh = Uh, Gh = /* @__PURE__ */ f({
  name: "Refrigerator",
  __name: "refrigerator",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M256 448h512V160a32 32 0 0 0-32-32H288a32 32 0 0 0-32 32zm0 64v352a32 32 0 0 0 32 32h448a32 32 0 0 0 32-32V512zm32-448h448a96 96 0 0 1 96 96v704a96 96 0 0 1-96 96H288a96 96 0 0 1-96-96V160a96 96 0 0 1 96-96m32 224h64v96h-64zm0 288h64v96h-64z"
      })
    ]));
  }
}), $h = Gh, Qh = /* @__PURE__ */ f({
  name: "RemoveFilled",
  __name: "remove-filled",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M512 64a448 448 0 1 1 0 896 448 448 0 0 1 0-896M288 512a38.4 38.4 0 0 0 38.4 38.4h371.2a38.4 38.4 0 0 0 0-76.8H326.4A38.4 38.4 0 0 0 288 512"
      })
    ]));
  }
}), Yh = Qh, Zh = /* @__PURE__ */ f({
  name: "Remove",
  __name: "remove",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M352 480h320a32 32 0 1 1 0 64H352a32 32 0 0 1 0-64"
      }),
      c("path", {
        fill: "currentColor",
        d: "M512 896a384 384 0 1 0 0-768 384 384 0 0 0 0 768m0 64a448 448 0 1 1 0-896 448 448 0 0 1 0 896"
      })
    ]));
  }
}), Kh = Zh, Xh = /* @__PURE__ */ f({
  name: "Right",
  __name: "right",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M754.752 480H160a32 32 0 1 0 0 64h594.752L521.344 777.344a32 32 0 0 0 45.312 45.312l288-288a32 32 0 0 0 0-45.312l-288-288a32 32 0 1 0-45.312 45.312z"
      })
    ]));
  }
}), Jh = Xh, ef = /* @__PURE__ */ f({
  name: "ScaleToOriginal",
  __name: "scale-to-original",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M813.176 180.706a60.235 60.235 0 0 1 60.236 60.235v481.883a60.235 60.235 0 0 1-60.236 60.235H210.824a60.235 60.235 0 0 1-60.236-60.235V240.94a60.235 60.235 0 0 1 60.236-60.235h602.352zm0-60.235H210.824A120.47 120.47 0 0 0 90.353 240.94v481.883a120.47 120.47 0 0 0 120.47 120.47h602.353a120.47 120.47 0 0 0 120.471-120.47V240.94a120.47 120.47 0 0 0-120.47-120.47zm-120.47 180.705a30.12 30.12 0 0 0-30.118 30.118v301.177a30.118 30.118 0 0 0 60.236 0V331.294a30.12 30.12 0 0 0-30.118-30.118m-361.412 0a30.12 30.12 0 0 0-30.118 30.118v301.177a30.118 30.118 0 1 0 60.236 0V331.294a30.12 30.12 0 0 0-30.118-30.118M512 361.412a30.12 30.12 0 0 0-30.118 30.117v30.118a30.118 30.118 0 0 0 60.236 0V391.53A30.12 30.12 0 0 0 512 361.412M512 512a30.12 30.12 0 0 0-30.118 30.118v30.117a30.118 30.118 0 0 0 60.236 0v-30.117A30.12 30.12 0 0 0 512 512"
      })
    ]));
  }
}), tf = ef, nf = /* @__PURE__ */ f({
  name: "School",
  __name: "school",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M224 128v704h576V128zm-32-64h640a32 32 0 0 1 32 32v768a32 32 0 0 1-32 32H192a32 32 0 0 1-32-32V96a32 32 0 0 1 32-32"
      }),
      c("path", {
        fill: "currentColor",
        d: "M64 832h896v64H64zm256-640h128v96H320z"
      }),
      c("path", {
        fill: "currentColor",
        d: "M384 832h256v-64a128 128 0 1 0-256 0zm128-256a192 192 0 0 1 192 192v128H320V768a192 192 0 0 1 192-192M320 384h128v96H320zm256-192h128v96H576zm0 192h128v96H576z"
      })
    ]));
  }
}), af = nf, rf = /* @__PURE__ */ f({
  name: "Scissor",
  __name: "scissor",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "m512.064 578.368-106.88 152.768a160 160 0 1 1-23.36-78.208L472.96 522.56 196.864 128.256a32 32 0 1 1 52.48-36.736l393.024 561.344a160 160 0 1 1-23.36 78.208l-106.88-152.704zm54.4-189.248 208.384-297.6a32 32 0 0 1 52.48 36.736l-221.76 316.672-39.04-55.808zm-376.32 425.856a96 96 0 1 0 110.144-157.248 96 96 0 0 0-110.08 157.248zm643.84 0a96 96 0 1 0-110.08-157.248 96 96 0 0 0 110.08 157.248"
      })
    ]));
  }
}), of = rf, lf = /* @__PURE__ */ f({
  name: "Search",
  __name: "search",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "m795.904 750.72 124.992 124.928a32 32 0 0 1-45.248 45.248L750.656 795.904a416 416 0 1 1 45.248-45.248zM480 832a352 352 0 1 0 0-704 352 352 0 0 0 0 704"
      })
    ]));
  }
}), sf = lf, cf = /* @__PURE__ */ f({
  name: "Select",
  __name: "select",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M77.248 415.04a64 64 0 0 1 90.496 0l226.304 226.304L846.528 188.8a64 64 0 1 1 90.56 90.496l-543.04 543.04-316.8-316.8a64 64 0 0 1 0-90.496"
      })
    ]));
  }
}), df = cf, uf = /* @__PURE__ */ f({
  name: "Sell",
  __name: "sell",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M704 288h131.072a32 32 0 0 1 31.808 28.8L886.4 512h-64.384l-16-160H704v96a32 32 0 1 1-64 0v-96H384v96a32 32 0 0 1-64 0v-96H217.92l-51.2 512H512v64H131.328a32 32 0 0 1-31.808-35.2l57.6-576a32 32 0 0 1 31.808-28.8H320v-22.336C320 154.688 405.504 64 512 64s192 90.688 192 201.664v22.4zm-64 0v-22.336C640 189.248 582.272 128 512 128s-128 61.248-128 137.664v22.4h256zm201.408 483.84L768 698.496V928a32 32 0 1 1-64 0V698.496l-73.344 73.344a32 32 0 1 1-45.248-45.248l128-128a32 32 0 0 1 45.248 0l128 128a32 32 0 1 1-45.248 45.248"
      })
    ]));
  }
}), mf = uf, hf = /* @__PURE__ */ f({
  name: "SemiSelect",
  __name: "semi-select",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M128 448h768q64 0 64 64t-64 64H128q-64 0-64-64t64-64"
      })
    ]));
  }
}), ff = hf, pf = /* @__PURE__ */ f({
  name: "Service",
  __name: "service",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M864 409.6a192 192 0 0 1-37.888 349.44A256.064 256.064 0 0 1 576 960h-96a32 32 0 1 1 0-64h96a192.06 192.06 0 0 0 181.12-128H736a32 32 0 0 1-32-32V416a32 32 0 0 1 32-32h32c10.368 0 20.544.832 30.528 2.432a288 288 0 0 0-573.056 0A193 193 0 0 1 256 384h32a32 32 0 0 1 32 32v320a32 32 0 0 1-32 32h-32a192 192 0 0 1-96-358.4 352 352 0 0 1 704 0M256 448a128 128 0 1 0 0 256zm640 128a128 128 0 0 0-128-128v256a128 128 0 0 0 128-128"
      })
    ]));
  }
}), gf = pf, vf = /* @__PURE__ */ f({
  name: "SetUp",
  __name: "set-up",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M224 160a64 64 0 0 0-64 64v576a64 64 0 0 0 64 64h576a64 64 0 0 0 64-64V224a64 64 0 0 0-64-64zm0-64h576a128 128 0 0 1 128 128v576a128 128 0 0 1-128 128H224A128 128 0 0 1 96 800V224A128 128 0 0 1 224 96"
      }),
      c("path", {
        fill: "currentColor",
        d: "M384 416a64 64 0 1 0 0-128 64 64 0 0 0 0 128m0 64a128 128 0 1 1 0-256 128 128 0 0 1 0 256"
      }),
      c("path", {
        fill: "currentColor",
        d: "M480 320h256q32 0 32 32t-32 32H480q-32 0-32-32t32-32m160 416a64 64 0 1 0 0-128 64 64 0 0 0 0 128m0 64a128 128 0 1 1 0-256 128 128 0 0 1 0 256"
      }),
      c("path", {
        fill: "currentColor",
        d: "M288 640h256q32 0 32 32t-32 32H288q-32 0-32-32t32-32"
      })
    ]));
  }
}), _f = vf, wf = /* @__PURE__ */ f({
  name: "Setting",
  __name: "setting",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M600.704 64a32 32 0 0 1 30.464 22.208l35.2 109.376c14.784 7.232 28.928 15.36 42.432 24.512l112.384-24.192a32 32 0 0 1 34.432 15.36L944.32 364.8a32 32 0 0 1-4.032 37.504l-77.12 85.12a357 357 0 0 1 0 49.024l77.12 85.248a32 32 0 0 1 4.032 37.504l-88.704 153.6a32 32 0 0 1-34.432 15.296L708.8 803.904c-13.44 9.088-27.648 17.28-42.368 24.512l-35.264 109.376A32 32 0 0 1 600.704 960H423.296a32 32 0 0 1-30.464-22.208L357.696 828.48a352 352 0 0 1-42.56-24.64l-112.32 24.256a32 32 0 0 1-34.432-15.36L79.68 659.2a32 32 0 0 1 4.032-37.504l77.12-85.248a357 357 0 0 1 0-48.896l-77.12-85.248A32 32 0 0 1 79.68 364.8l88.704-153.6a32 32 0 0 1 34.432-15.296l112.32 24.256c13.568-9.152 27.776-17.408 42.56-24.64l35.2-109.312A32 32 0 0 1 423.232 64H600.64zm-23.424 64H446.72l-36.352 113.088-24.512 11.968a294 294 0 0 0-34.816 20.096l-22.656 15.36-116.224-25.088-65.28 113.152 79.68 88.192-1.92 27.136a293 293 0 0 0 0 40.192l1.92 27.136-79.808 88.192 65.344 113.152 116.224-25.024 22.656 15.296a294 294 0 0 0 34.816 20.096l24.512 11.968L446.72 896h130.688l36.48-113.152 24.448-11.904a288 288 0 0 0 34.752-20.096l22.592-15.296 116.288 25.024 65.28-113.152-79.744-88.192 1.92-27.136a293 293 0 0 0 0-40.256l-1.92-27.136 79.808-88.128-65.344-113.152-116.288 24.96-22.592-15.232a288 288 0 0 0-34.752-20.096l-24.448-11.904L577.344 128zM512 320a192 192 0 1 1 0 384 192 192 0 0 1 0-384m0 64a128 128 0 1 0 0 256 128 128 0 0 0 0-256"
      })
    ]));
  }
}), yf = wf, bf = /* @__PURE__ */ f({
  name: "Share",
  __name: "share",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "m679.872 348.8-301.76 188.608a127.8 127.8 0 0 1 5.12 52.16l279.936 104.96a128 128 0 1 1-22.464 59.904l-279.872-104.96a128 128 0 1 1-16.64-166.272l301.696-188.608a128 128 0 1 1 33.92 54.272z"
      })
    ]));
  }
}), Cf = bf, Af = /* @__PURE__ */ f({
  name: "Ship",
  __name: "ship",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M512 386.88V448h405.568a32 32 0 0 1 30.72 40.768l-76.48 267.968A192 192 0 0 1 687.168 896H336.832a192 192 0 0 1-184.64-139.264L75.648 488.768A32 32 0 0 1 106.368 448H448V117.888a32 32 0 0 1 47.36-28.096l13.888 7.616L512 96v2.88l231.68 126.4a32 32 0 0 1-2.048 57.216zm0-70.272 144.768-65.792L512 171.84zM512 512H148.864l18.24 64H856.96l18.24-64zM185.408 640l28.352 99.2A128 128 0 0 0 336.832 832h350.336a128 128 0 0 0 123.072-92.8l28.352-99.2z"
      })
    ]));
  }
}), xf = Af, Ef = /* @__PURE__ */ f({
  name: "Shop",
  __name: "shop",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M704 704h64v192H256V704h64v64h384zm188.544-152.192C894.528 559.616 896 567.616 896 576a96 96 0 1 1-192 0 96 96 0 1 1-192 0 96 96 0 1 1-192 0 96 96 0 1 1-192 0c0-8.384 1.408-16.384 3.392-24.192L192 128h640z"
      })
    ]));
  }
}), Sf = Ef, Mf = /* @__PURE__ */ f({
  name: "ShoppingBag",
  __name: "shopping-bag",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M704 320v96a32 32 0 0 1-32 32h-32V320H384v128h-32a32 32 0 0 1-32-32v-96H192v576h640V320zm-384-64a192 192 0 1 1 384 0h160a32 32 0 0 1 32 32v640a32 32 0 0 1-32 32H160a32 32 0 0 1-32-32V288a32 32 0 0 1 32-32zm64 0h256a128 128 0 1 0-256 0"
      }),
      c("path", {
        fill: "currentColor",
        d: "M192 704h640v64H192z"
      })
    ]));
  }
}), Df = Mf, Tf = /* @__PURE__ */ f({
  name: "ShoppingCartFull",
  __name: "shopping-cart-full",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M432 928a48 48 0 1 1 0-96 48 48 0 0 1 0 96m320 0a48 48 0 1 1 0-96 48 48 0 0 1 0 96M96 128a32 32 0 0 1 0-64h160a32 32 0 0 1 31.36 25.728L320.64 256H928a32 32 0 0 1 31.296 38.72l-96 448A32 32 0 0 1 832 768H384a32 32 0 0 1-31.36-25.728L229.76 128zm314.24 576h395.904l82.304-384H333.44z"
      }),
      c("path", {
        fill: "currentColor",
        d: "M699.648 256 608 145.984 516.352 256zm-140.8-151.04a64 64 0 0 1 98.304 0L836.352 320H379.648z"
      })
    ]));
  }
}), Rf = Tf, Hf = /* @__PURE__ */ f({
  name: "ShoppingCart",
  __name: "shopping-cart",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M432 928a48 48 0 1 1 0-96 48 48 0 0 1 0 96m320 0a48 48 0 1 1 0-96 48 48 0 0 1 0 96M96 128a32 32 0 0 1 0-64h160a32 32 0 0 1 31.36 25.728L320.64 256H928a32 32 0 0 1 31.296 38.72l-96 448A32 32 0 0 1 832 768H384a32 32 0 0 1-31.36-25.728L229.76 128zm314.24 576h395.904l82.304-384H333.44z"
      })
    ]));
  }
}), If = Hf, kf = /* @__PURE__ */ f({
  name: "ShoppingTrolley",
  __name: "shopping-trolley",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      "xml:space": "preserve",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M368 833c-13.3 0-24.5 4.5-33.5 13.5S321 866.7 321 880s4.5 24.5 13.5 33.5 20.2 13.8 33.5 14.5c13.3-.7 24.5-5.5 33.5-14.5S415 893.3 415 880s-4.5-24.5-13.5-33.5S381.3 833 368 833m439-193c7.4 0 13.8-2.2 19.5-6.5S836 623.3 838 616l112-448c2-10-.2-19.2-6.5-27.5S929 128 919 128H96c-9.3 0-17 3-23 9s-9 13.7-9 23 3 17 9 23 13.7 9 23 9h96v576h672c9.3 0 17-3 23-9s9-13.7 9-23-3-17-9-23-13.7-9-23-9H256v-64zM256 192h622l-96 384H256zm432 641c-13.3 0-24.5 4.5-33.5 13.5S641 866.7 641 880s4.5 24.5 13.5 33.5 20.2 13.8 33.5 14.5c13.3-.7 24.5-5.5 33.5-14.5S735 893.3 735 880s-4.5-24.5-13.5-33.5S701.3 833 688 833"
      })
    ]));
  }
}), zf = kf, Vf = /* @__PURE__ */ f({
  name: "Smoking",
  __name: "smoking",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M256 576v128h640V576zm-32-64h704a32 32 0 0 1 32 32v192a32 32 0 0 1-32 32H224a32 32 0 0 1-32-32V544a32 32 0 0 1 32-32"
      }),
      c("path", {
        fill: "currentColor",
        d: "M704 576h64v128h-64zM256 64h64v320h-64zM128 192h64v192h-64zM64 512h64v256H64z"
      })
    ]));
  }
}), Of = Vf, Bf = /* @__PURE__ */ f({
  name: "Soccer",
  __name: "soccer",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M418.496 871.04 152.256 604.8c-16.512 94.016-2.368 178.624 42.944 224 44.928 44.928 129.344 58.752 223.296 42.24m72.32-18.176a573.06 573.06 0 0 0 224.832-137.216 573.1 573.1 0 0 0 137.216-224.832L533.888 171.84a578.56 578.56 0 0 0-227.52 138.496A567.7 567.7 0 0 0 170.432 532.48zM871.04 418.496c16.512-93.952 2.688-178.368-42.24-223.296-44.544-44.544-128.704-58.048-222.592-41.536zM149.952 874.048c-112.96-112.96-88.832-408.96 111.168-608.96C461.056 65.152 760.96 36.928 874.048 149.952c113.024 113.024 86.784 411.008-113.152 610.944s-497.92 226.112-610.944 113.152m452.544-497.792 22.656-22.656a32 32 0 0 1 45.248 45.248l-22.656 22.656 45.248 45.248A32 32 0 1 1 647.744 512l-45.248-45.248L557.248 512l45.248 45.248a32 32 0 1 1-45.248 45.248L512 557.248l-45.248 45.248L512 647.744a32 32 0 1 1-45.248 45.248l-45.248-45.248-22.656 22.656a32 32 0 1 1-45.248-45.248l22.656-22.656-45.248-45.248A32 32 0 1 1 376.256 512l45.248 45.248L466.752 512l-45.248-45.248a32 32 0 1 1 45.248-45.248L512 466.752l45.248-45.248L512 376.256a32 32 0 0 1 45.248-45.248z"
      })
    ]));
  }
}), Lf = Bf, Nf = /* @__PURE__ */ f({
  name: "SoldOut",
  __name: "sold-out",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M704 288h131.072a32 32 0 0 1 31.808 28.8L886.4 512h-64.384l-16-160H704v96a32 32 0 1 1-64 0v-96H384v96a32 32 0 0 1-64 0v-96H217.92l-51.2 512H512v64H131.328a32 32 0 0 1-31.808-35.2l57.6-576a32 32 0 0 1 31.808-28.8H320v-22.336C320 154.688 405.504 64 512 64s192 90.688 192 201.664v22.4zm-64 0v-22.336C640 189.248 582.272 128 512 128s-128 61.248-128 137.664v22.4h256zm201.408 476.16a32 32 0 1 1 45.248 45.184l-128 128a32 32 0 0 1-45.248 0l-128-128a32 32 0 1 1 45.248-45.248L704 837.504V608a32 32 0 1 1 64 0v229.504l73.408-73.408z"
      })
    ]));
  }
}), Pf = Nf, jf = /* @__PURE__ */ f({
  name: "SortDown",
  __name: "sort-down",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M576 96v709.568L333.312 562.816A32 32 0 1 0 288 608l297.408 297.344A32 32 0 0 0 640 882.688V96a32 32 0 0 0-64 0"
      })
    ]));
  }
}), qf = jf, Ff = /* @__PURE__ */ f({
  name: "SortUp",
  __name: "sort-up",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M384 141.248V928a32 32 0 1 0 64 0V218.56l242.688 242.688A32 32 0 1 0 736 416L438.592 118.656A32 32 0 0 0 384 141.248"
      })
    ]));
  }
}), Uf = Ff, Wf = /* @__PURE__ */ f({
  name: "Sort",
  __name: "sort",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M384 96a32 32 0 0 1 64 0v786.752a32 32 0 0 1-54.592 22.656L95.936 608a32 32 0 0 1 0-45.312h.128a32 32 0 0 1 45.184 0L384 805.632zm192 45.248a32 32 0 0 1 54.592-22.592L928.064 416a32 32 0 0 1 0 45.312h-.128a32 32 0 0 1-45.184 0L640 218.496V928a32 32 0 1 1-64 0z"
      })
    ]));
  }
}), Gf = Wf, $f = /* @__PURE__ */ f({
  name: "Stamp",
  __name: "stamp",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M624 475.968V640h144a128 128 0 0 1 128 128H128a128 128 0 0 1 128-128h144V475.968a192 192 0 1 1 224 0M128 896v-64h768v64z"
      })
    ]));
  }
}), Qf = $f, Yf = /* @__PURE__ */ f({
  name: "StarFilled",
  __name: "star-filled",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M313.6 924.48a70.4 70.4 0 0 1-74.152-5.365 70.4 70.4 0 0 1-27.992-68.875l37.888-220.928L88.96 472.96a70.4 70.4 0 0 1 3.788-104.225A70.4 70.4 0 0 1 128 352.896l221.76-32.256 99.2-200.96a70.4 70.4 0 0 1 100.246-28.595 70.4 70.4 0 0 1 25.962 28.595l99.2 200.96 221.824 32.256a70.4 70.4 0 0 1 39.04 120.064L774.72 629.376l37.888 220.928a70.4 70.4 0 0 1-102.144 74.24L512 820.096l-198.4 104.32z"
      })
    ]));
  }
}), Zf = Yf, Kf = /* @__PURE__ */ f({
  name: "Star",
  __name: "star",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "m512 747.84 228.16 119.936a6.4 6.4 0 0 0 9.28-6.72l-43.52-254.08 184.512-179.904a6.4 6.4 0 0 0-3.52-10.88l-255.104-37.12L517.76 147.904a6.4 6.4 0 0 0-11.52 0L392.192 379.072l-255.104 37.12a6.4 6.4 0 0 0-3.52 10.88L318.08 606.976l-43.584 254.08a6.4 6.4 0 0 0 9.28 6.72zM313.6 924.48a70.4 70.4 0 0 1-102.144-74.24l37.888-220.928L88.96 472.96A70.4 70.4 0 0 1 128 352.896l221.76-32.256 99.2-200.96a70.4 70.4 0 0 1 126.208 0l99.2 200.96 221.824 32.256a70.4 70.4 0 0 1 39.04 120.064L774.72 629.376l37.888 220.928a70.4 70.4 0 0 1-102.144 74.24L512 820.096l-198.4 104.32z"
      })
    ]));
  }
}), Xf = Kf, Jf = /* @__PURE__ */ f({
  name: "Stopwatch",
  __name: "stopwatch",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M512 896a384 384 0 1 0 0-768 384 384 0 0 0 0 768m0 64a448 448 0 1 1 0-896 448 448 0 0 1 0 896"
      }),
      c("path", {
        fill: "currentColor",
        d: "M672 234.88c-39.168 174.464-80 298.624-122.688 372.48-64 110.848-202.624 30.848-138.624-80C453.376 453.44 540.48 355.968 672 234.816z"
      })
    ]));
  }
}), e5 = Jf, t5 = /* @__PURE__ */ f({
  name: "SuccessFilled",
  __name: "success-filled",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M512 64a448 448 0 1 1 0 896 448 448 0 0 1 0-896m-55.808 536.384-99.52-99.584a38.4 38.4 0 1 0-54.336 54.336l126.72 126.72a38.27 38.27 0 0 0 54.336 0l262.4-262.464a38.4 38.4 0 1 0-54.272-54.336z"
      })
    ]));
  }
}), Ql = t5, n5 = /* @__PURE__ */ f({
  name: "Sugar",
  __name: "sugar",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "m801.728 349.184 4.48 4.48a128 128 0 0 1 0 180.992L534.656 806.144a128 128 0 0 1-181.056 0l-4.48-4.48-19.392 109.696a64 64 0 0 1-108.288 34.176L78.464 802.56a64 64 0 0 1 34.176-108.288l109.76-19.328-4.544-4.544a128 128 0 0 1 0-181.056l271.488-271.488a128 128 0 0 1 181.056 0l4.48 4.48 19.392-109.504a64 64 0 0 1 108.352-34.048l142.592 143.04a64 64 0 0 1-34.24 108.16zm-548.8 198.72h447.168v2.24l60.8-60.8a63.8 63.8 0 0 0 18.752-44.416h-426.88l-89.664 89.728a64 64 0 0 0-10.24 13.248zm0 64q4.128 7.104 10.176 13.248l135.744 135.744a64 64 0 0 0 90.496 0L638.4 611.904zm490.048-230.976L625.152 263.104a64 64 0 0 0-90.496 0L416.768 380.928zM123.712 757.312l142.976 142.976 24.32-137.6a25.6 25.6 0 0 0-29.696-29.632zm633.6-633.344-24.32 137.472a25.6 25.6 0 0 0 29.632 29.632l137.28-24.064-142.656-143.04z"
      })
    ]));
  }
}), a5 = n5, r5 = /* @__PURE__ */ f({
  name: "SuitcaseLine",
  __name: "suitcase-line",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      "xml:space": "preserve",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M922.5 229.5c-24.32-24.34-54.49-36.84-90.5-37.5H704v-64c-.68-17.98-7.02-32.98-19.01-44.99S658.01 64.66 640 64H384c-17.98.68-32.98 7.02-44.99 19.01S320.66 110 320 128v64H192c-35.99.68-66.16 13.18-90.5 37.5S64.66 283.99 64 320v448c.68 35.99 13.18 66.16 37.5 90.5s54.49 36.84 90.5 37.5h640c35.99-.68 66.16-13.18 90.5-37.5s36.84-54.49 37.5-90.5V320c-.68-35.99-13.18-66.16-37.5-90.5M384 128h256v64H384zM256 832h-64c-17.98-.68-32.98-7.02-44.99-19.01S128.66 786.01 128 768V448h128zm448 0H320V448h384zm192-64c-.68 17.98-7.02 32.98-19.01 44.99S850.01 831.34 832 832h-64V448h128zm0-384H128v-64c.69-17.98 7.02-32.98 19.01-44.99S173.99 256.66 192 256h640c17.98.69 32.98 7.02 44.99 19.01S895.34 301.99 896 320z"
      })
    ]));
  }
}), o5 = r5, i5 = /* @__PURE__ */ f({
  name: "Suitcase",
  __name: "suitcase",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M128 384h768v-64a64 64 0 0 0-64-64H192a64 64 0 0 0-64 64zm0 64v320a64 64 0 0 0 64 64h640a64 64 0 0 0 64-64V448zm64-256h640a128 128 0 0 1 128 128v448a128 128 0 0 1-128 128H192A128 128 0 0 1 64 768V320a128 128 0 0 1 128-128"
      }),
      c("path", {
        fill: "currentColor",
        d: "M384 128v64h256v-64zm0-64h256a64 64 0 0 1 64 64v64a64 64 0 0 1-64 64H384a64 64 0 0 1-64-64v-64a64 64 0 0 1 64-64"
      })
    ]));
  }
}), l5 = i5, s5 = /* @__PURE__ */ f({
  name: "Sunny",
  __name: "sunny",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M512 704a192 192 0 1 0 0-384 192 192 0 0 0 0 384m0 64a256 256 0 1 1 0-512 256 256 0 0 1 0 512m0-704a32 32 0 0 1 32 32v64a32 32 0 0 1-64 0V96a32 32 0 0 1 32-32m0 768a32 32 0 0 1 32 32v64a32 32 0 1 1-64 0v-64a32 32 0 0 1 32-32M195.2 195.2a32 32 0 0 1 45.248 0l45.248 45.248a32 32 0 1 1-45.248 45.248L195.2 240.448a32 32 0 0 1 0-45.248m543.104 543.104a32 32 0 0 1 45.248 0l45.248 45.248a32 32 0 0 1-45.248 45.248l-45.248-45.248a32 32 0 0 1 0-45.248M64 512a32 32 0 0 1 32-32h64a32 32 0 0 1 0 64H96a32 32 0 0 1-32-32m768 0a32 32 0 0 1 32-32h64a32 32 0 1 1 0 64h-64a32 32 0 0 1-32-32M195.2 828.8a32 32 0 0 1 0-45.248l45.248-45.248a32 32 0 0 1 45.248 45.248L240.448 828.8a32 32 0 0 1-45.248 0m543.104-543.104a32 32 0 0 1 0-45.248l45.248-45.248a32 32 0 0 1 45.248 45.248l-45.248 45.248a32 32 0 0 1-45.248 0"
      })
    ]));
  }
}), c5 = s5, d5 = /* @__PURE__ */ f({
  name: "Sunrise",
  __name: "sunrise",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M32 768h960a32 32 0 1 1 0 64H32a32 32 0 1 1 0-64m129.408-96a352 352 0 0 1 701.184 0h-64.32a288 288 0 0 0-572.544 0zM512 128a32 32 0 0 1 32 32v96a32 32 0 0 1-64 0v-96a32 32 0 0 1 32-32m407.296 168.704a32 32 0 0 1 0 45.248l-67.84 67.84a32 32 0 1 1-45.248-45.248l67.84-67.84a32 32 0 0 1 45.248 0m-814.592 0a32 32 0 0 1 45.248 0l67.84 67.84a32 32 0 1 1-45.248 45.248l-67.84-67.84a32 32 0 0 1 0-45.248"
      })
    ]));
  }
}), u5 = d5, m5 = /* @__PURE__ */ f({
  name: "Sunset",
  __name: "sunset",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M82.56 640a448 448 0 1 1 858.88 0h-67.2a384 384 0 1 0-724.288 0zM32 704h960q32 0 32 32t-32 32H32q-32 0-32-32t32-32m256 128h448q32 0 32 32t-32 32H288q-32 0-32-32t32-32"
      })
    ]));
  }
}), h5 = m5, f5 = /* @__PURE__ */ f({
  name: "SwitchButton",
  __name: "switch-button",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M352 159.872V230.4a352 352 0 1 0 320 0v-70.528A416.128 416.128 0 0 1 512 960a416 416 0 0 1-160-800.128"
      }),
      c("path", {
        fill: "currentColor",
        d: "M512 64q32 0 32 32v320q0 32-32 32t-32-32V96q0-32 32-32"
      })
    ]));
  }
}), p5 = f5, g5 = /* @__PURE__ */ f({
  name: "SwitchFilled",
  __name: "switch-filled",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      "xml:space": "preserve",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M247.47 358.4v.04c.07 19.17 7.72 37.53 21.27 51.09s31.92 21.2 51.09 21.27c39.86 0 72.41-32.6 72.41-72.4s-32.6-72.36-72.41-72.36-72.36 32.55-72.36 72.36"
      }),
      c("path", {
        fill: "currentColor",
        d: "M492.38 128H324.7c-52.16 0-102.19 20.73-139.08 57.61a196.66 196.66 0 0 0-57.61 139.08V698.7c-.01 25.84 5.08 51.42 14.96 75.29s24.36 45.56 42.63 63.83 39.95 32.76 63.82 42.65a196.7 196.7 0 0 0 75.28 14.98h167.68c3.03 0 5.46-2.43 5.46-5.42V133.42c.6-2.99-1.83-5.42-5.46-5.42m-56.11 705.88H324.7c-17.76.13-35.36-3.33-51.75-10.18s-31.22-16.94-43.61-29.67c-25.3-25.35-39.81-59.1-39.81-95.32V324.69c-.13-17.75 3.33-35.35 10.17-51.74a131.7 131.7 0 0 1 29.64-43.62c25.39-25.3 59.14-39.81 95.36-39.81h111.57zm402.12-647.67a196.66 196.66 0 0 0-139.08-57.61H580.48c-3.03 0-4.82 2.43-4.82 4.82v757.16c-.6 2.99 1.79 5.42 5.42 5.42h118.23a196.7 196.7 0 0 0 139.08-57.61A196.66 196.66 0 0 0 896 699.31V325.29a196.7 196.7 0 0 0-57.61-139.08m-111.3 441.92c-42.83 0-77.82-34.99-77.82-77.82s34.98-77.82 77.82-77.82c42.83 0 77.82 34.99 77.82 77.82s-34.99 77.82-77.82 77.82"
      })
    ]));
  }
}), v5 = g5, _5 = /* @__PURE__ */ f({
  name: "Switch",
  __name: "switch",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M118.656 438.656a32 32 0 0 1 0-45.248L416 96l4.48-3.776A32 32 0 0 1 461.248 96l3.712 4.48a32.064 32.064 0 0 1-3.712 40.832L218.56 384H928a32 32 0 1 1 0 64H141.248a32 32 0 0 1-22.592-9.344M64 608a32 32 0 0 1 32-32h786.752a32 32 0 0 1 22.656 54.592L608 928l-4.48 3.776a32.064 32.064 0 0 1-40.832-49.024L805.632 640H96a32 32 0 0 1-32-32"
      })
    ]));
  }
}), w5 = _5, y5 = /* @__PURE__ */ f({
  name: "TakeawayBox",
  __name: "takeaway-box",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M832 384H192v448h640zM96 320h832V128H96zm800 64v480a32 32 0 0 1-32 32H160a32 32 0 0 1-32-32V384H64a32 32 0 0 1-32-32V96a32 32 0 0 1 32-32h896a32 32 0 0 1 32 32v256a32 32 0 0 1-32 32zM416 512h192a32 32 0 0 1 0 64H416a32 32 0 0 1 0-64"
      })
    ]));
  }
}), b5 = y5, C5 = /* @__PURE__ */ f({
  name: "Ticket",
  __name: "ticket",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M640 832H64V640a128 128 0 1 0 0-256V192h576v160h64V192h256v192a128 128 0 1 0 0 256v192H704V672h-64zm0-416v192h64V416z"
      })
    ]));
  }
}), A5 = C5, x5 = /* @__PURE__ */ f({
  name: "Tickets",
  __name: "tickets",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M192 128v768h640V128zm-32-64h704a32 32 0 0 1 32 32v832a32 32 0 0 1-32 32H160a32 32 0 0 1-32-32V96a32 32 0 0 1 32-32m160 448h384v64H320zm0-192h192v64H320zm0 384h384v64H320z"
      })
    ]));
  }
}), E5 = x5, S5 = /* @__PURE__ */ f({
  name: "Timer",
  __name: "timer",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M512 896a320 320 0 1 0 0-640 320 320 0 0 0 0 640m0 64a384 384 0 1 1 0-768 384 384 0 0 1 0 768"
      }),
      c("path", {
        fill: "currentColor",
        d: "M512 320a32 32 0 0 1 32 32l-.512 224a32 32 0 1 1-64 0L480 352a32 32 0 0 1 32-32"
      }),
      c("path", {
        fill: "currentColor",
        d: "M448 576a64 64 0 1 0 128 0 64 64 0 1 0-128 0m96-448v128h-64V128h-96a32 32 0 0 1 0-64h256a32 32 0 1 1 0 64z"
      })
    ]));
  }
}), M5 = S5, D5 = /* @__PURE__ */ f({
  name: "ToiletPaper",
  __name: "toilet-paper",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M595.2 128H320a192 192 0 0 0-192 192v576h384V352c0-90.496 32.448-171.2 83.2-224M736 64c123.712 0 224 128.96 224 288S859.712 640 736 640H576v320H64V320A256 256 0 0 1 320 64zM576 352v224h160c84.352 0 160-97.28 160-224s-75.648-224-160-224-160 97.28-160 224"
      }),
      c("path", {
        fill: "currentColor",
        d: "M736 448c-35.328 0-64-43.008-64-96s28.672-96 64-96 64 43.008 64 96-28.672 96-64 96"
      })
    ]));
  }
}), T5 = D5, R5 = /* @__PURE__ */ f({
  name: "Tools",
  __name: "tools",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M764.416 254.72a351.7 351.7 0 0 1 86.336 149.184H960v192.064H850.752a351.7 351.7 0 0 1-86.336 149.312l54.72 94.72-166.272 96-54.592-94.72a352.64 352.64 0 0 1-172.48 0L371.136 936l-166.272-96 54.72-94.72a351.7 351.7 0 0 1-86.336-149.312H64v-192h109.248a351.7 351.7 0 0 1 86.336-149.312L204.8 160l166.208-96h.192l54.656 94.592a352.64 352.64 0 0 1 172.48 0L652.8 64h.128L819.2 160l-54.72 94.72zM704 499.968a192 192 0 1 0-384 0 192 192 0 0 0 384 0"
      })
    ]));
  }
}), H5 = R5, I5 = /* @__PURE__ */ f({
  name: "TopLeft",
  __name: "top-left",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M256 256h416a32 32 0 1 0 0-64H224a32 32 0 0 0-32 32v448a32 32 0 0 0 64 0z"
      }),
      c("path", {
        fill: "currentColor",
        d: "M246.656 201.344a32 32 0 0 0-45.312 45.312l544 544a32 32 0 0 0 45.312-45.312z"
      })
    ]));
  }
}), k5 = I5, z5 = /* @__PURE__ */ f({
  name: "TopRight",
  __name: "top-right",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M768 256H353.6a32 32 0 1 1 0-64H800a32 32 0 0 1 32 32v448a32 32 0 0 1-64 0z"
      }),
      c("path", {
        fill: "currentColor",
        d: "M777.344 201.344a32 32 0 0 1 45.312 45.312l-544 544a32 32 0 0 1-45.312-45.312z"
      })
    ]));
  }
}), V5 = z5, O5 = /* @__PURE__ */ f({
  name: "Top",
  __name: "top",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M572.235 205.282v600.365a30.118 30.118 0 1 1-60.235 0V205.282L292.382 438.633a28.913 28.913 0 0 1-42.646 0 33.43 33.43 0 0 1 0-45.236l271.058-288.045a28.913 28.913 0 0 1 42.647 0L834.5 393.397a33.43 33.43 0 0 1 0 45.176 28.913 28.913 0 0 1-42.647 0l-219.618-233.23z"
      })
    ]));
  }
}), B5 = O5, L5 = /* @__PURE__ */ f({
  name: "TrendCharts",
  __name: "trend-charts",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M128 896V128h768v768zm291.712-327.296 128 102.4 180.16-201.792-47.744-42.624-139.84 156.608-128-102.4-180.16 201.792 47.744 42.624zM816 352a48 48 0 1 0-96 0 48 48 0 0 0 96 0"
      })
    ]));
  }
}), N5 = L5, P5 = /* @__PURE__ */ f({
  name: "TrophyBase",
  __name: "trophy-base",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      "xml:space": "preserve",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M918.4 201.6c-6.4-6.4-12.8-9.6-22.4-9.6H768V96c0-9.6-3.2-16-9.6-22.4S745.6 64 736 64H288c-9.6 0-16 3.2-22.4 9.6S256 86.4 256 96v96H128c-9.6 0-16 3.2-22.4 9.6S96 217.6 96 224c3.2 108.8 25.6 185.6 64 224 34.4 34.4 77.56 55.65 127.65 61.99 10.91 20.44 24.78 39.25 41.95 56.41 40.86 40.86 91 65.47 150.4 71.9V768h-96c-9.6 0-16 3.2-22.4 9.6S352 790.4 352 800s3.2 16 9.6 22.4 12.8 9.6 22.4 9.6h256c9.6 0 16-3.2 22.4-9.6s9.6-12.8 9.6-22.4-3.2-16-9.6-22.4-12.8-9.6-22.4-9.6h-96V637.26c59.4-7.71 109.54-30.01 150.4-70.86 17.2-17.2 31.51-36.06 42.81-56.55 48.93-6.51 90.02-27.7 126.79-61.85 38.4-38.4 60.8-112 64-224 0-6.4-3.2-16-9.6-22.4M256 438.4c-19.2-6.4-35.2-19.2-51.2-35.2-22.4-22.4-35.2-70.4-41.6-147.2H256zm390.4 80C608 553.6 566.4 576 512 576s-99.2-19.2-134.4-57.6S320 438.4 320 384V128h384v256q0 81.6-57.6 134.4m172.8-115.2c-16 16-32 25.6-51.2 35.2V256h92.8c-6.4 76.8-19.2 124.8-41.6 147.2M768 896H256c-9.6 0-16 3.2-22.4 9.6S224 918.4 224 928s3.2 16 9.6 22.4 12.8 9.6 22.4 9.6h512c9.6 0 16-3.2 22.4-9.6s9.6-12.8 9.6-22.4-3.2-16-9.6-22.4-12.8-9.6-22.4-9.6"
      })
    ]));
  }
}), j5 = P5, q5 = /* @__PURE__ */ f({
  name: "Trophy",
  __name: "trophy",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M480 896V702.08A256.26 256.26 0 0 1 264.064 512h-32.64a96 96 0 0 1-91.968-68.416L93.632 290.88a76.8 76.8 0 0 1 73.6-98.88H256V96a32 32 0 0 1 32-32h448a32 32 0 0 1 32 32v96h88.768a76.8 76.8 0 0 1 73.6 98.88L884.48 443.52A96 96 0 0 1 792.576 512h-32.64A256.26 256.26 0 0 1 544 702.08V896h128a32 32 0 1 1 0 64H352a32 32 0 1 1 0-64zm224-448V128H320v320a192 192 0 1 0 384 0m64 0h24.576a32 32 0 0 0 30.656-22.784l45.824-152.768A12.8 12.8 0 0 0 856.768 256H768zm-512 0V256h-88.768a12.8 12.8 0 0 0-12.288 16.448l45.824 152.768A32 32 0 0 0 231.424 448z"
      })
    ]));
  }
}), F5 = q5, U5 = /* @__PURE__ */ f({
  name: "TurnOff",
  __name: "turn-off",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M329.956 257.138a254.862 254.862 0 0 0 0 509.724h364.088a254.862 254.862 0 0 0 0-509.724zm0-72.818h364.088a327.68 327.68 0 1 1 0 655.36H329.956a327.68 327.68 0 1 1 0-655.36"
      }),
      c("path", {
        fill: "currentColor",
        d: "M329.956 621.227a109.227 109.227 0 1 0 0-218.454 109.227 109.227 0 0 0 0 218.454m0 72.817a182.044 182.044 0 1 1 0-364.088 182.044 182.044 0 0 1 0 364.088"
      })
    ]));
  }
}), W5 = U5, G5 = /* @__PURE__ */ f({
  name: "Umbrella",
  __name: "umbrella",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M320 768a32 32 0 1 1 64 0 64 64 0 0 0 128 0V512H64a448 448 0 1 1 896 0H576v256a128 128 0 1 1-256 0m570.688-320a384.128 384.128 0 0 0-757.376 0z"
      })
    ]));
  }
}), $5 = G5, Q5 = /* @__PURE__ */ f({
  name: "Unlock",
  __name: "unlock",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M224 448a32 32 0 0 0-32 32v384a32 32 0 0 0 32 32h576a32 32 0 0 0 32-32V480a32 32 0 0 0-32-32zm0-64h576a96 96 0 0 1 96 96v384a96 96 0 0 1-96 96H224a96 96 0 0 1-96-96V480a96 96 0 0 1 96-96"
      }),
      c("path", {
        fill: "currentColor",
        d: "M512 544a32 32 0 0 1 32 32v192a32 32 0 1 1-64 0V576a32 32 0 0 1 32-32m178.304-295.296A192.064 192.064 0 0 0 320 320v64h352l96 38.4V448H256V320a256 256 0 0 1 493.76-95.104z"
      })
    ]));
  }
}), Y5 = Q5, Z5 = /* @__PURE__ */ f({
  name: "UploadFilled",
  __name: "upload-filled",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M544 864V672h128L512 480 352 672h128v192H320v-1.6c-5.376.32-10.496 1.6-16 1.6A240 240 0 0 1 64 624c0-123.136 93.12-223.488 212.608-237.248A239.81 239.81 0 0 1 512 192a239.87 239.87 0 0 1 235.456 194.752c119.488 13.76 212.48 114.112 212.48 237.248a240 240 0 0 1-240 240c-5.376 0-10.56-1.28-16-1.6v1.6z"
      })
    ]));
  }
}), K5 = Z5, X5 = /* @__PURE__ */ f({
  name: "Upload",
  __name: "upload",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M160 832h704a32 32 0 1 1 0 64H160a32 32 0 1 1 0-64m384-578.304V704h-64V247.296L237.248 490.048 192 444.8 508.8 128l316.8 316.8-45.312 45.248z"
      })
    ]));
  }
}), J5 = X5, ep = /* @__PURE__ */ f({
  name: "UserFilled",
  __name: "user-filled",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M288 320a224 224 0 1 0 448 0 224 224 0 1 0-448 0m544 608H160a32 32 0 0 1-32-32v-96a160 160 0 0 1 160-160h448a160 160 0 0 1 160 160v96a32 32 0 0 1-32 32z"
      })
    ]));
  }
}), tp = ep, np = /* @__PURE__ */ f({
  name: "User",
  __name: "user",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M512 512a192 192 0 1 0 0-384 192 192 0 0 0 0 384m0 64a256 256 0 1 1 0-512 256 256 0 0 1 0 512m320 320v-96a96 96 0 0 0-96-96H288a96 96 0 0 0-96 96v96a32 32 0 1 1-64 0v-96a160 160 0 0 1 160-160h448a160 160 0 0 1 160 160v96a32 32 0 1 1-64 0"
      })
    ]));
  }
}), ap = np, rp = /* @__PURE__ */ f({
  name: "Van",
  __name: "van",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M128.896 736H96a32 32 0 0 1-32-32V224a32 32 0 0 1 32-32h576a32 32 0 0 1 32 32v96h164.544a32 32 0 0 1 31.616 27.136l54.144 352A32 32 0 0 1 922.688 736h-91.52a144 144 0 1 1-286.272 0H415.104a144 144 0 1 1-286.272 0zm23.36-64a143.872 143.872 0 0 1 239.488 0H568.32c17.088-25.6 42.24-45.376 71.744-55.808V256H128v416zm655.488 0h77.632l-19.648-128H704v64.896A144 144 0 0 1 807.744 672m48.128-192-14.72-96H704v96zM688 832a80 80 0 1 0 0-160 80 80 0 0 0 0 160m-416 0a80 80 0 1 0 0-160 80 80 0 0 0 0 160"
      })
    ]));
  }
}), op = rp, ip = /* @__PURE__ */ f({
  name: "VideoCameraFilled",
  __name: "video-camera-filled",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "m768 576 192-64v320l-192-64v96a32 32 0 0 1-32 32H96a32 32 0 0 1-32-32V480a32 32 0 0 1 32-32h640a32 32 0 0 1 32 32zM192 768v64h384v-64zm192-480a160 160 0 0 1 320 0 160 160 0 0 1-320 0m64 0a96 96 0 1 0 192.064-.064A96 96 0 0 0 448 288m-320 32a128 128 0 1 1 256.064.064A128 128 0 0 1 128 320m64 0a64 64 0 1 0 128 0 64 64 0 0 0-128 0"
      })
    ]));
  }
}), lp = ip, sp = /* @__PURE__ */ f({
  name: "VideoCamera",
  __name: "video-camera",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M704 768V256H128v512zm64-416 192-96v512l-192-96v128a32 32 0 0 1-32 32H96a32 32 0 0 1-32-32V224a32 32 0 0 1 32-32h640a32 32 0 0 1 32 32zm0 71.552v176.896l128 64V359.552zM192 320h192v64H192z"
      })
    ]));
  }
}), cp = sp, dp = /* @__PURE__ */ f({
  name: "VideoPause",
  __name: "video-pause",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M512 64a448 448 0 1 1 0 896 448 448 0 0 1 0-896m0 832a384 384 0 0 0 0-768 384 384 0 0 0 0 768m-96-544q32 0 32 32v256q0 32-32 32t-32-32V384q0-32 32-32m192 0q32 0 32 32v256q0 32-32 32t-32-32V384q0-32 32-32"
      })
    ]));
  }
}), up = dp, mp = /* @__PURE__ */ f({
  name: "VideoPlay",
  __name: "video-play",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M512 64a448 448 0 1 1 0 896 448 448 0 0 1 0-896m0 832a384 384 0 0 0 0-768 384 384 0 0 0 0 768m-48-247.616L668.608 512 464 375.616zm10.624-342.656 249.472 166.336a48 48 0 0 1 0 79.872L474.624 718.272A48 48 0 0 1 400 678.336V345.6a48 48 0 0 1 74.624-39.936z"
      })
    ]));
  }
}), hp = mp, fp = /* @__PURE__ */ f({
  name: "View",
  __name: "view",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M512 160c320 0 512 352 512 352S832 864 512 864 0 512 0 512s192-352 512-352m0 64c-225.28 0-384.128 208.064-436.8 288 52.608 79.872 211.456 288 436.8 288 225.28 0 384.128-208.064 436.8-288-52.608-79.872-211.456-288-436.8-288m0 64a224 224 0 1 1 0 448 224 224 0 0 1 0-448m0 64a160.19 160.19 0 0 0-160 160c0 88.192 71.744 160 160 160s160-71.808 160-160-71.744-160-160-160"
      })
    ]));
  }
}), pp = fp, gp = /* @__PURE__ */ f({
  name: "WalletFilled",
  __name: "wallet-filled",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M688 512a112 112 0 1 0 0 224h208v160H128V352h768v160zm32 160h-32a48 48 0 0 1 0-96h32a48 48 0 0 1 0 96m-80-544 128 160H384z"
      })
    ]));
  }
}), vp = gp, _p = /* @__PURE__ */ f({
  name: "Wallet",
  __name: "wallet",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M640 288h-64V128H128v704h384v32a32 32 0 0 0 32 32H96a32 32 0 0 1-32-32V96a32 32 0 0 1 32-32h512a32 32 0 0 1 32 32z"
      }),
      c("path", {
        fill: "currentColor",
        d: "M128 320v512h768V320zm-32-64h832a32 32 0 0 1 32 32v576a32 32 0 0 1-32 32H96a32 32 0 0 1-32-32V288a32 32 0 0 1 32-32"
      }),
      c("path", {
        fill: "currentColor",
        d: "M704 640a64 64 0 1 1 0-128 64 64 0 0 1 0 128"
      })
    ]));
  }
}), wp = _p, yp = /* @__PURE__ */ f({
  name: "WarnTriangleFilled",
  __name: "warn-triangle-filled",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      "xml:space": "preserve",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M928.99 755.83 574.6 203.25c-12.89-20.16-36.76-32.58-62.6-32.58s-49.71 12.43-62.6 32.58L95.01 755.83c-12.91 20.12-12.9 44.91.01 65.03 12.92 20.12 36.78 32.51 62.59 32.49h708.78c25.82.01 49.68-12.37 62.59-32.49s12.92-44.91.01-65.03M554.67 768h-85.33v-85.33h85.33zm0-426.67v298.66h-85.33V341.32z"
      })
    ]));
  }
}), bp = yp, Cp = /* @__PURE__ */ f({
  name: "WarningFilled",
  __name: "warning-filled",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M512 64a448 448 0 1 1 0 896 448 448 0 0 1 0-896m0 192a58.43 58.43 0 0 0-58.24 63.744l23.36 256.384a35.072 35.072 0 0 0 69.76 0l23.296-256.384A58.43 58.43 0 0 0 512 256m0 512a51.2 51.2 0 1 0 0-102.4 51.2 51.2 0 0 0 0 102.4"
      })
    ]));
  }
}), Yl = Cp, Ap = /* @__PURE__ */ f({
  name: "Warning",
  __name: "warning",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M512 64a448 448 0 1 1 0 896 448 448 0 0 1 0-896m0 832a384 384 0 0 0 0-768 384 384 0 0 0 0 768m48-176a48 48 0 1 1-96 0 48 48 0 0 1 96 0m-48-464a32 32 0 0 1 32 32v288a32 32 0 0 1-64 0V288a32 32 0 0 1 32-32"
      })
    ]));
  }
}), xp = Ap, Ep = /* @__PURE__ */ f({
  name: "Watch",
  __name: "watch",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M512 768a256 256 0 1 0 0-512 256 256 0 0 0 0 512m0 64a320 320 0 1 1 0-640 320 320 0 0 1 0 640"
      }),
      c("path", {
        fill: "currentColor",
        d: "M480 352a32 32 0 0 1 32 32v160a32 32 0 0 1-64 0V384a32 32 0 0 1 32-32"
      }),
      c("path", {
        fill: "currentColor",
        d: "M480 512h128q32 0 32 32t-32 32H480q-32 0-32-32t32-32m128-256V128H416v128h-64V64h320v192zM416 768v128h192V768h64v192H352V768z"
      })
    ]));
  }
}), Sp = Ep, Mp = /* @__PURE__ */ f({
  name: "Watermelon",
  __name: "watermelon",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "m683.072 600.32-43.648 162.816-61.824-16.512 53.248-198.528L576 493.248l-158.4 158.4-45.248-45.248 158.4-158.4-55.616-55.616-198.528 53.248-16.512-61.824 162.816-43.648L282.752 200A384 384 0 0 0 824 741.248zm231.552 141.056a448 448 0 1 1-632-632z"
      })
    ]));
  }
}), Dp = Mp, Tp = /* @__PURE__ */ f({
  name: "WindPower",
  __name: "wind-power",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "M160 64q32 0 32 32v832q0 32-32 32t-32-32V96q0-32 32-32m416 354.624 128-11.584V168.96l-128-11.52v261.12zm-64 5.824V151.552L320 134.08V160h-64V64l616.704 56.064A96 96 0 0 1 960 215.68v144.64a96 96 0 0 1-87.296 95.616L256 512V224h64v217.92zm256-23.232 98.88-8.96A32 32 0 0 0 896 360.32V215.68a32 32 0 0 0-29.12-31.872l-98.88-8.96z"
      })
    ]));
  }
}), Rp = Tp, Hp = /* @__PURE__ */ f({
  name: "ZoomIn",
  __name: "zoom-in",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "m795.904 750.72 124.992 124.928a32 32 0 0 1-45.248 45.248L750.656 795.904a416 416 0 1 1 45.248-45.248zM480 832a352 352 0 1 0 0-704 352 352 0 0 0 0 704m-32-384v-96a32 32 0 0 1 64 0v96h96a32 32 0 0 1 0 64h-96v96a32 32 0 0 1-64 0v-96h-96a32 32 0 0 1 0-64z"
      })
    ]));
  }
}), Ip = Hp, kp = /* @__PURE__ */ f({
  name: "ZoomOut",
  __name: "zoom-out",
  setup(t) {
    return (e, n) => (m(), h("svg", {
      xmlns: "http://www.w3.org/2000/svg",
      viewBox: "0 0 1024 1024"
    }, [
      c("path", {
        fill: "currentColor",
        d: "m795.904 750.72 124.992 124.928a32 32 0 0 1-45.248 45.248L750.656 795.904a416 416 0 1 1 45.248-45.248zM480 832a352 352 0 1 0 0-704 352 352 0 0 0 0 704M352 448h256a32 32 0 0 1 0 64H352a32 32 0 0 1 0-64"
      })
    ]));
  }
}), zp = kp;
const Vp = /* @__PURE__ */ Object.freeze(/* @__PURE__ */ Object.defineProperty({
  __proto__: null,
  AddLocation: Q1,
  Aim: Z1,
  AlarmClock: X1,
  Apple: ed,
  ArrowDown: rd,
  ArrowDownBold: nd,
  ArrowLeft: sd,
  ArrowLeftBold: id,
  ArrowRight: md,
  ArrowRightBold: dd,
  ArrowUp: gd,
  ArrowUpBold: fd,
  Avatar: _d,
  Back: yd,
  Baseball: Cd,
  Basketball: xd,
  Bell: Dd,
  BellFilled: Sd,
  Bicycle: Rd,
  Bottom: Od,
  BottomLeft: Id,
  BottomRight: zd,
  Bowl: Ld,
  Box: Pd,
  Briefcase: qd,
  Brush: Gd,
  BrushFilled: Ud,
  Burger: Qd,
  Calendar: Zd,
  Camera: e4,
  CameraFilled: Xd,
  CaretBottom: n4,
  CaretLeft: r4,
  CaretRight: i4,
  CaretTop: s4,
  Cellphone: d4,
  ChatDotRound: m4,
  ChatDotSquare: f4,
  ChatLineRound: g4,
  ChatLineSquare: _4,
  ChatRound: y4,
  ChatSquare: C4,
  Check: x4,
  Checked: S4,
  Cherry: D4,
  Chicken: R4,
  ChromeFilled: I4,
  CircleCheck: O4,
  CircleCheckFilled: z4,
  CircleClose: N4,
  CircleCloseFilled: Gl,
  CirclePlus: F4,
  CirclePlusFilled: j4,
  Clock: W4,
  Close: $l,
  CloseBold: $4,
  Cloudy: Z4,
  Coffee: e3,
  CoffeeCup: X4,
  Coin: n3,
  ColdDrink: r3,
  Collection: s3,
  CollectionTag: i3,
  Comment: d3,
  Compass: m3,
  Connection: f3,
  Coordinate: g3,
  CopyDocument: _3,
  Cpu: y3,
  CreditCard: C3,
  Crop: x3,
  DArrowLeft: S3,
  DArrowRight: D3,
  DCaret: R3,
  DataAnalysis: I3,
  DataBoard: z3,
  DataLine: O3,
  Delete: q3,
  DeleteFilled: L3,
  DeleteLocation: P3,
  Dessert: U3,
  Discount: G3,
  Dish: Z3,
  DishDot: Q3,
  Document: s6,
  DocumentAdd: X3,
  DocumentChecked: e6,
  DocumentCopy: n6,
  DocumentDelete: r6,
  DocumentRemove: i6,
  Download: d6,
  Drizzling: m6,
  Edit: g6,
  EditPen: f6,
  Eleme: y6,
  ElemeFilled: _6,
  ElementPlus: C6,
  Expand: x6,
  Failed: S6,
  Female: D6,
  Files: R6,
  Film: I6,
  Filter: z6,
  Finished: O6,
  FirstAidKit: L6,
  Flag: P6,
  Fold: q6,
  Folder: eu,
  FolderAdd: U6,
  FolderChecked: G6,
  FolderDelete: Q6,
  FolderOpened: Z6,
  FolderRemove: X6,
  Food: nu,
  Football: ru,
  ForkSpoon: iu,
  Fries: su,
  FullScreen: du,
  Goblet: _u,
  GobletFull: mu,
  GobletSquare: gu,
  GobletSquareFull: fu,
  GoldMedal: yu,
  Goods: xu,
  GoodsFilled: Cu,
  Grape: Su,
  Grid: Du,
  Guide: Ru,
  Handbag: Iu,
  Headset: zu,
  Help: Lu,
  HelpFilled: Ou,
  Hide: Pu,
  Histogram: qu,
  HomeFilled: Uu,
  HotWater: Gu,
  House: Qu,
  IceCream: em,
  IceCreamRound: Zu,
  IceCreamSquare: Xu,
  IceDrink: nm,
  IceTea: rm,
  InfoFilled: lo,
  Iphone: lm,
  Key: cm,
  KnifeFork: um,
  Lightning: hm,
  Link: pm,
  List: vm,
  Loading: wm,
  Location: Em,
  LocationFilled: bm,
  LocationInformation: Am,
  Lock: Mm,
  Lollipop: Tm,
  MagicStick: Hm,
  Magnet: km,
  Male: Vm,
  Management: Bm,
  MapLocation: Nm,
  Medal: jm,
  Memo: Fm,
  Menu: Wm,
  Message: Ym,
  MessageBox: $m,
  Mic: Km,
  Microphone: Jm,
  MilkTea: t8,
  Minus: a8,
  Money: o8,
  Monitor: l8,
  Moon: u8,
  MoonNight: c8,
  More: p8,
  MoreFilled: h8,
  MostlyCloudy: v8,
  Mouse: w8,
  Mug: b8,
  Mute: E8,
  MuteNotification: A8,
  NoSmoking: M8,
  Notebook: T8,
  Notification: H8,
  Odometer: k8,
  OfficeBuilding: V8,
  Open: B8,
  Operation: N8,
  Opportunity: j8,
  Orange: F8,
  Paperclip: W8,
  PartlyCloudy: $8,
  Pear: Y8,
  Phone: J8,
  PhoneFilled: K8,
  Picture: oh,
  PictureFilled: th,
  PictureRounded: ah,
  PieChart: lh,
  Place: ch,
  Platform: uh,
  Plus: hh,
  Pointer: ph,
  Position: vh,
  Postcard: wh,
  Pouring: bh,
  Present: Ah,
  PriceTag: Eh,
  Printer: Mh,
  Promotion: Th,
  QuartzWatch: Hh,
  QuestionFilled: kh,
  Rank: Vh,
  Reading: Nh,
  ReadingLamp: Bh,
  Refresh: Wh,
  RefreshLeft: jh,
  RefreshRight: Fh,
  Refrigerator: $h,
  Remove: Kh,
  RemoveFilled: Yh,
  Right: Jh,
  ScaleToOriginal: tf,
  School: af,
  Scissor: of,
  Search: sf,
  Select: df,
  Sell: mf,
  SemiSelect: ff,
  Service: gf,
  SetUp: _f,
  Setting: yf,
  Share: Cf,
  Ship: xf,
  Shop: Sf,
  ShoppingBag: Df,
  ShoppingCart: If,
  ShoppingCartFull: Rf,
  ShoppingTrolley: zf,
  Smoking: Of,
  Soccer: Lf,
  SoldOut: Pf,
  Sort: Gf,
  SortDown: qf,
  SortUp: Uf,
  Stamp: Qf,
  Star: Xf,
  StarFilled: Zf,
  Stopwatch: e5,
  SuccessFilled: Ql,
  Sugar: a5,
  Suitcase: l5,
  SuitcaseLine: o5,
  Sunny: c5,
  Sunrise: u5,
  Sunset: h5,
  Switch: w5,
  SwitchButton: p5,
  SwitchFilled: v5,
  TakeawayBox: b5,
  Ticket: A5,
  Tickets: E5,
  Timer: M5,
  ToiletPaper: T5,
  Tools: H5,
  Top: B5,
  TopLeft: k5,
  TopRight: V5,
  TrendCharts: N5,
  Trophy: F5,
  TrophyBase: j5,
  TurnOff: W5,
  Umbrella: $5,
  Unlock: Y5,
  Upload: J5,
  UploadFilled: K5,
  User: ap,
  UserFilled: tp,
  Van: op,
  VideoCamera: cp,
  VideoCameraFilled: lp,
  VideoPause: up,
  VideoPlay: hp,
  View: pp,
  Wallet: wp,
  WalletFilled: vp,
  WarnTriangleFilled: bp,
  Warning: xp,
  WarningFilled: Yl,
  Watch: Sp,
  Watermelon: Dp,
  WindPower: Rp,
  ZoomIn: Ip,
  ZoomOut: zp
}, Symbol.toStringTag, { value: "Module" })), ve = (t) => t.replace(/(A-Z)g/, "-$1").toLocaleLowerCase(), Zl = Symbol(), rn = "el", Op = "is-", Be = (t, e, n, a, r) => {
  let o = `${t}-${e}`;
  return n && (o += `-${n}`), a && (o += `__${a}`), r && (o += `--${r}`), o;
}, Kl = Symbol("namespaceContextKey"), Bp = (t) => {
  const e = t || (ht() ? ct(Kl, N(rn)) : N(rn));
  return I(() => x(e) || rn);
}, So = (t, e) => {
  const n = Bp(e);
  return {
    namespace: n,
    b: (_ = "") => Be(n.value, t, _, "", ""),
    e: (_) => _ ? Be(n.value, t, "", _, "") : "",
    m: (_) => _ ? Be(n.value, t, "", "", _) : "",
    be: (_, y) => _ && y ? Be(n.value, t, _, y, "") : "",
    em: (_, y) => _ && y ? Be(n.value, t, "", _, y) : "",
    bm: (_, y) => _ && y ? Be(n.value, t, _, "", y) : "",
    bem: (_, y, A) => _ && y && A ? Be(n.value, t, _, y, A) : "",
    is: (_, ...y) => {
      const A = y.length >= 1 ? y[0] : !0;
      return _ && A ? `${Op}${_}` : "";
    },
    cssVar: (_) => {
      const y = {};
      for (const A in _)
        _[A] && (y[`--${n.value}-${A}`] = _[A]);
      return y;
    },
    cssVarName: (_) => `--${n.value}-${_}`,
    cssVarBlock: (_) => {
      const y = {};
      for (const A in _)
        _[A] && (y[`--${n.value}-${t}-${A}`] = _[A]);
      return y;
    },
    cssVarBlockName: (_) => `--${n.value}-${t}-${_}`
  };
};
process.env.NODE_ENV !== "production" && Object.freeze({});
process.env.NODE_ENV !== "production" && Object.freeze([]);
const Lp = Object.prototype.hasOwnProperty, so = (t, e) => Lp.call(t, e), Np = Array.isArray, un = (t) => typeof t == "function", _t = (t) => typeof t == "string", Xl = (t) => t !== null && typeof t == "object";
var Pp = typeof global == "object" && global && global.Object === Object && global, jp = typeof self == "object" && self && self.Object === Object && self, Mo = Pp || jp || Function("return this")(), ft = Mo.Symbol, Jl = Object.prototype, qp = Jl.hasOwnProperty, Fp = Jl.toString, Ct = ft ? ft.toStringTag : void 0;
function Up(t) {
  var e = qp.call(t, Ct), n = t[Ct];
  try {
    t[Ct] = void 0;
    var a = !0;
  } catch {
  }
  var r = Fp.call(t);
  return a && (e ? t[Ct] = n : delete t[Ct]), r;
}
var Wp = Object.prototype, Gp = Wp.toString;
function $p(t) {
  return Gp.call(t);
}
var Qp = "[object Null]", Yp = "[object Undefined]", A2 = ft ? ft.toStringTag : void 0;
function es(t) {
  return t == null ? t === void 0 ? Yp : Qp : A2 && A2 in Object(t) ? Up(t) : $p(t);
}
function Zp(t) {
  return t != null && typeof t == "object";
}
var Kp = "[object Symbol]";
function Do(t) {
  return typeof t == "symbol" || Zp(t) && es(t) == Kp;
}
function Xp(t, e) {
  for (var n = -1, a = t == null ? 0 : t.length, r = Array(a); ++n < a; )
    r[n] = e(t[n], n, t);
  return r;
}
var To = Array.isArray, x2 = ft ? ft.prototype : void 0, E2 = x2 ? x2.toString : void 0;
function ts(t) {
  if (typeof t == "string")
    return t;
  if (To(t))
    return Xp(t, ts) + "";
  if (Do(t))
    return E2 ? E2.call(t) : "";
  var e = t + "";
  return e == "0" && 1 / t == -1 / 0 ? "-0" : e;
}
function ns(t) {
  var e = typeof t;
  return t != null && (e == "object" || e == "function");
}
var Jp = "[object AsyncFunction]", eg = "[object Function]", tg = "[object GeneratorFunction]", ng = "[object Proxy]";
function ag(t) {
  if (!ns(t))
    return !1;
  var e = es(t);
  return e == eg || e == tg || e == Jp || e == ng;
}
var Wn = Mo["__core-js_shared__"], S2 = (function() {
  var t = /[^.]+$/.exec(Wn && Wn.keys && Wn.keys.IE_PROTO || "");
  return t ? "Symbol(src)_1." + t : "";
})();
function rg(t) {
  return !!S2 && S2 in t;
}
var og = Function.prototype, ig = og.toString;
function lg(t) {
  if (t != null) {
    try {
      return ig.call(t);
    } catch {
    }
    try {
      return t + "";
    } catch {
    }
  }
  return "";
}
var sg = /[\\^$.*+?()[\]{}|]/g, cg = /^\[object .+?Constructor\]$/, dg = Function.prototype, ug = Object.prototype, mg = dg.toString, hg = ug.hasOwnProperty, fg = RegExp(
  "^" + mg.call(hg).replace(sg, "\\$&").replace(/hasOwnProperty|(function).*?(?=\\\()| for .+?(?=\\\])/g, "$1.*?") + "$"
);
function pg(t) {
  if (!ns(t) || rg(t))
    return !1;
  var e = ag(t) ? fg : cg;
  return e.test(lg(t));
}
function gg(t, e) {
  return t?.[e];
}
function as(t, e) {
  var n = gg(t, e);
  return pg(n) ? n : void 0;
}
function vg(t, e) {
  return t === e || t !== t && e !== e;
}
var _g = /\.|\[(?:[^[\]]*|(["'])(?:(?!\1)[^\\]|\\.)*?\1)\]/, wg = /^\w*$/;
function yg(t, e) {
  if (To(t))
    return !1;
  var n = typeof t;
  return n == "number" || n == "symbol" || n == "boolean" || t == null || Do(t) ? !0 : wg.test(t) || !_g.test(t) || e != null && t in Object(e);
}
var It = as(Object, "create");
function bg() {
  this.__data__ = It ? It(null) : {}, this.size = 0;
}
function Cg(t) {
  var e = this.has(t) && delete this.__data__[t];
  return this.size -= e ? 1 : 0, e;
}
var Ag = "__lodash_hash_undefined__", xg = Object.prototype, Eg = xg.hasOwnProperty;
function Sg(t) {
  var e = this.__data__;
  if (It) {
    var n = e[t];
    return n === Ag ? void 0 : n;
  }
  return Eg.call(e, t) ? e[t] : void 0;
}
var Mg = Object.prototype, Dg = Mg.hasOwnProperty;
function Tg(t) {
  var e = this.__data__;
  return It ? e[t] !== void 0 : Dg.call(e, t);
}
var Rg = "__lodash_hash_undefined__";
function Hg(t, e) {
  var n = this.__data__;
  return this.size += this.has(t) ? 0 : 1, n[t] = It && e === void 0 ? Rg : e, this;
}
function Fe(t) {
  var e = -1, n = t == null ? 0 : t.length;
  for (this.clear(); ++e < n; ) {
    var a = t[e];
    this.set(a[0], a[1]);
  }
}
Fe.prototype.clear = bg;
Fe.prototype.delete = Cg;
Fe.prototype.get = Sg;
Fe.prototype.has = Tg;
Fe.prototype.set = Hg;
function Ig() {
  this.__data__ = [], this.size = 0;
}
function Dn(t, e) {
  for (var n = t.length; n--; )
    if (vg(t[n][0], e))
      return n;
  return -1;
}
var kg = Array.prototype, zg = kg.splice;
function Vg(t) {
  var e = this.__data__, n = Dn(e, t);
  if (n < 0)
    return !1;
  var a = e.length - 1;
  return n == a ? e.pop() : zg.call(e, n, 1), --this.size, !0;
}
function Og(t) {
  var e = this.__data__, n = Dn(e, t);
  return n < 0 ? void 0 : e[n][1];
}
function Bg(t) {
  return Dn(this.__data__, t) > -1;
}
function Lg(t, e) {
  var n = this.__data__, a = Dn(n, t);
  return a < 0 ? (++this.size, n.push([t, e])) : n[a][1] = e, this;
}
function wt(t) {
  var e = -1, n = t == null ? 0 : t.length;
  for (this.clear(); ++e < n; ) {
    var a = t[e];
    this.set(a[0], a[1]);
  }
}
wt.prototype.clear = Ig;
wt.prototype.delete = Vg;
wt.prototype.get = Og;
wt.prototype.has = Bg;
wt.prototype.set = Lg;
var Ng = as(Mo, "Map");
function Pg() {
  this.size = 0, this.__data__ = {
    hash: new Fe(),
    map: new (Ng || wt)(),
    string: new Fe()
  };
}
function jg(t) {
  var e = typeof t;
  return e == "string" || e == "number" || e == "symbol" || e == "boolean" ? t !== "__proto__" : t === null;
}
function Tn(t, e) {
  var n = t.__data__;
  return jg(e) ? n[typeof e == "string" ? "string" : "hash"] : n.map;
}
function qg(t) {
  var e = Tn(this, t).delete(t);
  return this.size -= e ? 1 : 0, e;
}
function Fg(t) {
  return Tn(this, t).get(t);
}
function Ug(t) {
  return Tn(this, t).has(t);
}
function Wg(t, e) {
  var n = Tn(this, t), a = n.size;
  return n.set(t, e), this.size += n.size == a ? 0 : 1, this;
}
function Ze(t) {
  var e = -1, n = t == null ? 0 : t.length;
  for (this.clear(); ++e < n; ) {
    var a = t[e];
    this.set(a[0], a[1]);
  }
}
Ze.prototype.clear = Pg;
Ze.prototype.delete = qg;
Ze.prototype.get = Fg;
Ze.prototype.has = Ug;
Ze.prototype.set = Wg;
var Gg = "Expected a function";
function Ro(t, e) {
  if (typeof t != "function" || e != null && typeof e != "function")
    throw new TypeError(Gg);
  var n = function() {
    var a = arguments, r = e ? e.apply(this, a) : a[0], o = n.cache;
    if (o.has(r))
      return o.get(r);
    var i = t.apply(this, a);
    return n.cache = o.set(r, i) || o, i;
  };
  return n.cache = new (Ro.Cache || Ze)(), n;
}
Ro.Cache = Ze;
var $g = 500;
function Qg(t) {
  var e = Ro(t, function(a) {
    return n.size === $g && n.clear(), a;
  }), n = e.cache;
  return e;
}
var Yg = /[^.[\]]+|\[(?:(-?\d+(?:\.\d+)?)|(["'])((?:(?!\2)[^\\]|\\.)*?)\2)\]|(?=(?:\.|\[\])(?:\.|\[\]|$))/g, Zg = /\\(\\)?/g, Kg = Qg(function(t) {
  var e = [];
  return t.charCodeAt(0) === 46 && e.push(""), t.replace(Yg, function(n, a, r, o) {
    e.push(r ? o.replace(Zg, "$1") : a || n);
  }), e;
});
function Xg(t) {
  return t == null ? "" : ts(t);
}
function Jg(t, e) {
  return To(t) ? t : yg(t, e) ? [t] : Kg(Xg(t));
}
function ev(t) {
  if (typeof t == "string" || Do(t))
    return t;
  var e = t + "";
  return e == "0" && 1 / t == -1 / 0 ? "-0" : e;
}
function tv(t, e) {
  e = Jg(e, t);
  for (var n = 0, a = e.length; t != null && n < a; )
    t = t[ev(e[n++])];
  return n && n == a ? t : void 0;
}
function nv(t, e, n) {
  var a = t == null ? void 0 : tv(t, e);
  return a === void 0 ? n : a;
}
function av(t) {
  for (var e = -1, n = t == null ? 0 : t.length, a = {}; ++e < n; ) {
    var r = t[e];
    a[r[0]] = r[1];
  }
  return a;
}
const Gn = (t) => typeof t == "boolean", Ue = (t) => typeof t == "number", rv = (t) => typeof Element > "u" ? !1 : t instanceof Element, ov = (t) => _t(t) ? !Number.isNaN(Number(t)) : !1;
var M2;
const Ke = typeof window < "u", iv = (t) => typeof t == "string", lv = () => {
};
Ke && ((M2 = window?.navigator) != null && M2.userAgent) && /iP(ad|hone|od)/.test(window.navigator.userAgent);
function Ho(t) {
  return typeof t == "function" ? t() : x(t);
}
function sv(t) {
  return t;
}
function Io(t) {
  return O1() ? (B1(t), !0) : !1;
}
function cv(t, e = !0) {
  ht() ? Qe(t) : e ? t() : jl(t);
}
function dv(t, e, n = {}) {
  const {
    immediate: a = !0
  } = n, r = N(!1);
  let o = null;
  function i() {
    o && (clearTimeout(o), o = null);
  }
  function l() {
    r.value = !1, i();
  }
  function s(...u) {
    i(), r.value = !0, o = setTimeout(() => {
      r.value = !1, o = null, t(...u);
    }, Ho(e));
  }
  return a && (r.value = !0, Ke && s()), Io(l), {
    isPending: V1(r),
    start: s,
    stop: l
  };
}
function rs(t) {
  var e;
  const n = Ho(t);
  return (e = n?.$el) != null ? e : n;
}
const os = Ke ? window : void 0;
function uv(...t) {
  let e, n, a, r;
  if (iv(t[0]) || Array.isArray(t[0]) ? ([n, a, r] = t, e = os) : [e, n, a, r] = t, !e)
    return lv;
  Array.isArray(n) || (n = [n]), Array.isArray(a) || (a = [a]);
  const o = [], i = () => {
    o.forEach((d) => d()), o.length = 0;
  }, l = (d, g, v, p) => (d.addEventListener(g, v, p), () => d.removeEventListener(g, v, p)), s = le(() => [rs(e), Ho(r)], ([d, g]) => {
    i(), d && o.push(...n.flatMap((v) => a.map((p) => l(d, v, p, g))));
  }, { immediate: !0, flush: "post" }), u = () => {
    s(), i();
  };
  return Io(u), u;
}
function mv(t, e = !1) {
  const n = N(), a = () => n.value = !!t();
  return a(), cv(a, e), n;
}
const D2 = typeof globalThis < "u" ? globalThis : typeof window < "u" ? window : typeof global < "u" ? global : typeof self < "u" ? self : {}, T2 = "__vueuse_ssr_handlers__";
D2[T2] = D2[T2] || {};
var R2 = Object.getOwnPropertySymbols, hv = Object.prototype.hasOwnProperty, fv = Object.prototype.propertyIsEnumerable, pv = (t, e) => {
  var n = {};
  for (var a in t)
    hv.call(t, a) && e.indexOf(a) < 0 && (n[a] = t[a]);
  if (t != null && R2)
    for (var a of R2(t))
      e.indexOf(a) < 0 && fv.call(t, a) && (n[a] = t[a]);
  return n;
};
function gv(t, e, n = {}) {
  const a = n, { window: r = os } = a, o = pv(a, ["window"]);
  let i;
  const l = mv(() => r && "ResizeObserver" in r), s = () => {
    i && (i.disconnect(), i = void 0);
  }, u = le(() => rs(t), (g) => {
    s(), l.value && r && g && (i = new ResizeObserver(e), i.observe(g, o));
  }, { immediate: !0, flush: "post" }), d = () => {
    s(), u();
  };
  return Io(d), {
    isSupported: l,
    stop: d
  };
}
var H2;
(function(t) {
  t.UP = "UP", t.RIGHT = "RIGHT", t.DOWN = "DOWN", t.LEFT = "LEFT", t.NONE = "NONE";
})(H2 || (H2 = {}));
var vv = Object.defineProperty, I2 = Object.getOwnPropertySymbols, _v = Object.prototype.hasOwnProperty, wv = Object.prototype.propertyIsEnumerable, k2 = (t, e, n) => e in t ? vv(t, e, { enumerable: !0, configurable: !0, writable: !0, value: n }) : t[e] = n, yv = (t, e) => {
  for (var n in e || (e = {}))
    _v.call(e, n) && k2(t, n, e[n]);
  if (I2)
    for (var n of I2(e))
      wv.call(e, n) && k2(t, n, e[n]);
  return t;
};
const bv = {
  easeInSine: [0.12, 0, 0.39, 0],
  easeOutSine: [0.61, 1, 0.88, 1],
  easeInOutSine: [0.37, 0, 0.63, 1],
  easeInQuad: [0.11, 0, 0.5, 0],
  easeOutQuad: [0.5, 1, 0.89, 1],
  easeInOutQuad: [0.45, 0, 0.55, 1],
  easeInCubic: [0.32, 0, 0.67, 0],
  easeOutCubic: [0.33, 1, 0.68, 1],
  easeInOutCubic: [0.65, 0, 0.35, 1],
  easeInQuart: [0.5, 0, 0.75, 0],
  easeOutQuart: [0.25, 1, 0.5, 1],
  easeInOutQuart: [0.76, 0, 0.24, 1],
  easeInQuint: [0.64, 0, 0.78, 0],
  easeOutQuint: [0.22, 1, 0.36, 1],
  easeInOutQuint: [0.83, 0, 0.17, 1],
  easeInExpo: [0.7, 0, 0.84, 0],
  easeOutExpo: [0.16, 1, 0.3, 1],
  easeInOutExpo: [0.87, 0, 0.13, 1],
  easeInCirc: [0.55, 0, 1, 0.45],
  easeOutCirc: [0, 0.55, 0.45, 1],
  easeInOutCirc: [0.85, 0, 0.15, 1],
  easeInBack: [0.36, 0, 0.66, -0.56],
  easeOutBack: [0.34, 1.56, 0.64, 1],
  easeInOutBack: [0.68, -0.6, 0.32, 1.6]
};
yv({
  linear: sv
}, bv);
class Cv extends Error {
  constructor(e) {
    super(e), this.name = "ElementPlusError";
  }
}
function Bt(t, e) {
  if (typeof process < "u" && process.env.NODE_ENV !== "production") {
    const n = _t(t) ? new Cv(`[${t}] ${e}`) : t;
    console.warn(n);
  }
}
const z2 = {
  current: 0
}, V2 = N(0), is = 2e3, O2 = Symbol("elZIndexContextKey"), ls = Symbol("zIndexContextKey"), Av = (t) => {
  const e = ht() ? ct(O2, z2) : z2, n = t || (ht() ? ct(ls, void 0) : void 0), a = I(() => {
    const i = x(n);
    return Ue(i) ? i : is;
  }), r = I(() => a.value + V2.value), o = () => (e.current++, V2.value = e.current, r.value);
  return !Ke && !ct(O2) && Bt("ZIndexInjection", `Looks like you are using server rendering, you must provide a z-index provider to ensure the hydration process to be succeed
usage: app.provide(ZINDEX_INJECTION_KEY, { current: 0 })`), {
    initialZIndex: a,
    currentZIndex: r,
    nextZIndex: o
  };
};
var xv = {
  name: "en",
  el: {
    breadcrumb: {
      label: "Breadcrumb"
    },
    colorpicker: {
      confirm: "OK",
      clear: "Clear",
      defaultLabel: "color picker",
      description: "current color is {color}. press enter to select a new color.",
      alphaLabel: "pick alpha value",
      alphaDescription: "alpha {alpha}, current color is {color}",
      hueLabel: "pick hue value",
      hueDescription: "hue {hue}, current color is {color}",
      svLabel: "pick saturation and brightness value",
      svDescription: "saturation {saturation}, brightness {brightness}, current color is {color}",
      predefineDescription: "select {value} as the color"
    },
    datepicker: {
      now: "Now",
      today: "Today",
      cancel: "Cancel",
      clear: "Clear",
      confirm: "OK",
      dateTablePrompt: "Use the arrow keys and enter to select the day of the month",
      monthTablePrompt: "Use the arrow keys and enter to select the month",
      yearTablePrompt: "Use the arrow keys and enter to select the year",
      selectedDate: "Selected date",
      selectDate: "Select date",
      selectTime: "Select time",
      startDate: "Start Date",
      startTime: "Start Time",
      endDate: "End Date",
      endTime: "End Time",
      prevYear: "Previous Year",
      nextYear: "Next Year",
      prevMonth: "Previous Month",
      nextMonth: "Next Month",
      year: "",
      month1: "January",
      month2: "February",
      month3: "March",
      month4: "April",
      month5: "May",
      month6: "June",
      month7: "July",
      month8: "August",
      month9: "September",
      month10: "October",
      month11: "November",
      month12: "December",
      weeks: {
        sun: "Sun",
        mon: "Mon",
        tue: "Tue",
        wed: "Wed",
        thu: "Thu",
        fri: "Fri",
        sat: "Sat"
      },
      weeksFull: {
        sun: "Sunday",
        mon: "Monday",
        tue: "Tuesday",
        wed: "Wednesday",
        thu: "Thursday",
        fri: "Friday",
        sat: "Saturday"
      },
      months: {
        jan: "Jan",
        feb: "Feb",
        mar: "Mar",
        apr: "Apr",
        may: "May",
        jun: "Jun",
        jul: "Jul",
        aug: "Aug",
        sep: "Sep",
        oct: "Oct",
        nov: "Nov",
        dec: "Dec"
      }
    },
    inputNumber: {
      decrease: "decrease number",
      increase: "increase number"
    },
    select: {
      loading: "Loading",
      noMatch: "No matching data",
      noData: "No data",
      placeholder: "Select"
    },
    mention: {
      loading: "Loading"
    },
    dropdown: {
      toggleDropdown: "Toggle Dropdown"
    },
    cascader: {
      noMatch: "No matching data",
      loading: "Loading",
      placeholder: "Select",
      noData: "No data"
    },
    pagination: {
      goto: "Go to",
      pagesize: "/page",
      total: "Total {total}",
      pageClassifier: "",
      page: "Page",
      prev: "Go to previous page",
      next: "Go to next page",
      currentPage: "page {pager}",
      prevPages: "Previous {pager} pages",
      nextPages: "Next {pager} pages",
      deprecationWarning: "Deprecated usages detected, please refer to the el-pagination documentation for more details"
    },
    dialog: {
      close: "Close this dialog"
    },
    drawer: {
      close: "Close this dialog"
    },
    messagebox: {
      title: "Message",
      confirm: "OK",
      cancel: "Cancel",
      error: "Illegal input",
      close: "Close this dialog"
    },
    upload: {
      deleteTip: "press delete to remove",
      delete: "Delete",
      preview: "Preview",
      continue: "Continue"
    },
    slider: {
      defaultLabel: "slider between {min} and {max}",
      defaultRangeStartLabel: "pick start value",
      defaultRangeEndLabel: "pick end value"
    },
    table: {
      emptyText: "No Data",
      confirmFilter: "Confirm",
      resetFilter: "Reset",
      clearFilter: "All",
      sumText: "Sum",
      selectAllLabel: "Select all rows",
      selectRowLabel: "Select this row",
      expandRowLabel: "Expand this row",
      collapseRowLabel: "Collapse this row",
      sortLabel: "Sort by {column}",
      filterLabel: "Filter by {column}"
    },
    tag: {
      close: "Close this tag"
    },
    tour: {
      next: "Next",
      previous: "Previous",
      finish: "Finish",
      close: "Close this dialog"
    },
    tree: {
      emptyText: "No Data"
    },
    transfer: {
      noMatch: "No matching data",
      noData: "No data",
      titles: ["List 1", "List 2"],
      filterPlaceholder: "Enter keyword",
      noCheckedFormat: "{total} items",
      hasCheckedFormat: "{checked}/{total} checked"
    },
    image: {
      error: "FAILED"
    },
    pageHeader: {
      title: "Back"
    },
    popconfirm: {
      confirmButtonText: "Yes",
      cancelButtonText: "No"
    },
    carousel: {
      leftArrow: "Carousel arrow left",
      rightArrow: "Carousel arrow right",
      indicator: "Carousel switch to index {index}"
    }
  }
};
const Ev = (t) => (e, n) => Sv(e, n, x(t)), Sv = (t, e, n) => nv(n, t, t).replace(/\{(\w+)\}/g, (a, r) => {
  var o;
  return `${(o = e?.[r]) != null ? o : `{${r}}`}`;
}), Mv = (t) => {
  const e = I(() => x(t).name), n = Ce(t) ? t : N(t);
  return {
    lang: e,
    locale: n,
    t: Ev(t)
  };
}, ss = Symbol("localeContextKey"), Dv = (t) => {
  const e = t || ct(ss, N());
  return Mv(I(() => e.value || xv));
}, cs = "__epPropKey", oe = (t) => t, Tv = (t) => Xl(t) && !!t[cs], ds = (t, e) => {
  if (!Xl(t) || Tv(t))
    return t;
  const { values: n, required: a, default: r, type: o, validator: i } = t, s = {
    type: o,
    required: !!a,
    validator: n || i ? (u) => {
      let d = !1, g = [];
      if (n && (g = Array.from(n), so(t, "default") && g.push(r), d || (d = g.includes(u))), i && (d || (d = i(u))), !d && g.length > 0) {
        const v = [...new Set(g)].map((p) => JSON.stringify(p)).join(", ");
        L1(`Invalid prop: validation failed${e ? ` for prop "${e}"` : ""}. Expected one of [${v}], got value ${JSON.stringify(u)}.`);
      }
      return d;
    } : void 0,
    [cs]: !0
  };
  return so(t, "default") && (s.default = r), s;
}, Lt = (t) => av(Object.entries(t).map(([e, n]) => [
  e,
  ds(n, e)
])), Rv = ["", "default", "small", "large"], Hv = ds({
  type: String,
  values: Rv,
  required: !1
}), Iv = Symbol("size"), kv = Symbol("emptyValuesContextKey"), zv = Lt({
  emptyValues: Array,
  valueOnClear: {
    type: oe([
      String,
      Number,
      Boolean,
      Function
    ]),
    default: void 0,
    validator: (t) => (t = un(t) ? t() : t, Np(t) ? t.every((e) => !e) : !t)
  }
}), B2 = (t) => Object.keys(t), mn = N();
function us(t, e = void 0) {
  return ht() ? ct(Zl, mn) : mn;
}
function Vv(t, e) {
  const n = us(), a = So(t, I(() => {
    var l;
    return ((l = n.value) == null ? void 0 : l.namespace) || rn;
  })), r = Dv(I(() => {
    var l;
    return (l = n.value) == null ? void 0 : l.locale;
  })), o = Av(I(() => {
    var l;
    return ((l = n.value) == null ? void 0 : l.zIndex) || is;
  })), i = I(() => {
    var l;
    return x(e) || ((l = n.value) == null ? void 0 : l.size) || "";
  });
  return ms(I(() => x(n) || {})), {
    ns: a,
    locale: r,
    zIndex: o,
    size: i
  };
}
const ms = (t, e, n = !1) => {
  var a;
  const r = !!ht(), o = r ? us() : void 0, i = (a = void 0) != null ? a : r ? N1 : void 0;
  if (!i) {
    Bt("provideGlobalConfig", "provideGlobalConfig() can only be used inside setup().");
    return;
  }
  const l = I(() => {
    const s = x(t);
    return o?.value ? Ov(o.value, s) : s;
  });
  return i(Zl, l), i(ss, I(() => l.value.locale)), i(Kl, I(() => l.value.namespace)), i(ls, I(() => l.value.zIndex)), i(Iv, {
    size: I(() => l.value.size || "")
  }), i(kv, I(() => ({
    emptyValues: l.value.emptyValues,
    valueOnClear: l.value.valueOnClear
  }))), (n || !mn.value) && (mn.value = l.value), l;
}, Ov = (t, e) => {
  const n = [.../* @__PURE__ */ new Set([...B2(t), ...B2(e)])], a = {};
  for (const r of n)
    a[r] = e[r] !== void 0 ? e[r] : t[r];
  return a;
};
var ko = (t, e) => {
  const n = t.__vccOpts || t;
  for (const [a, r] of e)
    n[a] = r;
  return n;
};
const Bv = "utils/dom/style";
function co(t, e = "px") {
  if (!t && t !== 0)
    return "";
  if (Ue(t) || ov(t))
    return `${t}${e}`;
  if (_t(t))
    return t;
  Bt(Bv, "binding value must be a string or number");
}
const hs = (t, e) => (t.install = (n) => {
  for (const a of [t, ...Object.values({})])
    n.component(a.name, a);
}, t), Lv = (t, e) => (t.install = (n) => {
  t._context = n._context, n.config.globalProperties[e] = t;
}, t), Nv = Lt({
  size: {
    type: oe([Number, String])
  },
  color: {
    type: String
  }
}), Pv = f({
  name: "ElIcon",
  inheritAttrs: !1
}), jv = /* @__PURE__ */ f({
  ...Pv,
  props: Nv,
  setup(t) {
    const e = t, n = So("icon"), a = I(() => {
      const { size: r, color: o } = e, i = co(r);
      return !i && !o ? {} : {
        fontSize: i,
        "--color": o
      };
    });
    return (r, o) => (m(), h("i", _e({
      class: x(n).b(),
      style: x(a)
    }, r.$attrs), [
      de(r.$slots, "default")
    ], 16));
  }
});
var qv = /* @__PURE__ */ ko(jv, [["__file", "icon.vue"]]);
const L2 = hs(qv), Fv = oe([
  String,
  Object,
  Function
]), Uv = {
  Close: $l
}, N2 = {
  primary: lo,
  success: Ql,
  warning: Yl,
  error: Gl,
  info: lo
}, Wv = () => Ke && /android/i.test(window.navigator.userAgent), Gv = (t) => t, uo = {
  tab: "Tab",
  enter: "Enter",
  space: "Space",
  left: "ArrowLeft",
  up: "ArrowUp",
  right: "ArrowRight",
  down: "ArrowDown",
  esc: "Escape",
  delete: "Delete",
  backspace: "Backspace",
  numpadEnter: "NumpadEnter",
  pageUp: "PageUp",
  pageDown: "PageDown",
  home: "Home",
  end: "End"
}, $v = (t) => {
  if (t.code && t.code !== "Unidentified")
    return t.code;
  const e = Qv(t);
  if (e) {
    if (Object.values(uo).includes(e))
      return e;
    switch (e) {
      case " ":
        return uo.space;
      default:
        return "";
    }
  }
  return "";
}, Qv = (t) => {
  let e = t.key && t.key !== "Unidentified" ? t.key : "";
  if (!e && t.type === "keyup" && Wv()) {
    const n = t.target;
    e = n.value.charAt(n.selectionStart - 1);
  }
  return e;
}, Yv = Lt({
  value: {
    type: [String, Number],
    default: ""
  },
  max: {
    type: Number,
    default: 99
  },
  isDot: Boolean,
  hidden: Boolean,
  type: {
    type: String,
    values: ["primary", "success", "warning", "info", "danger"],
    default: "danger"
  },
  showZero: {
    type: Boolean,
    default: !0
  },
  color: String,
  badgeStyle: {
    type: oe([String, Object, Array])
  },
  offset: {
    type: oe(Array),
    default: [0, 0]
  },
  badgeClass: {
    type: String
  }
}), Zv = f({
  name: "ElBadge"
}), Kv = /* @__PURE__ */ f({
  ...Zv,
  props: Yv,
  setup(t, { expose: e }) {
    const n = t, a = So("badge"), r = I(() => n.isDot ? "" : Ue(n.value) && Ue(n.max) ? n.max < n.value ? `${n.max}+` : `${n.value}` : `${n.value}`), o = I(() => {
      var i;
      return [
        {
          backgroundColor: n.color,
          marginRight: co(-n.offset[0]),
          marginTop: co(n.offset[1])
        },
        (i = n.badgeStyle) != null ? i : {}
      ];
    });
    return e({
      content: r
    }), (i, l) => (m(), h("div", {
      class: be(x(a).b())
    }, [
      de(i.$slots, "default"),
      F(ql, {
        name: `${x(a).namespace.value}-zoom-in-center`,
        persisted: ""
      }, {
        default: U(() => [
          xo(c("sup", {
            class: be([
              x(a).e("content"),
              x(a).em("content", i.type),
              x(a).is("fixed", !!i.$slots.default),
              x(a).is("dot", i.isDot),
              x(a).is("hide-zero", !i.showZero && i.value === 0),
              i.badgeClass
            ]),
            style: St(x(o))
          }, [
            de(i.$slots, "content", { value: x(r) }, () => [
              Fl(se(x(r)), 1)
            ])
          ], 6), [
            [Ul, !i.hidden && (x(r) || i.isDot || i.$slots.content)]
          ])
        ]),
        _: 3
      }, 8, ["name"])
    ], 2));
  }
});
var Xv = /* @__PURE__ */ ko(Kv, [["__file", "badge.vue"]]);
const Jv = hs(Xv);
var Yt = typeof globalThis < "u" ? globalThis : typeof window < "u" ? window : typeof global < "u" ? global : typeof self < "u" ? self : {};
function e9(t) {
  return t && t.__esModule && Object.prototype.hasOwnProperty.call(t, "default") ? t.default : t;
}
const t9 = Lt({
  a11y: {
    type: Boolean,
    default: !0
  },
  locale: {
    type: oe(Object)
  },
  size: Hv,
  button: {
    type: oe(Object)
  },
  card: {
    type: oe(Object)
  },
  dialog: {
    type: oe(Object)
  },
  link: {
    type: oe(Object)
  },
  experimentalFeatures: {
    type: oe(Object)
  },
  keyboardNavigation: {
    type: Boolean,
    default: !0
  },
  message: {
    type: oe(Object)
  },
  zIndex: Number,
  namespace: {
    type: String,
    default: "el"
  },
  ...zv
}), ne = {
  placement: "top"
};
f({
  name: "ElConfigProvider",
  props: t9,
  setup(t, { slots: e }) {
    const n = ms(t);
    return le(() => t.message, (a) => {
      var r, o;
      Object.assign(ne, (o = (r = n?.value) == null ? void 0 : r.message) != null ? o : {}, a ?? {});
    }, { immediate: !0, deep: !0 }), () => de(e, "default", { config: n?.value });
  }
});
const fs = [
  "primary",
  "success",
  "info",
  "warning",
  "error"
], ps = [
  "top",
  "top-left",
  "top-right",
  "bottom",
  "bottom-left",
  "bottom-right"
], dt = "top", te = Gv({
  customClass: "",
  dangerouslyUseHTMLString: !1,
  duration: 3e3,
  icon: void 0,
  id: "",
  message: "",
  onClose: void 0,
  showClose: !1,
  type: "info",
  plain: !1,
  offset: 16,
  placement: void 0,
  zIndex: 0,
  grouping: !1,
  repeatNum: 1,
  appendTo: Ke ? document.body : void 0
}), n9 = Lt({
  customClass: {
    type: String,
    default: te.customClass
  },
  dangerouslyUseHTMLString: {
    type: Boolean,
    default: te.dangerouslyUseHTMLString
  },
  duration: {
    type: Number,
    default: te.duration
  },
  icon: {
    type: Fv,
    default: te.icon
  },
  id: {
    type: String,
    default: te.id
  },
  message: {
    type: oe([
      String,
      Object,
      Function
    ]),
    default: te.message
  },
  onClose: {
    type: oe(Function),
    default: te.onClose
  },
  showClose: {
    type: Boolean,
    default: te.showClose
  },
  type: {
    type: String,
    values: fs,
    default: te.type
  },
  plain: {
    type: Boolean,
    default: te.plain
  },
  offset: {
    type: Number,
    default: te.offset
  },
  placement: {
    type: String,
    values: ps,
    default: te.placement
  },
  zIndex: {
    type: Number,
    default: te.zIndex
  },
  grouping: {
    type: Boolean,
    default: te.grouping
  },
  repeatNum: {
    type: Number,
    default: te.repeatNum
  }
}), a9 = {
  destroy: () => !0
}, he = Wl({}), r9 = (t) => (he[t] || (he[t] = Wl([])), he[t]), o9 = (t, e) => {
  const n = he[e] || [], a = n.findIndex((i) => i.id === t), r = n[a];
  let o;
  return a > 0 && (o = n[a - 1]), { current: r, prev: o };
}, i9 = (t, e) => {
  const { prev: n } = o9(t, e);
  return n ? n.vm.exposed.bottom.value : 0;
}, l9 = (t, e, n) => (he[n] || []).findIndex((o) => o.id === t) > 0 ? 16 : e, s9 = f({
  name: "ElMessage"
}), c9 = /* @__PURE__ */ f({
  ...s9,
  props: n9,
  emits: a9,
  setup(t, { expose: e, emit: n }) {
    const a = t, { Close: r } = Uv, o = N(!1), { ns: i, zIndex: l } = Vv("message"), { currentZIndex: s, nextZIndex: u } = l, d = N(), g = N(!1), v = N(0);
    let p;
    const w = I(() => a.type ? a.type === "error" ? "danger" : a.type : "info"), _ = I(() => {
      const k = a.type;
      return { [i.bm("icon", k)]: k && N2[k] };
    }), y = I(() => a.icon || N2[a.type] || ""), A = I(() => a.placement || dt), E = I(() => i9(a.id, A.value)), S = I(() => l9(a.id, a.offset, A.value) + E.value), M = I(() => v.value + S.value), P = I(() => A.value.includes("left") ? i.is("left") : A.value.includes("right") ? i.is("right") : i.is("center")), z = I(() => A.value.startsWith("top") ? "top" : "bottom"), T = I(() => ({
      [z.value]: `${S.value}px`,
      zIndex: s.value
    }));
    function R() {
      a.duration !== 0 && ({ stop: p } = dv(() => {
        Q();
      }, a.duration));
    }
    function H() {
      p?.();
    }
    function Q() {
      g.value = !1, jl(() => {
        var k;
        o.value || ((k = a.onClose) == null || k.call(a), n("destroy"));
      });
    }
    function V(k) {
      $v(k) === uo.esc && Q();
    }
    return Qe(() => {
      R(), u(), g.value = !0;
    }), le(() => a.repeatNum, () => {
      H(), R();
    }), uv(document, "keydown", V), gv(d, () => {
      v.value = d.value.getBoundingClientRect().height;
    }), e({
      visible: g,
      bottom: M,
      close: Q
    }), (k, Ve) => (m(), B(ql, {
      name: x(i).b("fade"),
      onBeforeEnter: (Ut) => o.value = !0,
      onBeforeLeave: k.onClose,
      onAfterLeave: (Ut) => k.$emit("destroy"),
      persisted: ""
    }, {
      default: U(() => [
        xo(c("div", {
          id: k.id,
          ref_key: "messageRef",
          ref: d,
          class: be([
            x(i).b(),
            { [x(i).m(k.type)]: k.type },
            x(i).is("closable", k.showClose),
            x(i).is("plain", k.plain),
            x(i).is("bottom", x(z) === "bottom"),
            x(P),
            k.customClass
          ]),
          style: St(x(T)),
          role: "alert",
          onMouseenter: H,
          onMouseleave: R
        }, [
          k.repeatNum > 1 ? (m(), B(x(Jv), {
            key: 0,
            value: k.repeatNum,
            type: x(w),
            class: be(x(i).e("badge"))
          }, null, 8, ["value", "type", "class"])) : J("v-if", !0),
          x(y) ? (m(), B(x(L2), {
            key: 1,
            class: be([x(i).e("icon"), x(_)])
          }, {
            default: U(() => [
              (m(), B(me(x(y))))
            ]),
            _: 1
          }, 8, ["class"])) : J("v-if", !0),
          de(k.$slots, "default", {}, () => [
            k.dangerouslyUseHTMLString ? (m(), h(ee, { key: 1 }, [
              J(" Caution here, message could've been compromised, never use user's input as message "),
              c("p", {
                class: be(x(i).e("content")),
                innerHTML: k.message
              }, null, 10, ["innerHTML"])
            ], 2112)) : (m(), h("p", {
              key: 0,
              class: be(x(i).e("content"))
            }, se(k.message), 3))
          ]),
          k.showClose ? (m(), B(x(L2), {
            key: 2,
            class: be(x(i).e("closeBtn")),
            onClick: an(Q, ["stop"])
          }, {
            default: U(() => [
              F(x(r))
            ]),
            _: 1
          }, 8, ["class", "onClick"])) : J("v-if", !0)
        ], 46, ["id"]), [
          [Ul, g.value]
        ])
      ]),
      _: 3
    }, 8, ["name", "onBeforeEnter", "onBeforeLeave", "onAfterLeave"]));
  }
});
var d9 = /* @__PURE__ */ ko(c9, [["__file", "message.vue"]]);
let u9 = 1;
const m9 = (t) => {
  if (!t.appendTo)
    t.appendTo = document.body;
  else if (_t(t.appendTo)) {
    let n = document.querySelector(t.appendTo);
    rv(n) || (Bt("ElMessage", "the appendTo option is not an HTMLElement. Falling back to document.body."), n = document.body), t.appendTo = n;
  }
}, h9 = (t) => {
  !t.placement && _t(ne.placement) && ne.placement && (t.placement = ne.placement), t.placement || (t.placement = dt), ps.includes(t.placement) || (Bt("ElMessage", `Invalid placement: ${t.placement}. Falling back to '${dt}'.`), t.placement = dt);
}, gs = (t) => {
  const e = !t || _t(t) || Eo(t) || un(t) ? { message: t } : t, n = {
    ...te,
    ...e
  };
  return m9(n), h9(n), Gn(ne.grouping) && !n.grouping && (n.grouping = ne.grouping), Ue(ne.duration) && n.duration === 3e3 && (n.duration = ne.duration), Ue(ne.offset) && n.offset === 16 && (n.offset = ne.offset), Gn(ne.showClose) && !n.showClose && (n.showClose = ne.showClose), Gn(ne.plain) && !n.plain && (n.plain = ne.plain), n;
}, f9 = (t) => {
  const e = t.props.placement || dt, n = he[e], a = n.indexOf(t);
  if (a === -1)
    return;
  n.splice(a, 1);
  const { handler: r } = t;
  r.close();
}, p9 = ({ appendTo: t, ...e }, n) => {
  const a = `message_${u9++}`, r = e.onClose, o = document.createElement("div"), i = {
    ...e,
    id: a,
    onClose: () => {
      r?.(), f9(d);
    },
    onDestroy: () => {
      b2(null, o);
    }
  }, l = F(d9, i, un(i.message) || Eo(i.message) ? {
    default: un(i.message) ? i.message : () => i.message
  } : null);
  l.appContext = n || We._context, b2(l, o), t.appendChild(o.firstElementChild);
  const s = l.component, d = {
    id: a,
    vnode: l,
    vm: s,
    handler: {
      close: () => {
        s.exposed.close();
      }
    },
    props: l.component.props
  };
  return d;
}, We = (t = {}, e) => {
  if (!Ke)
    return { close: () => {
    } };
  const n = gs(t), a = r9(n.placement || dt);
  if (n.grouping && a.length) {
    const o = a.find(({ vnode: i }) => {
      var l;
      return ((l = i.props) == null ? void 0 : l.message) === n.message;
    });
    if (o)
      return o.props.repeatNum += 1, o.props.type = n.type, o.handler;
  }
  if (Ue(ne.max) && a.length >= ne.max)
    return { close: () => {
    } };
  const r = p9(n, e);
  return a.push(r), r.handler;
};
fs.forEach((t) => {
  We[t] = (e = {}, n) => {
    const a = gs(e);
    return We({ ...a, type: t }, n);
  };
});
function g9(t) {
  for (const e in he)
    if (so(he, e)) {
      const n = [...he[e]];
      for (const a of n)
        (!t || t === a.props.type) && a.handler.close();
    }
}
function v9(t) {
  if (!he[t])
    return;
  [...he[t]].forEach((n) => n.handler.close());
}
We.closeAll = g9;
We.closeAllByPlacement = v9;
We._context = null;
const _9 = Lv(We, "$message"), w9 = (t) => {
  let e = document.createElement("input");
  e.value = t, document.body.appendChild(e), e.select(), document.execCommand("Copy"), document.body.removeChild(e), _9.success("复制成功");
}, y9 = { class: "icon-grid" }, b9 = ["onClick"], C9 = { class: "icon-wrapper" }, A9 = { class: "icon-name" }, x9 = /* @__PURE__ */ f({
  __name: "index",
  props: {
    title: {},
    modelValue: { type: Boolean }
  },
  emits: ["update:modelValue"],
  setup(t, { emit: e }) {
    const n = t, a = e, r = I({
      get: () => n.modelValue,
      set: (l) => a("update:modelValue", l)
    }), o = () => {
      r.value = !0;
    }, i = (l) => {
      const s = `<el-icon-${ve(l)} />`;
      w9(s), r.value = !1;
    };
    return (l, s) => {
      const u = q("el-button"), d = q("el-scrollbar"), g = q("el-dialog");
      return m(), h(
        ee,
        null,
        [
          F(u, {
            onClick: o,
            type: "primary"
          }, {
            default: U(() => [
              de(l.$slots, "default", {}, void 0, !0)
            ]),
            _: 3
            /* FORWARDED */
          }),
          F(g, {
            title: t.title,
            modelValue: r.value,
            "onUpdate:modelValue": s[0] || (s[0] = (v) => r.value = v),
            "append-to-body": ""
          }, {
            default: U(() => [
              J(" 1. 给 scrollbar 加固定高度/最大高度，限制滚动区域 "),
              F(d, {
                "max-height": "60vh",
                class: "icon-scrollbar"
              }, {
                default: U(() => [
                  c("div", y9, [
                    (m(!0), h(
                      ee,
                      null,
                      ue(Object.keys(Vp), (v) => (m(), h("div", {
                        class: "icon-item",
                        key: v,
                        onClick: (p) => i(v)
                      }, [
                        c("div", C9, [
                          (m(), B(me(`el-icon-${x(ve)(v)}`)))
                        ]),
                        c(
                          "div",
                          A9,
                          se(v),
                          1
                          /* TEXT */
                        )
                      ], 8, b9))),
                      128
                      /* KEYED_FRAGMENT */
                    ))
                  ])
                ]),
                _: 1
                /* STABLE */
              })
            ]),
            _: 1
            /* STABLE */
          }, 8, ["title", "modelValue"])
        ],
        64
        /* STABLE_FRAGMENT */
      );
    };
  }
}), E9 = /* @__PURE__ */ Ye(x9, [["__scopeId", "data-v-c565d62d"]]), S9 = {
  install(t) {
    t.component("x-choose-icon", E9);
  }
}, M9 = { class: "trend" }, D9 = { key: 1 }, T9 = { class: "icon" }, R9 = /* @__PURE__ */ f({
  __name: "index",
  props: {
    // 标记当前趋势是上升还是下降
    type: {
      type: String,
      default: "up"
    },
    // 趋势显示的文字
    // 1.父组件传递过来的数据
    // 2.插槽
    text: {
      type: String,
      default: "文字"
    },
    // 颜色反转只在默认的颜色下生效 如果使用了自定义颜色 这个属性就不生效
    reverseColor: {
      type: Boolean,
      default: !1
    },
    // 上升趋势图标颜色
    upIconColor: {
      type: String,
      default: "#f5222d"
    },
    // 下降趋势图标颜色
    downIconColor: {
      type: String,
      default: "#52c41a"
    },
    // 上升趋势文字颜色
    upTextColor: {
      type: String,
      default: "rgb(0,0,0)"
    },
    // 下降趋势文字颜色
    downTextColor: {
      type: String,
      default: "rgb(0,0,0)"
    },
    // 上升趋势显示的图标
    upIcon: {
      type: String,
      default: "ArrowUp"
    },
    // 下降趋势显示的图标
    downIcon: {
      type: String,
      default: "ArrowDown"
    }
  },
  setup(t) {
    let e = t;
    Qe(() => {
      e.reverseColor;
    });
    let n = I(() => e.type === "up" ? e.upTextColor : e.downTextColor), a = P1();
    return (r, o) => (m(), h("div", M9, [
      c(
        "div",
        {
          class: "text",
          style: St({ color: x(n) })
        },
        [
          x(a).default ? de(r.$slots, "default", { key: 0 }, void 0, !0) : (m(), h(
            "div",
            D9,
            se(t.text),
            1
            /* TEXT */
          ))
        ],
        4
        /* STYLE */
      ),
      c("div", T9, [
        t.type === "up" ? (m(), B(me(`el-icon-${x(ve)(t.upIcon)}`), {
          key: 0,
          style: St({ color: t.reverseColor ? t.downIconColor : t.upIconColor })
        }, null, 8, ["style"])) : J("v-if", !0),
        t.type === "down" ? (m(), B(me(`el-icon-${x(ve)(t.downIcon)}`), {
          key: 1,
          style: St({ color: t.reverseColor ? t.upIconColor : t.downIconColor })
        }, null, 8, ["style"])) : J("v-if", !0)
      ])
    ]));
  }
}), H9 = /* @__PURE__ */ Ye(R9, [["__scopeId", "data-v-1587162a"]]), I9 = {
  install(t) {
    t.component("x-trend", H9);
  }
}, k9 = /* @__PURE__ */ f({
  __name: "index",
  props: {
    // 显示的图标
    icon: {
      type: String,
      default: "Bell"
    },
    // 通知数量
    value: {
      type: [String, Number],
      default: ""
    },
    // 最大值
    max: {
      type: Number
    },
    // 是否显示小圆点
    isDot: {
      type: Boolean,
      default: !1
    }
  },
  setup(t) {
    return (e, n) => {
      const a = q("el-badge"), r = q("el-popover");
      return m(), B(r, {
        "popper-class": "notification-popper-class",
        width: 300,
        placement: "bottom",
        trigger: "click"
      }, {
        default: U(() => [
          de(e.$slots, "default", {}, void 0, !0)
        ]),
        reference: U(() => [
          F(a, {
            style: { cursor: "pointer" },
            value: t.value,
            max: t.max,
            "is-dot": t.isDot
          }, {
            default: U(() => [
              (m(), B(me(`el-icon-${x(ve)(t.icon)}`)))
            ]),
            _: 1
            /* STABLE */
          }, 8, ["value", "max", "is-dot"])
        ]),
        _: 3
        /* FORWARDED */
      });
    };
  }
}), z9 = /* @__PURE__ */ Ye(k9, [["__scopeId", "data-v-37d60349"]]), V9 = {
  install(t) {
    t.component("x-notification", z9);
  }
}, O9 = ["onClick"], B9 = {
  key: 0,
  class: "avatar"
}, L9 = { class: "content" }, N9 = {
  key: 0,
  class: "title"
}, P9 = {
  key: 1,
  class: "time"
}, j9 = {
  key: 2,
  class: "time"
}, q9 = { class: "actions" }, F9 = ["onClick"], U9 = {
  key: 0,
  class: "a-icon"
}, W9 = { class: "a-text" }, G9 = /* @__PURE__ */ f({
  __name: "index",
  props: {
    // 列表的内容
    list: {
      type: Array,
      required: !0
    },
    // 操作的内容
    actions: {
      type: Array,
      default: () => []
    }
  },
  emits: ["clickItem", "clickAction"],
  setup(t, { emit: e }) {
    let n = e;
    const a = (o, i) => {
      n("clickItem", { item: o, index: i });
    }, r = (o, i) => {
      n("clickAction", { item: o, index: i });
    };
    return (o, i) => {
      const l = q("el-avatar"), s = q("el-tag"), u = q("el-scrollbar"), d = q("el-tab-pane"), g = q("el-tabs");
      return m(), B(g, { class: "list-tabs__item" }, {
        default: U(() => [
          (m(!0), h(
            ee,
            null,
            ue(t.list, (v, p) => (m(), B(d, {
              key: p,
              label: v.title
            }, {
              default: U(() => [
                F(
                  u,
                  { "max-height": "300px" },
                  {
                    default: U(() => [
                      (m(!0), h(
                        ee,
                        null,
                        ue(v.content, (w, _) => (m(), h("div", {
                          class: "container",
                          key: _,
                          onClick: (y) => a(w, _)
                        }, [
                          w.avatar ? (m(), h("div", B9, [
                            F(l, {
                              size: "small",
                              src: w.avatar
                            }, null, 8, ["src"])
                          ])) : J("v-if", !0),
                          c("div", L9, [
                            w.title ? (m(), h("div", N9, [
                              c(
                                "div",
                                null,
                                se(w.title),
                                1
                                /* TEXT */
                              ),
                              w.tag ? (m(), B(s, {
                                key: 0,
                                size: "small",
                                type: w.tagType || void 0
                              }, {
                                default: U(() => [
                                  Fl(
                                    se(w.tag),
                                    1
                                    /* TEXT */
                                  )
                                ]),
                                _: 2
                                /* DYNAMIC */
                              }, 1032, ["type"])) : J("v-if", !0)
                            ])) : J("v-if", !0),
                            w.desc ? (m(), h(
                              "div",
                              P9,
                              se(w.desc),
                              1
                              /* TEXT */
                            )) : J("v-if", !0),
                            w.time ? (m(), h(
                              "div",
                              j9,
                              se(w.time),
                              1
                              /* TEXT */
                            )) : J("v-if", !0)
                          ])
                        ], 8, O9))),
                        128
                        /* KEYED_FRAGMENT */
                      )),
                      c("div", q9, [
                        (m(!0), h(
                          ee,
                          null,
                          ue(t.actions, (w, _) => (m(), h("div", {
                            class: be(["a-item", { border: _ !== t.actions.length }]),
                            key: _,
                            onClick: (y) => r(w, _)
                          }, [
                            w.icon ? (m(), h("div", U9, [
                              (m(), B(me(`el-icon-${x(ve)(w.icon)}`)))
                            ])) : J("v-if", !0),
                            c(
                              "div",
                              W9,
                              se(w.text),
                              1
                              /* TEXT */
                            )
                          ], 10, F9))),
                          128
                          /* KEYED_FRAGMENT */
                        ))
                      ])
                    ]),
                    _: 2
                    /* DYNAMIC */
                  },
                  1024
                  /* DYNAMIC_SLOTS */
                )
              ]),
              _: 2
              /* DYNAMIC */
            }, 1032, ["label"]))),
            128
            /* KEYED_FRAGMENT */
          ))
        ]),
        _: 1
        /* STABLE */
      });
    };
  }
}), $9 = /* @__PURE__ */ Ye(G9, [["__scopeId", "data-v-34f77142"]]), Q9 = {
  install(t) {
    t.component("x-list", $9);
  }
}, Y9 = /* @__PURE__ */ f({
  __name: "index",
  props: {
    // 导航菜单的数据
    data: {
      type: Array,
      required: !0
    },
    // 默认选中菜单
    defaultActive: {
      type: String,
      default: ""
    },
    // 是否是路由模式
    router: {
      type: Boolean,
      default: !1
    }
  },
  setup(t) {
    return (e, n) => {
      const a = q("el-menu-item"), r = q("el-sub-menu"), o = q("el-menu");
      return m(), B(o, _e({
        "default-active": t.defaultActive,
        router: t.router
      }, e.$attrs), {
        default: U(() => [
          (m(!0), h(
            ee,
            null,
            ue(t.data, (i, l) => (m(), h(
              ee,
              { key: l },
              [
                !i.children || !i.children.length ? (m(), B(a, {
                  key: 0,
                  index: i.index
                }, {
                  default: U(() => [
                    i.icon ? (m(), B(me(`el-icon-${x(ve)(i.icon)}`), { key: 0 })) : J("v-if", !0),
                    c(
                      "span",
                      null,
                      se(i.name),
                      1
                      /* TEXT */
                    )
                  ]),
                  _: 2
                  /* DYNAMIC */
                }, 1032, ["index"])) : (m(), B(r, {
                  key: 1,
                  index: i.index
                }, {
                  title: U(() => [
                    i.icon ? (m(), B(me(`el-icon-${x(ve)(i.icon)}`), { key: 0 })) : J("v-if", !0),
                    c(
                      "span",
                      null,
                      se(i.name),
                      1
                      /* TEXT */
                    )
                  ]),
                  default: U(() => [
                    (m(!0), h(
                      ee,
                      null,
                      ue(i.children, (s, u) => (m(), B(a, {
                        key: u,
                        index: s.index
                      }, {
                        default: U(() => [
                          s.icon ? (m(), B(me(`el-icon-${x(ve)(s.icon)}`), { key: 0 })) : J("v-if", !0),
                          c(
                            "span",
                            null,
                            se(s.name),
                            1
                            /* TEXT */
                          )
                        ]),
                        _: 2
                        /* DYNAMIC */
                      }, 1032, ["index"]))),
                      128
                      /* KEYED_FRAGMENT */
                    ))
                  ]),
                  _: 2
                  /* DYNAMIC */
                }, 1032, ["index"]))
              ],
              64
              /* STABLE_FRAGMENT */
            ))),
            128
            /* KEYED_FRAGMENT */
          ))
        ]),
        _: 1
        /* STABLE */
      }, 16, ["default-active", "router"]);
    };
  }
}), Z9 = /* @__PURE__ */ Ye(Y9, [["__scopeId", "data-v-47910684"]]);
function K9(t) {
  return typeof t == "function" || Object.prototype.toString.call(t) === "[object Object]" && !Eo(t);
}
const X9 = /* @__PURE__ */ f({
  props: {
    // 导航菜单的数据
    data: {
      type: Array,
      required: !0
    },
    // 默认选中菜单
    defaultActive: {
      type: String,
      default: ""
    },
    // 是否是路由模式
    router: {
      type: Boolean,
      default: !1
    }
  },
  setup(t) {
    const e = (a) => a.map((r) => {
      const o = {
        title: () => F(ee, null, [F("span", null, [r.name])])
      };
      return r.children && r.children.length ? F(q("el-sub-menu"), {
        index: r.index
      }, {
        default: () => [e(r.children)],
        ...o
      }) : F(q("el-menu-item"), {
        index: r.index
      }, {
        default: () => [F("span", null, [r.name])]
      });
    }), n = j1();
    return () => {
      let a;
      return F(q("el-menu"), _e({
        class: "menu-icon-svg",
        "default-active": t.defaultActive,
        router: t.router
      }, n), K9(a = e(t.data)) ? a : {
        default: () => [a]
      });
    };
  }
}), J9 = {
  install(t) {
    t.component("x-menu", Z9), t.component("x-infinite-menu", X9);
  }
}, e_ = /* @__PURE__ */ f({
  __name: "index",
  props: {
    // 进度条进度
    percentage: {
      type: Number,
      default: 0
    },
    // 进度条是否有动画效果
    isAnimation: {
      type: Boolean,
      default: !1
    },
    // 动画时长(ms)
    time: {
      type: Number,
      default: 3e3
    }
  },
  setup(t) {
    let e = t, n = N(0);
    return Qe(() => {
      if (e.isAnimation) {
        let a = Math.ceil(e.time / e.percentage), r = setInterval(() => {
          n.value++, n.value >= e.percentage && (n.value = e.percentage, clearInterval(r));
        }, a);
      } else
        n.value = e.percentage;
    }), (a, r) => {
      const o = q("el-progress");
      return m(), B(o, _e({
        isAnimation: "",
        percentage: x(n)
      }, a.$attrs), null, 16, ["percentage"]);
    };
  }
}), t_ = {
  install(t) {
    t.component("x-progress", e_);
  }
}, n_ = { style: { display: "flex" } }, a_ = { style: { "margin-right": "20px" } }, r_ = /* @__PURE__ */ f({
  __name: "index",
  props: {
    startPlaceholder: { type: String, default: "请选择开始时间" },
    startTimeStart: { type: String, default: "08:00" },
    startStep: { type: String, default: "00:30" },
    startTimeEnd: { type: String, default: "24:00" },
    endPlaceholder: { type: String, default: "请选择结束时间" },
    endTimeStart: { type: String, default: "08:00" },
    endStep: { type: String, default: "00:30" },
    endTimeEnd: { type: String, default: "24:00" }
  },
  emits: ["startChange", "endChange"],
  setup(t, { emit: e }) {
    let n = e, a = N(""), r = N(""), o = N(!0);
    return le(a, (i) => {
      i ? (o.value = !1, n("startChange", i)) : (r.value = "", o.value = !0);
    }), le(r, (i) => {
      i && n("endChange", { startTime: a.value, endTime: i });
    }), (i, l) => {
      const s = q("el-time-select");
      return m(), h("div", n_, [
        c("div", a_, [
          F(s, _e({
            modelValue: x(a),
            "onUpdate:modelValue": l[0] || (l[0] = (u) => Ce(a) ? a.value = u : a = u),
            style: { width: "240px" },
            placeholder: t.startPlaceholder,
            start: t.startTimeStart,
            step: t.startStep,
            end: t.startTimeEnd,
            "max-time": x(r) || void 0
          }, i.$attrs.startOptions || {}), null, 16, ["modelValue", "placeholder", "start", "step", "end", "max-time"])
        ]),
        c("div", null, [
          F(s, _e({
            modelValue: x(r),
            "onUpdate:modelValue": l[1] || (l[1] = (u) => Ce(r) ? r.value = u : r = u),
            style: { width: "240px" },
            placeholder: t.endPlaceholder,
            start: t.endTimeStart,
            step: t.endStep,
            end: t.endTimeEnd,
            "min-time": x(a) || void 0,
            disabled: x(o)
          }, i.$attrs.endOptions || {}), null, 16, ["modelValue", "placeholder", "start", "step", "end", "min-time", "disabled"])
        ])
      ]);
    };
  }
}), o_ = {
  install(t) {
    t.component("x-choose-time", r_);
  }
}, i_ = { style: { display: "flex" } }, l_ = { style: { "margin-right": "20px" } }, s_ = { style: { "margin-right": "20px" } }, c_ = /* @__PURE__ */ f({
  __name: "index",
  props: {
    startPlaceholder: {
      type: String,
      default: "请选择开始时间"
    },
    endPlaceholder: {
      type: String,
      default: "请选择结束时间"
    },
    // 是否禁用选择今天之前的日期
    disableToday: {
      type: Boolean,
      default: !0
    }
  },
  emits: ["startChange", "endChange"],
  setup(t, { emit: e }) {
    let n = t, a = e, r = N(null), o = N(null), i = N(!0), l = (u) => {
      if (n.disableToday) return u.getTime() < Date.now() - 1e3 * 60 * 60 * 24;
    }, s = (u) => {
      if (r.value)
        return u.getTime() < r.value.getTime() + 1e3 * 60 * 60 * 24;
    };
    return le(() => r.value, (u) => {
      u ? (i.value = !1, a("startChange", u)) : (o.value = null, i.value = !0);
    }), le(() => o.value, (u) => {
      u && a("endChange", {
        startDate: r.value,
        endDate: u
      });
    }), (u, d) => {
      const g = q("el-date-picker");
      return m(), h("div", i_, [
        c("div", l_, [
          F(g, _e({
            modelValue: x(r),
            "onUpdate:modelValue": d[0] || (d[0] = (v) => Ce(r) ? r.value = v : r = v),
            type: "date",
            placeholder: t.startPlaceholder,
            "disabled-date": x(l)
          }, u.$attrs.startOptions || {}), null, 16, ["modelValue", "placeholder", "disabled-date"])
        ]),
        c("div", s_, [
          F(g, _e({
            modelValue: x(o),
            "onUpdate:modelValue": d[1] || (d[1] = (v) => Ce(o) ? o.value = v : o = v),
            type: "date",
            placeholder: t.endPlaceholder,
            disabled: x(i),
            "disabled-date": x(s)
          }, u.$attrs.endOptions || {}), null, 16, ["modelValue", "placeholder", "disabled", "disabled-date"])
        ])
      ]);
    };
  }
}), d_ = {
  install(t) {
    t.component("x-choose-date", c_);
  }
}, u_ = /* @__PURE__ */ f({
  __name: "index",
  emits: ["trimInput"],
  setup(t, { emit: e }) {
    let n = N();
    return n.value = n.value?.trim(), e("trimInput", n.value), (r, o) => {
      const i = q("el-input");
      return m(), B(i, {
        modelValue: x(n),
        "onUpdate:modelValue": o[0] || (o[0] = (l) => Ce(n) ? n.value = l : n = l),
        style: { width: "240px" },
        placeholder: "Please input"
      }, null, 8, ["modelValue"]);
    };
  }
}), m_ = {
  install(t) {
    t.component("x-input", u_);
  }
};
var $n, P2;
function h_() {
  if (P2) return $n;
  P2 = 1;
  function t() {
    this.__data__ = [], this.size = 0;
  }
  return $n = t, $n;
}
var Qn, j2;
function vs() {
  if (j2) return Qn;
  j2 = 1;
  function t(e, n) {
    return e === n || e !== e && n !== n;
  }
  return Qn = t, Qn;
}
var Yn, q2;
function Rn() {
  if (q2) return Yn;
  q2 = 1;
  var t = vs();
  function e(n, a) {
    for (var r = n.length; r--; )
      if (t(n[r][0], a))
        return r;
    return -1;
  }
  return Yn = e, Yn;
}
var Zn, F2;
function f_() {
  if (F2) return Zn;
  F2 = 1;
  var t = Rn(), e = Array.prototype, n = e.splice;
  function a(r) {
    var o = this.__data__, i = t(o, r);
    if (i < 0)
      return !1;
    var l = o.length - 1;
    return i == l ? o.pop() : n.call(o, i, 1), --this.size, !0;
  }
  return Zn = a, Zn;
}
var Kn, U2;
function p_() {
  if (U2) return Kn;
  U2 = 1;
  var t = Rn();
  function e(n) {
    var a = this.__data__, r = t(a, n);
    return r < 0 ? void 0 : a[r][1];
  }
  return Kn = e, Kn;
}
var Xn, W2;
function g_() {
  if (W2) return Xn;
  W2 = 1;
  var t = Rn();
  function e(n) {
    return t(this.__data__, n) > -1;
  }
  return Xn = e, Xn;
}
var Jn, G2;
function v_() {
  if (G2) return Jn;
  G2 = 1;
  var t = Rn();
  function e(n, a) {
    var r = this.__data__, o = t(r, n);
    return o < 0 ? (++this.size, r.push([n, a])) : r[o][1] = a, this;
  }
  return Jn = e, Jn;
}
var ea, $2;
function Hn() {
  if ($2) return ea;
  $2 = 1;
  var t = h_(), e = f_(), n = p_(), a = g_(), r = v_();
  function o(i) {
    var l = -1, s = i == null ? 0 : i.length;
    for (this.clear(); ++l < s; ) {
      var u = i[l];
      this.set(u[0], u[1]);
    }
  }
  return o.prototype.clear = t, o.prototype.delete = e, o.prototype.get = n, o.prototype.has = a, o.prototype.set = r, ea = o, ea;
}
var ta, Q2;
function __() {
  if (Q2) return ta;
  Q2 = 1;
  var t = Hn();
  function e() {
    this.__data__ = new t(), this.size = 0;
  }
  return ta = e, ta;
}
var na, Y2;
function w_() {
  if (Y2) return na;
  Y2 = 1;
  function t(e) {
    var n = this.__data__, a = n.delete(e);
    return this.size = n.size, a;
  }
  return na = t, na;
}
var aa, Z2;
function y_() {
  if (Z2) return aa;
  Z2 = 1;
  function t(e) {
    return this.__data__.get(e);
  }
  return aa = t, aa;
}
var ra, K2;
function b_() {
  if (K2) return ra;
  K2 = 1;
  function t(e) {
    return this.__data__.has(e);
  }
  return ra = t, ra;
}
var oa, X2;
function _s() {
  if (X2) return oa;
  X2 = 1;
  var t = typeof Yt == "object" && Yt && Yt.Object === Object && Yt;
  return oa = t, oa;
}
var ia, J2;
function ye() {
  if (J2) return ia;
  J2 = 1;
  var t = _s(), e = typeof self == "object" && self && self.Object === Object && self, n = t || e || Function("return this")();
  return ia = n, ia;
}
var la, e0;
function zo() {
  if (e0) return la;
  e0 = 1;
  var t = ye(), e = t.Symbol;
  return la = e, la;
}
var sa, t0;
function C_() {
  if (t0) return sa;
  t0 = 1;
  var t = zo(), e = Object.prototype, n = e.hasOwnProperty, a = e.toString, r = t ? t.toStringTag : void 0;
  function o(i) {
    var l = n.call(i, r), s = i[r];
    try {
      i[r] = void 0;
      var u = !0;
    } catch {
    }
    var d = a.call(i);
    return u && (l ? i[r] = s : delete i[r]), d;
  }
  return sa = o, sa;
}
var ca, n0;
function A_() {
  if (n0) return ca;
  n0 = 1;
  var t = Object.prototype, e = t.toString;
  function n(a) {
    return e.call(a);
  }
  return ca = n, ca;
}
var da, a0;
function In() {
  if (a0) return da;
  a0 = 1;
  var t = zo(), e = C_(), n = A_(), a = "[object Null]", r = "[object Undefined]", o = t ? t.toStringTag : void 0;
  function i(l) {
    return l == null ? l === void 0 ? r : a : o && o in Object(l) ? e(l) : n(l);
  }
  return da = i, da;
}
var ua, r0;
function Nt() {
  if (r0) return ua;
  r0 = 1;
  function t(e) {
    var n = typeof e;
    return e != null && (n == "object" || n == "function");
  }
  return ua = t, ua;
}
var ma, o0;
function ws() {
  if (o0) return ma;
  o0 = 1;
  var t = In(), e = Nt(), n = "[object AsyncFunction]", a = "[object Function]", r = "[object GeneratorFunction]", o = "[object Proxy]";
  function i(l) {
    if (!e(l))
      return !1;
    var s = t(l);
    return s == a || s == r || s == n || s == o;
  }
  return ma = i, ma;
}
var ha, i0;
function x_() {
  if (i0) return ha;
  i0 = 1;
  var t = ye(), e = t["__core-js_shared__"];
  return ha = e, ha;
}
var fa, l0;
function E_() {
  if (l0) return fa;
  l0 = 1;
  var t = x_(), e = (function() {
    var a = /[^.]+$/.exec(t && t.keys && t.keys.IE_PROTO || "");
    return a ? "Symbol(src)_1." + a : "";
  })();
  function n(a) {
    return !!e && e in a;
  }
  return fa = n, fa;
}
var pa, s0;
function ys() {
  if (s0) return pa;
  s0 = 1;
  var t = Function.prototype, e = t.toString;
  function n(a) {
    if (a != null) {
      try {
        return e.call(a);
      } catch {
      }
      try {
        return a + "";
      } catch {
      }
    }
    return "";
  }
  return pa = n, pa;
}
var ga, c0;
function S_() {
  if (c0) return ga;
  c0 = 1;
  var t = ws(), e = E_(), n = Nt(), a = ys(), r = /[\\^$.*+?()[\]{}|]/g, o = /^\[object .+?Constructor\]$/, i = Function.prototype, l = Object.prototype, s = i.toString, u = l.hasOwnProperty, d = RegExp(
    "^" + s.call(u).replace(r, "\\$&").replace(/hasOwnProperty|(function).*?(?=\\\()| for .+?(?=\\\])/g, "$1.*?") + "$"
  );
  function g(v) {
    if (!n(v) || e(v))
      return !1;
    var p = t(v) ? d : o;
    return p.test(a(v));
  }
  return ga = g, ga;
}
var va, d0;
function M_() {
  if (d0) return va;
  d0 = 1;
  function t(e, n) {
    return e?.[n];
  }
  return va = t, va;
}
var _a, u0;
function Xe() {
  if (u0) return _a;
  u0 = 1;
  var t = S_(), e = M_();
  function n(a, r) {
    var o = e(a, r);
    return t(o) ? o : void 0;
  }
  return _a = n, _a;
}
var wa, m0;
function Vo() {
  if (m0) return wa;
  m0 = 1;
  var t = Xe(), e = ye(), n = t(e, "Map");
  return wa = n, wa;
}
var ya, h0;
function kn() {
  if (h0) return ya;
  h0 = 1;
  var t = Xe(), e = t(Object, "create");
  return ya = e, ya;
}
var ba, f0;
function D_() {
  if (f0) return ba;
  f0 = 1;
  var t = kn();
  function e() {
    this.__data__ = t ? t(null) : {}, this.size = 0;
  }
  return ba = e, ba;
}
var Ca, p0;
function T_() {
  if (p0) return Ca;
  p0 = 1;
  function t(e) {
    var n = this.has(e) && delete this.__data__[e];
    return this.size -= n ? 1 : 0, n;
  }
  return Ca = t, Ca;
}
var Aa, g0;
function R_() {
  if (g0) return Aa;
  g0 = 1;
  var t = kn(), e = "__lodash_hash_undefined__", n = Object.prototype, a = n.hasOwnProperty;
  function r(o) {
    var i = this.__data__;
    if (t) {
      var l = i[o];
      return l === e ? void 0 : l;
    }
    return a.call(i, o) ? i[o] : void 0;
  }
  return Aa = r, Aa;
}
var xa, v0;
function H_() {
  if (v0) return xa;
  v0 = 1;
  var t = kn(), e = Object.prototype, n = e.hasOwnProperty;
  function a(r) {
    var o = this.__data__;
    return t ? o[r] !== void 0 : n.call(o, r);
  }
  return xa = a, xa;
}
var Ea, _0;
function I_() {
  if (_0) return Ea;
  _0 = 1;
  var t = kn(), e = "__lodash_hash_undefined__";
  function n(a, r) {
    var o = this.__data__;
    return this.size += this.has(a) ? 0 : 1, o[a] = t && r === void 0 ? e : r, this;
  }
  return Ea = n, Ea;
}
var Sa, w0;
function k_() {
  if (w0) return Sa;
  w0 = 1;
  var t = D_(), e = T_(), n = R_(), a = H_(), r = I_();
  function o(i) {
    var l = -1, s = i == null ? 0 : i.length;
    for (this.clear(); ++l < s; ) {
      var u = i[l];
      this.set(u[0], u[1]);
    }
  }
  return o.prototype.clear = t, o.prototype.delete = e, o.prototype.get = n, o.prototype.has = a, o.prototype.set = r, Sa = o, Sa;
}
var Ma, y0;
function z_() {
  if (y0) return Ma;
  y0 = 1;
  var t = k_(), e = Hn(), n = Vo();
  function a() {
    this.size = 0, this.__data__ = {
      hash: new t(),
      map: new (n || e)(),
      string: new t()
    };
  }
  return Ma = a, Ma;
}
var Da, b0;
function V_() {
  if (b0) return Da;
  b0 = 1;
  function t(e) {
    var n = typeof e;
    return n == "string" || n == "number" || n == "symbol" || n == "boolean" ? e !== "__proto__" : e === null;
  }
  return Da = t, Da;
}
var Ta, C0;
function zn() {
  if (C0) return Ta;
  C0 = 1;
  var t = V_();
  function e(n, a) {
    var r = n.__data__;
    return t(a) ? r[typeof a == "string" ? "string" : "hash"] : r.map;
  }
  return Ta = e, Ta;
}
var Ra, A0;
function O_() {
  if (A0) return Ra;
  A0 = 1;
  var t = zn();
  function e(n) {
    var a = t(this, n).delete(n);
    return this.size -= a ? 1 : 0, a;
  }
  return Ra = e, Ra;
}
var Ha, x0;
function B_() {
  if (x0) return Ha;
  x0 = 1;
  var t = zn();
  function e(n) {
    return t(this, n).get(n);
  }
  return Ha = e, Ha;
}
var Ia, E0;
function L_() {
  if (E0) return Ia;
  E0 = 1;
  var t = zn();
  function e(n) {
    return t(this, n).has(n);
  }
  return Ia = e, Ia;
}
var ka, S0;
function N_() {
  if (S0) return ka;
  S0 = 1;
  var t = zn();
  function e(n, a) {
    var r = t(this, n), o = r.size;
    return r.set(n, a), this.size += r.size == o ? 0 : 1, this;
  }
  return ka = e, ka;
}
var za, M0;
function P_() {
  if (M0) return za;
  M0 = 1;
  var t = z_(), e = O_(), n = B_(), a = L_(), r = N_();
  function o(i) {
    var l = -1, s = i == null ? 0 : i.length;
    for (this.clear(); ++l < s; ) {
      var u = i[l];
      this.set(u[0], u[1]);
    }
  }
  return o.prototype.clear = t, o.prototype.delete = e, o.prototype.get = n, o.prototype.has = a, o.prototype.set = r, za = o, za;
}
var Va, D0;
function j_() {
  if (D0) return Va;
  D0 = 1;
  var t = Hn(), e = Vo(), n = P_(), a = 200;
  function r(o, i) {
    var l = this.__data__;
    if (l instanceof t) {
      var s = l.__data__;
      if (!e || s.length < a - 1)
        return s.push([o, i]), this.size = ++l.size, this;
      l = this.__data__ = new n(s);
    }
    return l.set(o, i), this.size = l.size, this;
  }
  return Va = r, Va;
}
var Oa, T0;
function q_() {
  if (T0) return Oa;
  T0 = 1;
  var t = Hn(), e = __(), n = w_(), a = y_(), r = b_(), o = j_();
  function i(l) {
    var s = this.__data__ = new t(l);
    this.size = s.size;
  }
  return i.prototype.clear = e, i.prototype.delete = n, i.prototype.get = a, i.prototype.has = r, i.prototype.set = o, Oa = i, Oa;
}
var Ba, R0;
function F_() {
  if (R0) return Ba;
  R0 = 1;
  function t(e, n) {
    for (var a = -1, r = e == null ? 0 : e.length; ++a < r && n(e[a], a, e) !== !1; )
      ;
    return e;
  }
  return Ba = t, Ba;
}
var La, H0;
function U_() {
  if (H0) return La;
  H0 = 1;
  var t = Xe(), e = (function() {
    try {
      var n = t(Object, "defineProperty");
      return n({}, "", {}), n;
    } catch {
    }
  })();
  return La = e, La;
}
var Na, I0;
function bs() {
  if (I0) return Na;
  I0 = 1;
  var t = U_();
  function e(n, a, r) {
    a == "__proto__" && t ? t(n, a, {
      configurable: !0,
      enumerable: !0,
      value: r,
      writable: !0
    }) : n[a] = r;
  }
  return Na = e, Na;
}
var Pa, k0;
function Cs() {
  if (k0) return Pa;
  k0 = 1;
  var t = bs(), e = vs(), n = Object.prototype, a = n.hasOwnProperty;
  function r(o, i, l) {
    var s = o[i];
    (!(a.call(o, i) && e(s, l)) || l === void 0 && !(i in o)) && t(o, i, l);
  }
  return Pa = r, Pa;
}
var ja, z0;
function Vn() {
  if (z0) return ja;
  z0 = 1;
  var t = Cs(), e = bs();
  function n(a, r, o, i) {
    var l = !o;
    o || (o = {});
    for (var s = -1, u = r.length; ++s < u; ) {
      var d = r[s], g = i ? i(o[d], a[d], d, o, a) : void 0;
      g === void 0 && (g = a[d]), l ? e(o, d, g) : t(o, d, g);
    }
    return o;
  }
  return ja = n, ja;
}
var qa, V0;
function W_() {
  if (V0) return qa;
  V0 = 1;
  function t(e, n) {
    for (var a = -1, r = Array(e); ++a < e; )
      r[a] = n(a);
    return r;
  }
  return qa = t, qa;
}
var Fa, O0;
function Pt() {
  if (O0) return Fa;
  O0 = 1;
  function t(e) {
    return e != null && typeof e == "object";
  }
  return Fa = t, Fa;
}
var Ua, B0;
function G_() {
  if (B0) return Ua;
  B0 = 1;
  var t = In(), e = Pt(), n = "[object Arguments]";
  function a(r) {
    return e(r) && t(r) == n;
  }
  return Ua = a, Ua;
}
var Wa, L0;
function $_() {
  if (L0) return Wa;
  L0 = 1;
  var t = G_(), e = Pt(), n = Object.prototype, a = n.hasOwnProperty, r = n.propertyIsEnumerable, o = t(/* @__PURE__ */ (function() {
    return arguments;
  })()) ? t : function(i) {
    return e(i) && a.call(i, "callee") && !r.call(i, "callee");
  };
  return Wa = o, Wa;
}
var Ga, N0;
function Oo() {
  if (N0) return Ga;
  N0 = 1;
  var t = Array.isArray;
  return Ga = t, Ga;
}
var At = { exports: {} }, $a, P0;
function Q_() {
  if (P0) return $a;
  P0 = 1;
  function t() {
    return !1;
  }
  return $a = t, $a;
}
At.exports;
var j0;
function As() {
  return j0 || (j0 = 1, (function(t, e) {
    var n = ye(), a = Q_(), r = e && !e.nodeType && e, o = r && !0 && t && !t.nodeType && t, i = o && o.exports === r, l = i ? n.Buffer : void 0, s = l ? l.isBuffer : void 0, u = s || a;
    t.exports = u;
  })(At, At.exports)), At.exports;
}
var Qa, q0;
function Y_() {
  if (q0) return Qa;
  q0 = 1;
  var t = 9007199254740991, e = /^(?:0|[1-9]\d*)$/;
  function n(a, r) {
    var o = typeof a;
    return r = r ?? t, !!r && (o == "number" || o != "symbol" && e.test(a)) && a > -1 && a % 1 == 0 && a < r;
  }
  return Qa = n, Qa;
}
var Ya, F0;
function xs() {
  if (F0) return Ya;
  F0 = 1;
  var t = 9007199254740991;
  function e(n) {
    return typeof n == "number" && n > -1 && n % 1 == 0 && n <= t;
  }
  return Ya = e, Ya;
}
var Za, U0;
function Z_() {
  if (U0) return Za;
  U0 = 1;
  var t = In(), e = xs(), n = Pt(), a = "[object Arguments]", r = "[object Array]", o = "[object Boolean]", i = "[object Date]", l = "[object Error]", s = "[object Function]", u = "[object Map]", d = "[object Number]", g = "[object Object]", v = "[object RegExp]", p = "[object Set]", w = "[object String]", _ = "[object WeakMap]", y = "[object ArrayBuffer]", A = "[object DataView]", E = "[object Float32Array]", S = "[object Float64Array]", M = "[object Int8Array]", P = "[object Int16Array]", z = "[object Int32Array]", T = "[object Uint8Array]", R = "[object Uint8ClampedArray]", H = "[object Uint16Array]", Q = "[object Uint32Array]", V = {};
  V[E] = V[S] = V[M] = V[P] = V[z] = V[T] = V[R] = V[H] = V[Q] = !0, V[a] = V[r] = V[y] = V[o] = V[A] = V[i] = V[l] = V[s] = V[u] = V[d] = V[g] = V[v] = V[p] = V[w] = V[_] = !1;
  function k(Ve) {
    return n(Ve) && e(Ve.length) && !!V[t(Ve)];
  }
  return Za = k, Za;
}
var Ka, W0;
function Bo() {
  if (W0) return Ka;
  W0 = 1;
  function t(e) {
    return function(n) {
      return e(n);
    };
  }
  return Ka = t, Ka;
}
var xt = { exports: {} };
xt.exports;
var G0;
function Lo() {
  return G0 || (G0 = 1, (function(t, e) {
    var n = _s(), a = e && !e.nodeType && e, r = a && !0 && t && !t.nodeType && t, o = r && r.exports === a, i = o && n.process, l = (function() {
      try {
        var s = r && r.require && r.require("util").types;
        return s || i && i.binding && i.binding("util");
      } catch {
      }
    })();
    t.exports = l;
  })(xt, xt.exports)), xt.exports;
}
var Xa, $0;
function K_() {
  if ($0) return Xa;
  $0 = 1;
  var t = Z_(), e = Bo(), n = Lo(), a = n && n.isTypedArray, r = a ? e(a) : t;
  return Xa = r, Xa;
}
var Ja, Q0;
function Es() {
  if (Q0) return Ja;
  Q0 = 1;
  var t = W_(), e = $_(), n = Oo(), a = As(), r = Y_(), o = K_(), i = Object.prototype, l = i.hasOwnProperty;
  function s(u, d) {
    var g = n(u), v = !g && e(u), p = !g && !v && a(u), w = !g && !v && !p && o(u), _ = g || v || p || w, y = _ ? t(u.length, String) : [], A = y.length;
    for (var E in u)
      (d || l.call(u, E)) && !(_ && // Safari 9 has enumerable `arguments.length` in strict mode.
      (E == "length" || // Node.js 0.10 has enumerable non-index properties on buffers.
      p && (E == "offset" || E == "parent") || // PhantomJS 2 has enumerable non-index properties on typed arrays.
      w && (E == "buffer" || E == "byteLength" || E == "byteOffset") || // Skip index properties.
      r(E, A))) && y.push(E);
    return y;
  }
  return Ja = s, Ja;
}
var er, Y0;
function No() {
  if (Y0) return er;
  Y0 = 1;
  var t = Object.prototype;
  function e(n) {
    var a = n && n.constructor, r = typeof a == "function" && a.prototype || t;
    return n === r;
  }
  return er = e, er;
}
var tr, Z0;
function Ss() {
  if (Z0) return tr;
  Z0 = 1;
  function t(e, n) {
    return function(a) {
      return e(n(a));
    };
  }
  return tr = t, tr;
}
var nr, K0;
function X_() {
  if (K0) return nr;
  K0 = 1;
  var t = Ss(), e = t(Object.keys, Object);
  return nr = e, nr;
}
var ar, X0;
function J_() {
  if (X0) return ar;
  X0 = 1;
  var t = No(), e = X_(), n = Object.prototype, a = n.hasOwnProperty;
  function r(o) {
    if (!t(o))
      return e(o);
    var i = [];
    for (var l in Object(o))
      a.call(o, l) && l != "constructor" && i.push(l);
    return i;
  }
  return ar = r, ar;
}
var rr, J0;
function Ms() {
  if (J0) return rr;
  J0 = 1;
  var t = ws(), e = xs();
  function n(a) {
    return a != null && e(a.length) && !t(a);
  }
  return rr = n, rr;
}
var or, ei;
function Po() {
  if (ei) return or;
  ei = 1;
  var t = Es(), e = J_(), n = Ms();
  function a(r) {
    return n(r) ? t(r) : e(r);
  }
  return or = a, or;
}
var ir, ti;
function e7() {
  if (ti) return ir;
  ti = 1;
  var t = Vn(), e = Po();
  function n(a, r) {
    return a && t(r, e(r), a);
  }
  return ir = n, ir;
}
var lr, ni;
function t7() {
  if (ni) return lr;
  ni = 1;
  function t(e) {
    var n = [];
    if (e != null)
      for (var a in Object(e))
        n.push(a);
    return n;
  }
  return lr = t, lr;
}
var sr, ai;
function n7() {
  if (ai) return sr;
  ai = 1;
  var t = Nt(), e = No(), n = t7(), a = Object.prototype, r = a.hasOwnProperty;
  function o(i) {
    if (!t(i))
      return n(i);
    var l = e(i), s = [];
    for (var u in i)
      u == "constructor" && (l || !r.call(i, u)) || s.push(u);
    return s;
  }
  return sr = o, sr;
}
var cr, ri;
function jo() {
  if (ri) return cr;
  ri = 1;
  var t = Es(), e = n7(), n = Ms();
  function a(r) {
    return n(r) ? t(r, !0) : e(r);
  }
  return cr = a, cr;
}
var dr, oi;
function a7() {
  if (oi) return dr;
  oi = 1;
  var t = Vn(), e = jo();
  function n(a, r) {
    return a && t(r, e(r), a);
  }
  return dr = n, dr;
}
var Et = { exports: {} };
Et.exports;
var ii;
function r7() {
  return ii || (ii = 1, (function(t, e) {
    var n = ye(), a = e && !e.nodeType && e, r = a && !0 && t && !t.nodeType && t, o = r && r.exports === a, i = o ? n.Buffer : void 0, l = i ? i.allocUnsafe : void 0;
    function s(u, d) {
      if (d)
        return u.slice();
      var g = u.length, v = l ? l(g) : new u.constructor(g);
      return u.copy(v), v;
    }
    t.exports = s;
  })(Et, Et.exports)), Et.exports;
}
var ur, li;
function o7() {
  if (li) return ur;
  li = 1;
  function t(e, n) {
    var a = -1, r = e.length;
    for (n || (n = Array(r)); ++a < r; )
      n[a] = e[a];
    return n;
  }
  return ur = t, ur;
}
var mr, si;
function i7() {
  if (si) return mr;
  si = 1;
  function t(e, n) {
    for (var a = -1, r = e == null ? 0 : e.length, o = 0, i = []; ++a < r; ) {
      var l = e[a];
      n(l, a, e) && (i[o++] = l);
    }
    return i;
  }
  return mr = t, mr;
}
var hr, ci;
function Ds() {
  if (ci) return hr;
  ci = 1;
  function t() {
    return [];
  }
  return hr = t, hr;
}
var fr, di;
function qo() {
  if (di) return fr;
  di = 1;
  var t = i7(), e = Ds(), n = Object.prototype, a = n.propertyIsEnumerable, r = Object.getOwnPropertySymbols, o = r ? function(i) {
    return i == null ? [] : (i = Object(i), t(r(i), function(l) {
      return a.call(i, l);
    }));
  } : e;
  return fr = o, fr;
}
var pr, ui;
function l7() {
  if (ui) return pr;
  ui = 1;
  var t = Vn(), e = qo();
  function n(a, r) {
    return t(a, e(a), r);
  }
  return pr = n, pr;
}
var gr, mi;
function Ts() {
  if (mi) return gr;
  mi = 1;
  function t(e, n) {
    for (var a = -1, r = n.length, o = e.length; ++a < r; )
      e[o + a] = n[a];
    return e;
  }
  return gr = t, gr;
}
var vr, hi;
function Rs() {
  if (hi) return vr;
  hi = 1;
  var t = Ss(), e = t(Object.getPrototypeOf, Object);
  return vr = e, vr;
}
var _r, fi;
function Hs() {
  if (fi) return _r;
  fi = 1;
  var t = Ts(), e = Rs(), n = qo(), a = Ds(), r = Object.getOwnPropertySymbols, o = r ? function(i) {
    for (var l = []; i; )
      t(l, n(i)), i = e(i);
    return l;
  } : a;
  return _r = o, _r;
}
var wr, pi;
function s7() {
  if (pi) return wr;
  pi = 1;
  var t = Vn(), e = Hs();
  function n(a, r) {
    return t(a, e(a), r);
  }
  return wr = n, wr;
}
var yr, gi;
function Is() {
  if (gi) return yr;
  gi = 1;
  var t = Ts(), e = Oo();
  function n(a, r, o) {
    var i = r(a);
    return e(a) ? i : t(i, o(a));
  }
  return yr = n, yr;
}
var br, vi;
function c7() {
  if (vi) return br;
  vi = 1;
  var t = Is(), e = qo(), n = Po();
  function a(r) {
    return t(r, n, e);
  }
  return br = a, br;
}
var Cr, _i;
function d7() {
  if (_i) return Cr;
  _i = 1;
  var t = Is(), e = Hs(), n = jo();
  function a(r) {
    return t(r, n, e);
  }
  return Cr = a, Cr;
}
var Ar, wi;
function u7() {
  if (wi) return Ar;
  wi = 1;
  var t = Xe(), e = ye(), n = t(e, "DataView");
  return Ar = n, Ar;
}
var xr, yi;
function m7() {
  if (yi) return xr;
  yi = 1;
  var t = Xe(), e = ye(), n = t(e, "Promise");
  return xr = n, xr;
}
var Er, bi;
function h7() {
  if (bi) return Er;
  bi = 1;
  var t = Xe(), e = ye(), n = t(e, "Set");
  return Er = n, Er;
}
var Sr, Ci;
function f7() {
  if (Ci) return Sr;
  Ci = 1;
  var t = Xe(), e = ye(), n = t(e, "WeakMap");
  return Sr = n, Sr;
}
var Mr, Ai;
function Fo() {
  if (Ai) return Mr;
  Ai = 1;
  var t = u7(), e = Vo(), n = m7(), a = h7(), r = f7(), o = In(), i = ys(), l = "[object Map]", s = "[object Object]", u = "[object Promise]", d = "[object Set]", g = "[object WeakMap]", v = "[object DataView]", p = i(t), w = i(e), _ = i(n), y = i(a), A = i(r), E = o;
  return (t && E(new t(new ArrayBuffer(1))) != v || e && E(new e()) != l || n && E(n.resolve()) != u || a && E(new a()) != d || r && E(new r()) != g) && (E = function(S) {
    var M = o(S), P = M == s ? S.constructor : void 0, z = P ? i(P) : "";
    if (z)
      switch (z) {
        case p:
          return v;
        case w:
          return l;
        case _:
          return u;
        case y:
          return d;
        case A:
          return g;
      }
    return M;
  }), Mr = E, Mr;
}
var Dr, xi;
function p7() {
  if (xi) return Dr;
  xi = 1;
  var t = Object.prototype, e = t.hasOwnProperty;
  function n(a) {
    var r = a.length, o = new a.constructor(r);
    return r && typeof a[0] == "string" && e.call(a, "index") && (o.index = a.index, o.input = a.input), o;
  }
  return Dr = n, Dr;
}
var Tr, Ei;
function g7() {
  if (Ei) return Tr;
  Ei = 1;
  var t = ye(), e = t.Uint8Array;
  return Tr = e, Tr;
}
var Rr, Si;
function Uo() {
  if (Si) return Rr;
  Si = 1;
  var t = g7();
  function e(n) {
    var a = new n.constructor(n.byteLength);
    return new t(a).set(new t(n)), a;
  }
  return Rr = e, Rr;
}
var Hr, Mi;
function v7() {
  if (Mi) return Hr;
  Mi = 1;
  var t = Uo();
  function e(n, a) {
    var r = a ? t(n.buffer) : n.buffer;
    return new n.constructor(r, n.byteOffset, n.byteLength);
  }
  return Hr = e, Hr;
}
var Ir, Di;
function _7() {
  if (Di) return Ir;
  Di = 1;
  var t = /\w*$/;
  function e(n) {
    var a = new n.constructor(n.source, t.exec(n));
    return a.lastIndex = n.lastIndex, a;
  }
  return Ir = e, Ir;
}
var kr, Ti;
function w7() {
  if (Ti) return kr;
  Ti = 1;
  var t = zo(), e = t ? t.prototype : void 0, n = e ? e.valueOf : void 0;
  function a(r) {
    return n ? Object(n.call(r)) : {};
  }
  return kr = a, kr;
}
var zr, Ri;
function y7() {
  if (Ri) return zr;
  Ri = 1;
  var t = Uo();
  function e(n, a) {
    var r = a ? t(n.buffer) : n.buffer;
    return new n.constructor(r, n.byteOffset, n.length);
  }
  return zr = e, zr;
}
var Vr, Hi;
function b7() {
  if (Hi) return Vr;
  Hi = 1;
  var t = Uo(), e = v7(), n = _7(), a = w7(), r = y7(), o = "[object Boolean]", i = "[object Date]", l = "[object Map]", s = "[object Number]", u = "[object RegExp]", d = "[object Set]", g = "[object String]", v = "[object Symbol]", p = "[object ArrayBuffer]", w = "[object DataView]", _ = "[object Float32Array]", y = "[object Float64Array]", A = "[object Int8Array]", E = "[object Int16Array]", S = "[object Int32Array]", M = "[object Uint8Array]", P = "[object Uint8ClampedArray]", z = "[object Uint16Array]", T = "[object Uint32Array]";
  function R(H, Q, V) {
    var k = H.constructor;
    switch (Q) {
      case p:
        return t(H);
      case o:
      case i:
        return new k(+H);
      case w:
        return e(H, V);
      case _:
      case y:
      case A:
      case E:
      case S:
      case M:
      case P:
      case z:
      case T:
        return r(H, V);
      case l:
        return new k();
      case s:
      case g:
        return new k(H);
      case u:
        return n(H);
      case d:
        return new k();
      case v:
        return a(H);
    }
  }
  return Vr = R, Vr;
}
var Or, Ii;
function C7() {
  if (Ii) return Or;
  Ii = 1;
  var t = Nt(), e = Object.create, n = /* @__PURE__ */ (function() {
    function a() {
    }
    return function(r) {
      if (!t(r))
        return {};
      if (e)
        return e(r);
      a.prototype = r;
      var o = new a();
      return a.prototype = void 0, o;
    };
  })();
  return Or = n, Or;
}
var Br, ki;
function A7() {
  if (ki) return Br;
  ki = 1;
  var t = C7(), e = Rs(), n = No();
  function a(r) {
    return typeof r.constructor == "function" && !n(r) ? t(e(r)) : {};
  }
  return Br = a, Br;
}
var Lr, zi;
function x7() {
  if (zi) return Lr;
  zi = 1;
  var t = Fo(), e = Pt(), n = "[object Map]";
  function a(r) {
    return e(r) && t(r) == n;
  }
  return Lr = a, Lr;
}
var Nr, Vi;
function E7() {
  if (Vi) return Nr;
  Vi = 1;
  var t = x7(), e = Bo(), n = Lo(), a = n && n.isMap, r = a ? e(a) : t;
  return Nr = r, Nr;
}
var Pr, Oi;
function S7() {
  if (Oi) return Pr;
  Oi = 1;
  var t = Fo(), e = Pt(), n = "[object Set]";
  function a(r) {
    return e(r) && t(r) == n;
  }
  return Pr = a, Pr;
}
var jr, Bi;
function M7() {
  if (Bi) return jr;
  Bi = 1;
  var t = S7(), e = Bo(), n = Lo(), a = n && n.isSet, r = a ? e(a) : t;
  return jr = r, jr;
}
var qr, Li;
function D7() {
  if (Li) return qr;
  Li = 1;
  var t = q_(), e = F_(), n = Cs(), a = e7(), r = a7(), o = r7(), i = o7(), l = l7(), s = s7(), u = c7(), d = d7(), g = Fo(), v = p7(), p = b7(), w = A7(), _ = Oo(), y = As(), A = E7(), E = Nt(), S = M7(), M = Po(), P = jo(), z = 1, T = 2, R = 4, H = "[object Arguments]", Q = "[object Array]", V = "[object Boolean]", k = "[object Date]", Ve = "[object Error]", Ut = "[object Function]", h1 = "[object GeneratorFunction]", f1 = "[object Map]", p1 = "[object Number]", g2 = "[object Object]", g1 = "[object RegExp]", v1 = "[object Set]", _1 = "[object String]", w1 = "[object Symbol]", y1 = "[object WeakMap]", b1 = "[object ArrayBuffer]", C1 = "[object DataView]", A1 = "[object Float32Array]", x1 = "[object Float64Array]", E1 = "[object Int8Array]", S1 = "[object Int16Array]", M1 = "[object Int32Array]", D1 = "[object Uint8Array]", T1 = "[object Uint8ClampedArray]", R1 = "[object Uint16Array]", H1 = "[object Uint32Array]", W = {};
  W[H] = W[Q] = W[b1] = W[C1] = W[V] = W[k] = W[A1] = W[x1] = W[E1] = W[S1] = W[M1] = W[f1] = W[p1] = W[g2] = W[g1] = W[v1] = W[_1] = W[w1] = W[D1] = W[T1] = W[R1] = W[H1] = !0, W[Ve] = W[Ut] = W[y1] = !1;
  function Wt(j, rt, ot, I1, Gt, Ee) {
    var re, $t = rt & z, Qt = rt & T, k1 = rt & R;
    if (ot && (re = Gt ? ot(j, I1, Gt, Ee) : ot(j)), re !== void 0)
      return re;
    if (!E(j))
      return j;
    var v2 = _(j);
    if (v2) {
      if (re = v(j), !$t)
        return i(j, re);
    } else {
      var it = g(j), _2 = it == Ut || it == h1;
      if (y(j))
        return o(j, $t);
      if (it == g2 || it == H || _2 && !Gt) {
        if (re = Qt || _2 ? {} : w(j), !$t)
          return Qt ? s(j, r(re, j)) : l(j, a(re, j));
      } else {
        if (!W[it])
          return Gt ? j : {};
        re = p(j, it, $t);
      }
    }
    Ee || (Ee = new t());
    var w2 = Ee.get(j);
    if (w2)
      return w2;
    Ee.set(j, re), S(j) ? j.forEach(function(Se) {
      re.add(Wt(Se, rt, ot, Se, j, Ee));
    }) : A(j) && j.forEach(function(Se, Oe) {
      re.set(Oe, Wt(Se, rt, ot, Oe, j, Ee));
    });
    var z1 = k1 ? Qt ? d : u : Qt ? P : M, y2 = v2 ? void 0 : z1(j);
    return e(y2 || j, function(Se, Oe) {
      y2 && (Oe = Se, Se = j[Oe]), n(re, Oe, Wt(Se, rt, ot, Oe, j, Ee));
    }), re;
  }
  return qr = Wt, qr;
}
var Fr, Ni;
function T7() {
  if (Ni) return Fr;
  Ni = 1;
  var t = D7(), e = 1, n = 4;
  function a(r) {
    return t(r, e | n);
  }
  return Fr = a, Fr;
}
var R7 = T7();
const hn = /* @__PURE__ */ e9(R7), H7 = /* @__PURE__ */ f({
  __name: "index",
  props: {
    // 表单的配置项
    options: {
      type: Array,
      required: !0
    }
  },
  setup(t) {
    let e = t, n = N({}), a = N({});
    return Qe(() => {
      let r = {}, o = {};
      e.options.map((i) => {
        r[i.prop] = i.value, o[i.prop] = i.rules;
      }), n.value = hn(r), a.value = hn(o);
    }), (r, o) => {
      const i = q("el-form-item"), l = q("el-form");
      return m(), h("div", null, [
        F(l, _e({
          "validate-on-rule-change": !1,
          model: x(n),
          rules: x(a)
        }, r.$attrs), {
          default: U(() => [
            (m(!0), h(
              ee,
              null,
              ue(t.options, (s, u) => (m(), B(i, {
                key: u,
                label: s.label,
                prop: s.prop
              }, {
                default: U(() => [
                  (m(), B(me(`el-${s.type}`), _e({ ref_for: !0 }, s.attrs, {
                    modelValue: x(n)[s.prop],
                    "onUpdate:modelValue": (d) => x(n)[s.prop] = d
                  }), null, 16, ["modelValue", "onUpdate:modelValue"]))
                ]),
                _: 2
                /* DYNAMIC */
              }, 1032, ["label", "prop"]))),
              128
              /* KEYED_FRAGMENT */
            ))
          ]),
          _: 1
          /* STABLE */
        }, 16, ["model", "rules"])
      ]);
    };
  }
}), I7 = {
  install(t) {
    t.component("x-form", H7);
  }
};
var On, D, ks, zs, pt, Pe, Pi, Vs, Os, fn = {}, Bs = [], k7 = /acit|ex(?:s|g|n|p|$)|rph|grid|ows|mnc|ntw|ine[ch]|zoo|^ord|itera/i;
function Me(t, e) {
  for (var n in e) t[n] = e[n];
  return t;
}
function Ls(t) {
  var e = t.parentNode;
  e && e.removeChild(t);
}
function C(t, e, n) {
  var a, r, o, i = {};
  for (o in e) o == "key" ? a = e[o] : o == "ref" ? r = e[o] : i[o] = e[o];
  if (arguments.length > 2 && (i.children = arguments.length > 3 ? On.call(arguments, 2) : n), typeof t == "function" && t.defaultProps != null) for (o in t.defaultProps) i[o] === void 0 && (i[o] = t.defaultProps[o]);
  return on(t, i, a, r, null);
}
function on(t, e, n, a, r) {
  var o = { type: t, props: e, key: n, ref: a, __k: null, __: null, __b: 0, __e: null, __d: void 0, __c: null, __h: null, constructor: void 0, __v: r ?? ++ks };
  return r == null && D.vnode != null && D.vnode(o), o;
}
function Ae() {
  return { current: null };
}
function Z(t) {
  return t.children;
}
function z7(t, e, n, a, r) {
  var o;
  for (o in n) o === "children" || o === "key" || o in e || pn(t, o, null, n[o], a);
  for (o in e) r && typeof e[o] != "function" || o === "children" || o === "key" || o === "value" || o === "checked" || n[o] === e[o] || pn(t, o, e[o], n[o], a);
}
function ji(t, e, n) {
  e[0] === "-" ? t.setProperty(e, n ?? "") : t[e] = n == null ? "" : typeof n != "number" || k7.test(e) ? n : n + "px";
}
function pn(t, e, n, a, r) {
  var o;
  e: if (e === "style") if (typeof n == "string") t.style.cssText = n;
  else {
    if (typeof a == "string" && (t.style.cssText = a = ""), a) for (e in a) n && e in n || ji(t.style, e, "");
    if (n) for (e in n) a && n[e] === a[e] || ji(t.style, e, n[e]);
  }
  else if (e[0] === "o" && e[1] === "n") o = e !== (e = e.replace(/Capture$/, "")), e = e.toLowerCase() in t ? e.toLowerCase().slice(2) : e.slice(2), t.l || (t.l = {}), t.l[e + o] = n, n ? a || t.addEventListener(e, o ? Fi : qi, o) : t.removeEventListener(e, o ? Fi : qi, o);
  else if (e !== "dangerouslySetInnerHTML") {
    if (r) e = e.replace(/xlink(H|:h)/, "h").replace(/sName$/, "s");
    else if (e !== "width" && e !== "height" && e !== "href" && e !== "list" && e !== "form" && e !== "tabIndex" && e !== "download" && e in t) try {
      t[e] = n ?? "";
      break e;
    } catch {
    }
    typeof n == "function" || (n == null || n === !1 && e.indexOf("-") == -1 ? t.removeAttribute(e) : t.setAttribute(e, n));
  }
}
function qi(t) {
  pt = !0;
  try {
    return this.l[t.type + !1](D.event ? D.event(t) : t);
  } finally {
    pt = !1;
  }
}
function Fi(t) {
  pt = !0;
  try {
    return this.l[t.type + !0](D.event ? D.event(t) : t);
  } finally {
    pt = !1;
  }
}
function ce(t, e) {
  this.props = t, this.context = e;
}
function kt(t, e) {
  if (e == null) return t.__ ? kt(t.__, t.__.__k.indexOf(t) + 1) : null;
  for (var n; e < t.__k.length; e++) if ((n = t.__k[e]) != null && n.__e != null) return n.__e;
  return typeof t.type == "function" ? kt(t) : null;
}
function Ns(t) {
  var e, n;
  if ((t = t.__) != null && t.__c != null) {
    for (t.__e = t.__c.base = null, e = 0; e < t.__k.length; e++) if ((n = t.__k[e]) != null && n.__e != null) {
      t.__e = t.__c.base = n.__e;
      break;
    }
    return Ns(t);
  }
}
function V7(t) {
  pt ? setTimeout(t) : Vs(t);
}
function mo(t) {
  (!t.__d && (t.__d = !0) && Pe.push(t) && !gn.__r++ || Pi !== D.debounceRendering) && ((Pi = D.debounceRendering) || V7)(gn);
}
function gn() {
  var t, e, n, a, r, o, i, l;
  for (Pe.sort(function(s, u) {
    return s.__v.__b - u.__v.__b;
  }); t = Pe.shift(); ) t.__d && (e = Pe.length, a = void 0, r = void 0, i = (o = (n = t).__v).__e, (l = n.__P) && (a = [], (r = Me({}, o)).__v = o.__v + 1, Wo(l, o, r, n.__n, l.ownerSVGElement !== void 0, o.__h != null ? [i] : null, a, i ?? kt(o), o.__h), Us(a, o), o.__e != i && Ns(o)), Pe.length > e && Pe.sort(function(s, u) {
    return s.__v.__b - u.__v.__b;
  }));
  gn.__r = 0;
}
function Ps(t, e, n, a, r, o, i, l, s, u) {
  var d, g, v, p, w, _, y, A = a && a.__k || Bs, E = A.length;
  for (n.__k = [], d = 0; d < e.length; d++) if ((p = n.__k[d] = (p = e[d]) == null || typeof p == "boolean" ? null : typeof p == "string" || typeof p == "number" || typeof p == "bigint" ? on(null, p, null, null, p) : Array.isArray(p) ? on(Z, { children: p }, null, null, null) : p.__b > 0 ? on(p.type, p.props, p.key, p.ref ? p.ref : null, p.__v) : p) != null) {
    if (p.__ = n, p.__b = n.__b + 1, (v = A[d]) === null || v && p.key == v.key && p.type === v.type) A[d] = void 0;
    else for (g = 0; g < E; g++) {
      if ((v = A[g]) && p.key == v.key && p.type === v.type) {
        A[g] = void 0;
        break;
      }
      v = null;
    }
    Wo(t, p, v = v || fn, r, o, i, l, s, u), w = p.__e, (g = p.ref) && v.ref != g && (y || (y = []), v.ref && y.push(v.ref, null, p), y.push(g, p.__c || w, p)), w != null ? (_ == null && (_ = w), typeof p.type == "function" && p.__k === v.__k ? p.__d = s = js(p, s, t) : s = qs(t, p, v, A, w, s), typeof n.type == "function" && (n.__d = s)) : s && v.__e == s && s.parentNode != t && (s = kt(v));
  }
  for (n.__e = _, d = E; d--; ) A[d] != null && (typeof n.type == "function" && A[d].__e != null && A[d].__e == n.__d && (n.__d = Fs(a).nextSibling), Gs(A[d], A[d]));
  if (y) for (d = 0; d < y.length; d++) Ws(y[d], y[++d], y[++d]);
}
function js(t, e, n) {
  for (var a, r = t.__k, o = 0; r && o < r.length; o++) (a = r[o]) && (a.__ = t, e = typeof a.type == "function" ? js(a, e, n) : qs(n, a, a, r, a.__e, e));
  return e;
}
function vn(t, e) {
  return e = e || [], t == null || typeof t == "boolean" || (Array.isArray(t) ? t.some(function(n) {
    vn(n, e);
  }) : e.push(t)), e;
}
function qs(t, e, n, a, r, o) {
  var i, l, s;
  if (e.__d !== void 0) i = e.__d, e.__d = void 0;
  else if (n == null || r != o || r.parentNode == null) e: if (o == null || o.parentNode !== t) t.appendChild(r), i = null;
  else {
    for (l = o, s = 0; (l = l.nextSibling) && s < a.length; s += 1) if (l == r) break e;
    t.insertBefore(r, o), i = o;
  }
  return i !== void 0 ? i : r.nextSibling;
}
function Fs(t) {
  var e, n, a;
  if (t.type == null || typeof t.type == "string") return t.__e;
  if (t.__k) {
    for (e = t.__k.length - 1; e >= 0; e--) if ((n = t.__k[e]) && (a = Fs(n))) return a;
  }
  return null;
}
function Wo(t, e, n, a, r, o, i, l, s) {
  var u, d, g, v, p, w, _, y, A, E, S, M, P, z, T, R = e.type;
  if (e.constructor !== void 0) return null;
  n.__h != null && (s = n.__h, l = e.__e = n.__e, e.__h = null, o = [l]), (u = D.__b) && u(e);
  try {
    e: if (typeof R == "function") {
      if (y = e.props, A = (u = R.contextType) && a[u.__c], E = u ? A ? A.props.value : u.__ : a, n.__c ? _ = (d = e.__c = n.__c).__ = d.__E : ("prototype" in R && R.prototype.render ? e.__c = d = new R(y, E) : (e.__c = d = new ce(y, E), d.constructor = R, d.render = B7), A && A.sub(d), d.props = y, d.state || (d.state = {}), d.context = E, d.__n = a, g = d.__d = !0, d.__h = [], d._sb = []), d.__s == null && (d.__s = d.state), R.getDerivedStateFromProps != null && (d.__s == d.state && (d.__s = Me({}, d.__s)), Me(d.__s, R.getDerivedStateFromProps(y, d.__s))), v = d.props, p = d.state, d.__v = e, g) R.getDerivedStateFromProps == null && d.componentWillMount != null && d.componentWillMount(), d.componentDidMount != null && d.__h.push(d.componentDidMount);
      else {
        if (R.getDerivedStateFromProps == null && y !== v && d.componentWillReceiveProps != null && d.componentWillReceiveProps(y, E), !d.__e && d.shouldComponentUpdate != null && d.shouldComponentUpdate(y, d.__s, E) === !1 || e.__v === n.__v) {
          for (e.__v !== n.__v && (d.props = y, d.state = d.__s, d.__d = !1), e.__e = n.__e, e.__k = n.__k, e.__k.forEach(function(H) {
            H && (H.__ = e);
          }), S = 0; S < d._sb.length; S++) d.__h.push(d._sb[S]);
          d._sb = [], d.__h.length && i.push(d);
          break e;
        }
        d.componentWillUpdate != null && d.componentWillUpdate(y, d.__s, E), d.componentDidUpdate != null && d.__h.push(function() {
          d.componentDidUpdate(v, p, w);
        });
      }
      if (d.context = E, d.props = y, d.__P = t, M = D.__r, P = 0, "prototype" in R && R.prototype.render) {
        for (d.state = d.__s, d.__d = !1, M && M(e), u = d.render(d.props, d.state, d.context), z = 0; z < d._sb.length; z++) d.__h.push(d._sb[z]);
        d._sb = [];
      } else do
        d.__d = !1, M && M(e), u = d.render(d.props, d.state, d.context), d.state = d.__s;
      while (d.__d && ++P < 25);
      d.state = d.__s, d.getChildContext != null && (a = Me(Me({}, a), d.getChildContext())), g || d.getSnapshotBeforeUpdate == null || (w = d.getSnapshotBeforeUpdate(v, p)), T = u != null && u.type === Z && u.key == null ? u.props.children : u, Ps(t, Array.isArray(T) ? T : [T], e, n, a, r, o, i, l, s), d.base = e.__e, e.__h = null, d.__h.length && i.push(d), _ && (d.__E = d.__ = null), d.__e = !1;
    } else o == null && e.__v === n.__v ? (e.__k = n.__k, e.__e = n.__e) : e.__e = O7(n.__e, e, n, a, r, o, i, s);
    (u = D.diffed) && u(e);
  } catch (H) {
    e.__v = null, (s || o != null) && (e.__e = l, e.__h = !!s, o[o.indexOf(l)] = null), D.__e(H, e, n);
  }
}
function Us(t, e) {
  D.__c && D.__c(e, t), t.some(function(n) {
    try {
      t = n.__h, n.__h = [], t.some(function(a) {
        a.call(n);
      });
    } catch (a) {
      D.__e(a, n.__v);
    }
  });
}
function O7(t, e, n, a, r, o, i, l) {
  var s, u, d, g = n.props, v = e.props, p = e.type, w = 0;
  if (p === "svg" && (r = !0), o != null) {
    for (; w < o.length; w++) if ((s = o[w]) && "setAttribute" in s == !!p && (p ? s.localName === p : s.nodeType === 3)) {
      t = s, o[w] = null;
      break;
    }
  }
  if (t == null) {
    if (p === null) return document.createTextNode(v);
    t = r ? document.createElementNS("http://www.w3.org/2000/svg", p) : document.createElement(p, v.is && v), o = null, l = !1;
  }
  if (p === null) g === v || l && t.data === v || (t.data = v);
  else {
    if (o = o && On.call(t.childNodes), u = (g = n.props || fn).dangerouslySetInnerHTML, d = v.dangerouslySetInnerHTML, !l) {
      if (o != null) for (g = {}, w = 0; w < t.attributes.length; w++) g[t.attributes[w].name] = t.attributes[w].value;
      (d || u) && (d && (u && d.__html == u.__html || d.__html === t.innerHTML) || (t.innerHTML = d && d.__html || ""));
    }
    if (z7(t, v, g, r, l), d) e.__k = [];
    else if (w = e.props.children, Ps(t, Array.isArray(w) ? w : [w], e, n, a, r && p !== "foreignObject", o, i, o ? o[0] : n.__k && kt(n, 0), l), o != null) for (w = o.length; w--; ) o[w] != null && Ls(o[w]);
    l || ("value" in v && (w = v.value) !== void 0 && (w !== t.value || p === "progress" && !w || p === "option" && w !== g.value) && pn(t, "value", w, g.value, !1), "checked" in v && (w = v.checked) !== void 0 && w !== t.checked && pn(t, "checked", w, g.checked, !1));
  }
  return t;
}
function Ws(t, e, n) {
  try {
    typeof t == "function" ? t(e) : t.current = e;
  } catch (a) {
    D.__e(a, n);
  }
}
function Gs(t, e, n) {
  var a, r;
  if (D.unmount && D.unmount(t), (a = t.ref) && (a.current && a.current !== t.__e || Ws(a, null, e)), (a = t.__c) != null) {
    if (a.componentWillUnmount) try {
      a.componentWillUnmount();
    } catch (o) {
      D.__e(o, e);
    }
    a.base = a.__P = null, t.__c = void 0;
  }
  if (a = t.__k) for (r = 0; r < a.length; r++) a[r] && Gs(a[r], e, n || typeof t.type != "function");
  n || t.__e == null || Ls(t.__e), t.__ = t.__e = t.__d = void 0;
}
function B7(t, e, n) {
  return this.constructor(t, n);
}
function zt(t, e, n) {
  var a, r, o;
  D.__ && D.__(t, e), r = (a = !1) ? null : e.__k, o = [], Wo(e, t = e.__k = C(Z, null, [t]), r || fn, fn, e.ownerSVGElement !== void 0, r ? null : e.firstChild ? On.call(e.childNodes) : null, o, r ? r.__e : e.firstChild, a), Us(o, t);
}
function L7(t, e) {
  var n = { __c: e = "__cC" + Os++, __: t, Consumer: function(a, r) {
    return a.children(r);
  }, Provider: function(a) {
    var r, o;
    return this.getChildContext || (r = [], (o = {})[e] = this, this.getChildContext = function() {
      return o;
    }, this.shouldComponentUpdate = function(i) {
      this.props.value !== i.value && r.some(function(l) {
        l.__e = !0, mo(l);
      });
    }, this.sub = function(i) {
      r.push(i);
      var l = i.componentWillUnmount;
      i.componentWillUnmount = function() {
        r.splice(r.indexOf(i), 1), l && l.call(i);
      };
    }), a.children;
  } };
  return n.Provider.__ = n.Consumer.contextType = n;
}
On = Bs.slice, D = { __e: function(t, e, n, a) {
  for (var r, o, i; e = e.__; ) if ((r = e.__c) && !r.__) try {
    if ((o = r.constructor) && o.getDerivedStateFromError != null && (r.setState(o.getDerivedStateFromError(t)), i = r.__d), r.componentDidCatch != null && (r.componentDidCatch(t, a || {}), i = r.__d), i) return r.__E = r;
  } catch (l) {
    t = l;
  }
  throw t;
} }, ks = 0, zs = function(t) {
  return t != null && t.constructor === void 0;
}, pt = !1, ce.prototype.setState = function(t, e) {
  var n;
  n = this.__s != null && this.__s !== this.state ? this.__s : this.__s = Me({}, this.state), typeof t == "function" && (t = t(Me({}, n), this.props)), t && Me(n, t), t != null && this.__v && (e && this._sb.push(e), mo(this));
}, ce.prototype.forceUpdate = function(t) {
  this.__v && (this.__e = !0, t && this.__h.push(t), mo(this));
}, ce.prototype.render = Z, Pe = [], Vs = typeof Promise == "function" ? Promise.prototype.then.bind(Promise.resolve()) : setTimeout, gn.__r = 0, Os = 0;
var ge, Ur, Ui, $s = [], Wr = [], Wi = D.__b, Gi = D.__r, $i = D.diffed, Qi = D.__c, Yi = D.unmount;
function N7() {
  for (var t; t = $s.shift(); ) if (t.__P && t.__H) try {
    t.__H.__h.forEach(ln), t.__H.__h.forEach(ho), t.__H.__h = [];
  } catch (e) {
    t.__H.__h = [], D.__e(e, t.__v);
  }
}
D.__b = function(t) {
  ge = null, Wi && Wi(t);
}, D.__r = function(t) {
  Gi && Gi(t);
  var e = (ge = t.__c).__H;
  e && (Ur === ge ? (e.__h = [], ge.__h = [], e.__.forEach(function(n) {
    n.__N && (n.__ = n.__N), n.__V = Wr, n.__N = n.i = void 0;
  })) : (e.__h.forEach(ln), e.__h.forEach(ho), e.__h = [])), Ur = ge;
}, D.diffed = function(t) {
  $i && $i(t);
  var e = t.__c;
  e && e.__H && (e.__H.__h.length && ($s.push(e) !== 1 && Ui === D.requestAnimationFrame || ((Ui = D.requestAnimationFrame) || P7)(N7)), e.__H.__.forEach(function(n) {
    n.i && (n.__H = n.i), n.__V !== Wr && (n.__ = n.__V), n.i = void 0, n.__V = Wr;
  })), Ur = ge = null;
}, D.__c = function(t, e) {
  e.some(function(n) {
    try {
      n.__h.forEach(ln), n.__h = n.__h.filter(function(a) {
        return !a.__ || ho(a);
      });
    } catch (a) {
      e.some(function(r) {
        r.__h && (r.__h = []);
      }), e = [], D.__e(a, n.__v);
    }
  }), Qi && Qi(t, e);
}, D.unmount = function(t) {
  Yi && Yi(t);
  var e, n = t.__c;
  n && n.__H && (n.__H.__.forEach(function(a) {
    try {
      ln(a);
    } catch (r) {
      e = r;
    }
  }), n.__H = void 0, e && D.__e(e, n.__v));
};
var Zi = typeof requestAnimationFrame == "function";
function P7(t) {
  var e, n = function() {
    clearTimeout(a), Zi && cancelAnimationFrame(e), setTimeout(t);
  }, a = setTimeout(n, 100);
  Zi && (e = requestAnimationFrame(n));
}
function ln(t) {
  var e = ge, n = t.__c;
  typeof n == "function" && (t.__c = void 0, n()), ge = e;
}
function ho(t) {
  var e = ge;
  t.__c = t.__(), ge = e;
}
function j7(t, e) {
  for (var n in e) t[n] = e[n];
  return t;
}
function Ki(t, e) {
  for (var n in t) if (n !== "__source" && !(n in e)) return !0;
  for (var a in e) if (a !== "__source" && t[a] !== e[a]) return !0;
  return !1;
}
function Xi(t) {
  this.props = t;
}
(Xi.prototype = new ce()).isPureReactComponent = !0, Xi.prototype.shouldComponentUpdate = function(t, e) {
  return Ki(this.props, t) || Ki(this.state, e);
};
var Ji = D.__b;
D.__b = function(t) {
  t.type && t.type.__f && t.ref && (t.props.ref = t.ref, t.ref = null), Ji && Ji(t);
};
var q7 = D.__e;
D.__e = function(t, e, n, a) {
  if (t.then) {
    for (var r, o = e; o = o.__; ) if ((r = o.__c) && r.__c) return e.__e == null && (e.__e = n.__e, e.__k = n.__k), r.__c(t, e);
  }
  q7(t, e, n, a);
};
var el = D.unmount;
function Qs(t, e, n) {
  return t && (t.__c && t.__c.__H && (t.__c.__H.__.forEach(function(a) {
    typeof a.__c == "function" && a.__c();
  }), t.__c.__H = null), (t = j7({}, t)).__c != null && (t.__c.__P === n && (t.__c.__P = e), t.__c = null), t.__k = t.__k && t.__k.map(function(a) {
    return Qs(a, e, n);
  })), t;
}
function Ys(t, e, n) {
  return t && (t.__v = null, t.__k = t.__k && t.__k.map(function(a) {
    return Ys(a, e, n);
  }), t.__c && t.__c.__P === e && (t.__e && n.insertBefore(t.__e, t.__d), t.__c.__e = !0, t.__c.__P = n)), t;
}
function Gr() {
  this.__u = 0, this.t = null, this.__b = null;
}
function Zs(t) {
  var e = t.__.__c;
  return e && e.__a && e.__a(t);
}
function Zt() {
  this.u = null, this.o = null;
}
D.unmount = function(t) {
  var e = t.__c;
  e && e.__R && e.__R(), e && t.__h === !0 && (t.type = null), el && el(t);
}, (Gr.prototype = new ce()).__c = function(t, e) {
  var n = e.__c, a = this;
  a.t == null && (a.t = []), a.t.push(n);
  var r = Zs(a.__v), o = !1, i = function() {
    o || (o = !0, n.__R = null, r ? r(l) : l());
  };
  n.__R = i;
  var l = function() {
    if (!--a.__u) {
      if (a.state.__a) {
        var u = a.state.__a;
        a.__v.__k[0] = Ys(u, u.__c.__P, u.__c.__O);
      }
      var d;
      for (a.setState({ __a: a.__b = null }); d = a.t.pop(); ) d.forceUpdate();
    }
  }, s = e.__h === !0;
  a.__u++ || s || a.setState({ __a: a.__b = a.__v.__k[0] }), t.then(i, i);
}, Gr.prototype.componentWillUnmount = function() {
  this.t = [];
}, Gr.prototype.render = function(t, e) {
  if (this.__b) {
    if (this.__v.__k) {
      var n = document.createElement("div"), a = this.__v.__k[0].__c;
      this.__v.__k[0] = Qs(this.__b, n, a.__O = a.__P);
    }
    this.__b = null;
  }
  var r = e.__a && C(Z, null, t.fallback);
  return r && (r.__h = null), [C(Z, null, e.__a ? null : t.children), r];
};
var tl = function(t, e, n) {
  if (++n[1] === n[0] && t.o.delete(e), t.props.revealOrder && (t.props.revealOrder[0] !== "t" || !t.o.size)) for (n = t.u; n; ) {
    for (; n.length > 3; ) n.pop()();
    if (n[1] < n[0]) break;
    t.u = n = n[2];
  }
};
function F7(t) {
  return this.getChildContext = function() {
    return t.context;
  }, t.children;
}
function U7(t) {
  var e = this, n = t.i;
  e.componentWillUnmount = function() {
    zt(null, e.l), e.l = null, e.i = null;
  }, e.i && e.i !== n && e.componentWillUnmount(), t.__v ? (e.l || (e.i = n, e.l = { nodeType: 1, parentNode: n, childNodes: [], appendChild: function(a) {
    this.childNodes.push(a), e.i.appendChild(a);
  }, insertBefore: function(a, r) {
    this.childNodes.push(a), e.i.appendChild(a);
  }, removeChild: function(a) {
    this.childNodes.splice(this.childNodes.indexOf(a) >>> 1, 1), e.i.removeChild(a);
  } }), zt(C(F7, { context: e.context }, t.__v), e.l)) : e.l && e.componentWillUnmount();
}
function W7(t, e) {
  var n = C(U7, { __v: t, i: e });
  return n.containerInfo = e, n;
}
(Zt.prototype = new ce()).__a = function(t) {
  var e = this, n = Zs(e.__v), a = e.o.get(t);
  return a[0]++, function(r) {
    var o = function() {
      e.props.revealOrder ? (a.push(r), tl(e, t, a)) : r();
    };
    n ? n(o) : o();
  };
}, Zt.prototype.render = function(t) {
  this.u = null, this.o = /* @__PURE__ */ new Map();
  var e = vn(t.children);
  t.revealOrder && t.revealOrder[0] === "b" && e.reverse();
  for (var n = e.length; n--; ) this.o.set(e[n], this.u = [1, 0, this.u]);
  return t.children;
}, Zt.prototype.componentDidUpdate = Zt.prototype.componentDidMount = function() {
  var t = this;
  this.o.forEach(function(e, n) {
    tl(t, n, e);
  });
};
var G7 = typeof Symbol < "u" && Symbol.for && Symbol.for("react.element") || 60103, $7 = /^(?:accent|alignment|arabic|baseline|cap|clip(?!PathU)|color|dominant|fill|flood|font|glyph(?!R)|horiz|image|letter|lighting|marker(?!H|W|U)|overline|paint|pointer|shape|stop|strikethrough|stroke|text(?!L)|transform|underline|unicode|units|v|vector|vert|word|writing|x(?!C))[A-Z]/, Q7 = typeof document < "u", Y7 = function(t) {
  return (typeof Symbol < "u" && typeof Symbol() == "symbol" ? /fil|che|rad/i : /fil|che|ra/i).test(t);
};
ce.prototype.isReactComponent = {}, ["componentWillMount", "componentWillReceiveProps", "componentWillUpdate"].forEach(function(t) {
  Object.defineProperty(ce.prototype, t, { configurable: !0, get: function() {
    return this["UNSAFE_" + t];
  }, set: function(e) {
    Object.defineProperty(this, t, { configurable: !0, writable: !0, value: e });
  } });
});
var nl = D.event;
function Z7() {
}
function K7() {
  return this.cancelBubble;
}
function X7() {
  return this.defaultPrevented;
}
D.event = function(t) {
  return nl && (t = nl(t)), t.persist = Z7, t.isPropagationStopped = K7, t.isDefaultPrevented = X7, t.nativeEvent = t;
};
var al = { configurable: !0, get: function() {
  return this.class;
} }, rl = D.vnode;
D.vnode = function(t) {
  var e = t.type, n = t.props, a = n;
  if (typeof e == "string") {
    var r = e.indexOf("-") === -1;
    for (var o in a = {}, n) {
      var i = n[o];
      Q7 && o === "children" && e === "noscript" || o === "value" && "defaultValue" in n && i == null || (o === "defaultValue" && "value" in n && n.value == null ? o = "value" : o === "download" && i === !0 ? i = "" : /ondoubleclick/i.test(o) ? o = "ondblclick" : /^onchange(textarea|input)/i.test(o + e) && !Y7(n.type) ? o = "oninput" : /^onfocus$/i.test(o) ? o = "onfocusin" : /^onblur$/i.test(o) ? o = "onfocusout" : /^on(Ani|Tra|Tou|BeforeInp|Compo)/.test(o) ? o = o.toLowerCase() : r && $7.test(o) ? o = o.replace(/[A-Z0-9]/g, "-$&").toLowerCase() : i === null && (i = void 0), /^oninput$/i.test(o) && (o = o.toLowerCase(), a[o] && (o = "oninputCapture")), a[o] = i);
    }
    e == "select" && a.multiple && Array.isArray(a.value) && (a.value = vn(n.children).forEach(function(l) {
      l.props.selected = a.value.indexOf(l.props.value) != -1;
    })), e == "select" && a.defaultValue != null && (a.value = vn(n.children).forEach(function(l) {
      l.props.selected = a.multiple ? a.defaultValue.indexOf(l.props.value) != -1 : a.defaultValue == l.props.value;
    })), t.props = a, n.class != n.className && (al.enumerable = "className" in n, n.className != null && (a.class = n.className), Object.defineProperty(a, "className", al));
  }
  t.$$typeof = G7, rl && rl(t);
};
var ol = D.__r;
D.__r = function(t) {
  ol && ol(t), t.__c;
};
const Ks = [], fo = /* @__PURE__ */ new Map();
function Xs(t) {
  Ks.push(t), fo.forEach((e) => {
    ec(e, t);
  });
}
function J7(t) {
  t.isConnected && // sometimes true if SSR system simulates DOM
  t.getRootNode && Js(t.getRootNode());
}
function Js(t) {
  let e = fo.get(t);
  if (!e || !e.isConnected) {
    if (e = t.querySelector("style[data-fullcalendar]"), !e) {
      e = document.createElement("style"), e.setAttribute("data-fullcalendar", "");
      const n = tw();
      n && (e.nonce = n);
      const a = t === document ? document.head : t, r = t === document ? a.querySelector("script,link[rel=stylesheet],link[as=style],style") : a.firstChild;
      a.insertBefore(e, r);
    }
    fo.set(t, e), ew(e);
  }
}
function ew(t) {
  for (const e of Ks)
    ec(t, e);
}
function ec(t, e) {
  const { sheet: n } = t, a = n.cssRules.length;
  e.split("}").forEach((r, o) => {
    r = r.trim(), r && n.insertRule(r + "}", a + o);
  });
}
let $r;
function tw() {
  return $r === void 0 && ($r = nw()), $r;
}
function nw() {
  const t = document.querySelector('meta[name="csp-nonce"]');
  if (t && t.hasAttribute("content"))
    return t.getAttribute("content");
  const e = document.querySelector("script[nonce]");
  return e && e.nonce || "";
}
typeof document < "u" && Js(document);
var aw = ':root{--fc-small-font-size:.85em;--fc-page-bg-color:#fff;--fc-neutral-bg-color:hsla(0,0%,82%,.3);--fc-neutral-text-color:grey;--fc-border-color:#ddd;--fc-button-text-color:#fff;--fc-button-bg-color:#2c3e50;--fc-button-border-color:#2c3e50;--fc-button-hover-bg-color:#1e2b37;--fc-button-hover-border-color:#1a252f;--fc-button-active-bg-color:#1a252f;--fc-button-active-border-color:#151e27;--fc-event-bg-color:#3788d8;--fc-event-border-color:#3788d8;--fc-event-text-color:#fff;--fc-event-selected-overlay-color:rgba(0,0,0,.25);--fc-more-link-bg-color:#d0d0d0;--fc-more-link-text-color:inherit;--fc-event-resizer-thickness:8px;--fc-event-resizer-dot-total-width:8px;--fc-event-resizer-dot-border-width:1px;--fc-non-business-color:hsla(0,0%,84%,.3);--fc-bg-event-color:#8fdf82;--fc-bg-event-opacity:0.3;--fc-highlight-color:rgba(188,232,241,.3);--fc-today-bg-color:rgba(255,220,40,.15);--fc-now-indicator-color:red}.fc-not-allowed,.fc-not-allowed .fc-event{cursor:not-allowed}.fc{display:flex;flex-direction:column;font-size:1em}.fc,.fc *,.fc :after,.fc :before{box-sizing:border-box}.fc table{border-collapse:collapse;border-spacing:0;font-size:1em}.fc th{text-align:center}.fc td,.fc th{padding:0;vertical-align:top}.fc a[data-navlink]{cursor:pointer}.fc a[data-navlink]:hover{text-decoration:underline}.fc-direction-ltr{direction:ltr;text-align:left}.fc-direction-rtl{direction:rtl;text-align:right}.fc-theme-standard td,.fc-theme-standard th{border:1px solid var(--fc-border-color)}.fc-liquid-hack td,.fc-liquid-hack th{position:relative}@font-face{font-family:fcicons;font-style:normal;font-weight:400;src:url("data:application/x-font-ttf;charset=utf-8;base64,AAEAAAALAIAAAwAwT1MvMg8SBfAAAAC8AAAAYGNtYXAXVtKNAAABHAAAAFRnYXNwAAAAEAAAAXAAAAAIZ2x5ZgYydxIAAAF4AAAFNGhlYWQUJ7cIAAAGrAAAADZoaGVhB20DzAAABuQAAAAkaG10eCIABhQAAAcIAAAALGxvY2ED4AU6AAAHNAAAABhtYXhwAA8AjAAAB0wAAAAgbmFtZXsr690AAAdsAAABhnBvc3QAAwAAAAAI9AAAACAAAwPAAZAABQAAApkCzAAAAI8CmQLMAAAB6wAzAQkAAAAAAAAAAAAAAAAAAAABEAAAAAAAAAAAAAAAAAAAAABAAADpBgPA/8AAQAPAAEAAAAABAAAAAAAAAAAAAAAgAAAAAAADAAAAAwAAABwAAQADAAAAHAADAAEAAAAcAAQAOAAAAAoACAACAAIAAQAg6Qb//f//AAAAAAAg6QD//f//AAH/4xcEAAMAAQAAAAAAAAAAAAAAAQAB//8ADwABAAAAAAAAAAAAAgAANzkBAAAAAAEAAAAAAAAAAAACAAA3OQEAAAAAAQAAAAAAAAAAAAIAADc5AQAAAAABAWIAjQKeAskAEwAAJSc3NjQnJiIHAQYUFwEWMjc2NCcCnuLiDQ0MJAz/AA0NAQAMJAwNDcni4gwjDQwM/wANIwz/AA0NDCMNAAAAAQFiAI0CngLJABMAACUBNjQnASYiBwYUHwEHBhQXFjI3AZ4BAA0N/wAMJAwNDeLiDQ0MJAyNAQAMIw0BAAwMDSMM4uINIwwNDQAAAAIA4gC3Ax4CngATACcAACUnNzY0JyYiDwEGFB8BFjI3NjQnISc3NjQnJiIPAQYUHwEWMjc2NCcB87e3DQ0MIw3VDQ3VDSMMDQ0BK7e3DQ0MJAzVDQ3VDCQMDQ3zuLcMJAwNDdUNIwzWDAwNIwy4twwkDA0N1Q0jDNYMDA0jDAAAAgDiALcDHgKeABMAJwAAJTc2NC8BJiIHBhQfAQcGFBcWMjchNzY0LwEmIgcGFB8BBwYUFxYyNwJJ1Q0N1Q0jDA0Nt7cNDQwjDf7V1Q0N1QwkDA0Nt7cNDQwkDLfWDCMN1Q0NDCQMt7gMIw0MDNYMIw3VDQ0MJAy3uAwjDQwMAAADAFUAAAOrA1UAMwBoAHcAABMiBgcOAQcOAQcOARURFBYXHgEXHgEXHgEzITI2Nz4BNz4BNz4BNRE0JicuAScuAScuASMFITIWFx4BFx4BFx4BFREUBgcOAQcOAQcOASMhIiYnLgEnLgEnLgE1ETQ2Nz4BNz4BNz4BMxMhMjY1NCYjISIGFRQWM9UNGAwLFQkJDgUFBQUFBQ4JCRULDBgNAlYNGAwLFQkJDgUFBQUFBQ4JCRULDBgN/aoCVgQIBAQHAwMFAQIBAQIBBQMDBwQECAT9qgQIBAQHAwMFAQIBAQIBBQMDBwQECASAAVYRGRkR/qoRGRkRA1UFBAUOCQkVDAsZDf2rDRkLDBUJCA4FBQUFBQUOCQgVDAsZDQJVDRkLDBUJCQ4FBAVVAgECBQMCBwQECAX9qwQJAwQHAwMFAQICAgIBBQMDBwQDCQQCVQUIBAQHAgMFAgEC/oAZEhEZGRESGQAAAAADAFUAAAOrA1UAMwBoAIkAABMiBgcOAQcOAQcOARURFBYXHgEXHgEXHgEzITI2Nz4BNz4BNz4BNRE0JicuAScuAScuASMFITIWFx4BFx4BFx4BFREUBgcOAQcOAQcOASMhIiYnLgEnLgEnLgE1ETQ2Nz4BNz4BNz4BMxMzFRQWMzI2PQEzMjY1NCYrATU0JiMiBh0BIyIGFRQWM9UNGAwLFQkJDgUFBQUFBQ4JCRULDBgNAlYNGAwLFQkJDgUFBQUFBQ4JCRULDBgN/aoCVgQIBAQHAwMFAQIBAQIBBQMDBwQECAT9qgQIBAQHAwMFAQIBAQIBBQMDBwQECASAgBkSEhmAERkZEYAZEhIZgBEZGREDVQUEBQ4JCRUMCxkN/asNGQsMFQkIDgUFBQUFBQ4JCBUMCxkNAlUNGQsMFQkJDgUEBVUCAQIFAwIHBAQIBf2rBAkDBAcDAwUBAgICAgEFAwMHBAMJBAJVBQgEBAcCAwUCAQL+gIASGRkSgBkSERmAEhkZEoAZERIZAAABAOIAjQMeAskAIAAAExcHBhQXFjI/ARcWMjc2NC8BNzY0JyYiDwEnJiIHBhQX4uLiDQ0MJAzi4gwkDA0N4uINDQwkDOLiDCQMDQ0CjeLiDSMMDQ3h4Q0NDCMN4uIMIw0MDOLiDAwNIwwAAAABAAAAAQAAa5n0y18PPPUACwQAAAAAANivOVsAAAAA2K85WwAAAAADqwNVAAAACAACAAAAAAAAAAEAAAPA/8AAAAQAAAAAAAOrAAEAAAAAAAAAAAAAAAAAAAALBAAAAAAAAAAAAAAAAgAAAAQAAWIEAAFiBAAA4gQAAOIEAABVBAAAVQQAAOIAAAAAAAoAFAAeAEQAagCqAOoBngJkApoAAQAAAAsAigADAAAAAAACAAAAAAAAAAAAAAAAAAAAAAAAAA4ArgABAAAAAAABAAcAAAABAAAAAAACAAcAYAABAAAAAAADAAcANgABAAAAAAAEAAcAdQABAAAAAAAFAAsAFQABAAAAAAAGAAcASwABAAAAAAAKABoAigADAAEECQABAA4ABwADAAEECQACAA4AZwADAAEECQADAA4APQADAAEECQAEAA4AfAADAAEECQAFABYAIAADAAEECQAGAA4AUgADAAEECQAKADQApGZjaWNvbnMAZgBjAGkAYwBvAG4Ac1ZlcnNpb24gMS4wAFYAZQByAHMAaQBvAG4AIAAxAC4AMGZjaWNvbnMAZgBjAGkAYwBvAG4Ac2ZjaWNvbnMAZgBjAGkAYwBvAG4Ac1JlZ3VsYXIAUgBlAGcAdQBsAGEAcmZjaWNvbnMAZgBjAGkAYwBvAG4Ac0ZvbnQgZ2VuZXJhdGVkIGJ5IEljb01vb24uAEYAbwBuAHQAIABnAGUAbgBlAHIAYQB0AGUAZAAgAGIAeQAgAEkAYwBvAE0AbwBvAG4ALgAAAAMAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA=") format("truetype")}.fc-icon{speak:none;-webkit-font-smoothing:antialiased;-moz-osx-font-smoothing:grayscale;display:inline-block;font-family:fcicons!important;font-style:normal;font-variant:normal;font-weight:400;height:1em;line-height:1;text-align:center;text-transform:none;-webkit-user-select:none;-moz-user-select:none;user-select:none;width:1em}.fc-icon-chevron-left:before{content:"\\e900"}.fc-icon-chevron-right:before{content:"\\e901"}.fc-icon-chevrons-left:before{content:"\\e902"}.fc-icon-chevrons-right:before{content:"\\e903"}.fc-icon-minus-square:before{content:"\\e904"}.fc-icon-plus-square:before{content:"\\e905"}.fc-icon-x:before{content:"\\e906"}.fc .fc-button{border-radius:0;font-family:inherit;font-size:inherit;line-height:inherit;margin:0;overflow:visible;text-transform:none}.fc .fc-button:focus{outline:1px dotted;outline:5px auto -webkit-focus-ring-color}.fc .fc-button{-webkit-appearance:button}.fc .fc-button:not(:disabled){cursor:pointer}.fc .fc-button{background-color:transparent;border:1px solid transparent;border-radius:.25em;display:inline-block;font-size:1em;font-weight:400;line-height:1.5;padding:.4em .65em;text-align:center;-webkit-user-select:none;-moz-user-select:none;user-select:none;vertical-align:middle}.fc .fc-button:hover{text-decoration:none}.fc .fc-button:focus{box-shadow:0 0 0 .2rem rgba(44,62,80,.25);outline:0}.fc .fc-button:disabled{opacity:.65}.fc .fc-button-primary{background-color:var(--fc-button-bg-color);border-color:var(--fc-button-border-color);color:var(--fc-button-text-color)}.fc .fc-button-primary:hover{background-color:var(--fc-button-hover-bg-color);border-color:var(--fc-button-hover-border-color);color:var(--fc-button-text-color)}.fc .fc-button-primary:disabled{background-color:var(--fc-button-bg-color);border-color:var(--fc-button-border-color);color:var(--fc-button-text-color)}.fc .fc-button-primary:focus{box-shadow:0 0 0 .2rem rgba(76,91,106,.5)}.fc .fc-button-primary:not(:disabled).fc-button-active,.fc .fc-button-primary:not(:disabled):active{background-color:var(--fc-button-active-bg-color);border-color:var(--fc-button-active-border-color);color:var(--fc-button-text-color)}.fc .fc-button-primary:not(:disabled).fc-button-active:focus,.fc .fc-button-primary:not(:disabled):active:focus{box-shadow:0 0 0 .2rem rgba(76,91,106,.5)}.fc .fc-button .fc-icon{font-size:1.5em;vertical-align:middle}.fc .fc-button-group{display:inline-flex;position:relative;vertical-align:middle}.fc .fc-button-group>.fc-button{flex:1 1 auto;position:relative}.fc .fc-button-group>.fc-button.fc-button-active,.fc .fc-button-group>.fc-button:active,.fc .fc-button-group>.fc-button:focus,.fc .fc-button-group>.fc-button:hover{z-index:1}.fc-direction-ltr .fc-button-group>.fc-button:not(:first-child){border-bottom-left-radius:0;border-top-left-radius:0;margin-left:-1px}.fc-direction-ltr .fc-button-group>.fc-button:not(:last-child){border-bottom-right-radius:0;border-top-right-radius:0}.fc-direction-rtl .fc-button-group>.fc-button:not(:first-child){border-bottom-right-radius:0;border-top-right-radius:0;margin-right:-1px}.fc-direction-rtl .fc-button-group>.fc-button:not(:last-child){border-bottom-left-radius:0;border-top-left-radius:0}.fc .fc-toolbar{align-items:center;display:flex;justify-content:space-between}.fc .fc-toolbar.fc-header-toolbar{margin-bottom:1.5em}.fc .fc-toolbar.fc-footer-toolbar{margin-top:1.5em}.fc .fc-toolbar-title{font-size:1.75em;margin:0}.fc-direction-ltr .fc-toolbar>*>:not(:first-child){margin-left:.75em}.fc-direction-rtl .fc-toolbar>*>:not(:first-child){margin-right:.75em}.fc-direction-rtl .fc-toolbar-ltr{flex-direction:row-reverse}.fc .fc-scroller{-webkit-overflow-scrolling:touch;position:relative}.fc .fc-scroller-liquid{height:100%}.fc .fc-scroller-liquid-absolute{bottom:0;left:0;position:absolute;right:0;top:0}.fc .fc-scroller-harness{direction:ltr;overflow:hidden;position:relative}.fc .fc-scroller-harness-liquid{height:100%}.fc-direction-rtl .fc-scroller-harness>.fc-scroller{direction:rtl}.fc-theme-standard .fc-scrollgrid{border:1px solid var(--fc-border-color)}.fc .fc-scrollgrid,.fc .fc-scrollgrid table{table-layout:fixed;width:100%}.fc .fc-scrollgrid table{border-left-style:hidden;border-right-style:hidden;border-top-style:hidden}.fc .fc-scrollgrid{border-bottom-width:0;border-collapse:separate;border-right-width:0}.fc .fc-scrollgrid-liquid{height:100%}.fc .fc-scrollgrid-section,.fc .fc-scrollgrid-section table,.fc .fc-scrollgrid-section>td{height:1px}.fc .fc-scrollgrid-section-liquid>td{height:100%}.fc .fc-scrollgrid-section>*{border-left-width:0;border-top-width:0}.fc .fc-scrollgrid-section-footer>*,.fc .fc-scrollgrid-section-header>*{border-bottom-width:0}.fc .fc-scrollgrid-section-body table,.fc .fc-scrollgrid-section-footer table{border-bottom-style:hidden}.fc .fc-scrollgrid-section-sticky>*{background:var(--fc-page-bg-color);position:sticky;z-index:3}.fc .fc-scrollgrid-section-header.fc-scrollgrid-section-sticky>*{top:0}.fc .fc-scrollgrid-section-footer.fc-scrollgrid-section-sticky>*{bottom:0}.fc .fc-scrollgrid-sticky-shim{height:1px;margin-bottom:-1px}.fc-sticky{position:sticky}.fc .fc-view-harness{flex-grow:1;position:relative}.fc .fc-view-harness-active>.fc-view{bottom:0;left:0;position:absolute;right:0;top:0}.fc .fc-col-header-cell-cushion{display:inline-block;padding:2px 4px}.fc .fc-bg-event,.fc .fc-highlight,.fc .fc-non-business{bottom:0;left:0;position:absolute;right:0;top:0}.fc .fc-non-business{background:var(--fc-non-business-color)}.fc .fc-bg-event{background:var(--fc-bg-event-color);opacity:var(--fc-bg-event-opacity)}.fc .fc-bg-event .fc-event-title{font-size:var(--fc-small-font-size);font-style:italic;margin:.5em}.fc .fc-highlight{background:var(--fc-highlight-color)}.fc .fc-cell-shaded,.fc .fc-day-disabled{background:var(--fc-neutral-bg-color)}a.fc-event,a.fc-event:hover{text-decoration:none}.fc-event.fc-event-draggable,.fc-event[href]{cursor:pointer}.fc-event .fc-event-main{position:relative;z-index:2}.fc-event-dragging:not(.fc-event-selected){opacity:.75}.fc-event-dragging.fc-event-selected{box-shadow:0 2px 7px rgba(0,0,0,.3)}.fc-event .fc-event-resizer{display:none;position:absolute;z-index:4}.fc-event-selected .fc-event-resizer,.fc-event:hover .fc-event-resizer{display:block}.fc-event-selected .fc-event-resizer{background:var(--fc-page-bg-color);border-color:inherit;border-radius:calc(var(--fc-event-resizer-dot-total-width)/2);border-style:solid;border-width:var(--fc-event-resizer-dot-border-width);height:var(--fc-event-resizer-dot-total-width);width:var(--fc-event-resizer-dot-total-width)}.fc-event-selected .fc-event-resizer:before{bottom:-20px;content:"";left:-20px;position:absolute;right:-20px;top:-20px}.fc-event-selected,.fc-event:focus{box-shadow:0 2px 5px rgba(0,0,0,.2)}.fc-event-selected:before,.fc-event:focus:before{bottom:0;content:"";left:0;position:absolute;right:0;top:0;z-index:3}.fc-event-selected:after,.fc-event:focus:after{background:var(--fc-event-selected-overlay-color);bottom:-1px;content:"";left:-1px;position:absolute;right:-1px;top:-1px;z-index:1}.fc-h-event{background-color:var(--fc-event-bg-color);border:1px solid var(--fc-event-border-color);display:block}.fc-h-event .fc-event-main{color:var(--fc-event-text-color)}.fc-h-event .fc-event-main-frame{display:flex}.fc-h-event .fc-event-time{max-width:100%;overflow:hidden}.fc-h-event .fc-event-title-container{flex-grow:1;flex-shrink:1;min-width:0}.fc-h-event .fc-event-title{display:inline-block;left:0;max-width:100%;overflow:hidden;right:0;vertical-align:top}.fc-h-event.fc-event-selected:before{bottom:-10px;top:-10px}.fc-direction-ltr .fc-daygrid-block-event:not(.fc-event-start),.fc-direction-rtl .fc-daygrid-block-event:not(.fc-event-end){border-bottom-left-radius:0;border-left-width:0;border-top-left-radius:0}.fc-direction-ltr .fc-daygrid-block-event:not(.fc-event-end),.fc-direction-rtl .fc-daygrid-block-event:not(.fc-event-start){border-bottom-right-radius:0;border-right-width:0;border-top-right-radius:0}.fc-h-event:not(.fc-event-selected) .fc-event-resizer{bottom:0;top:0;width:var(--fc-event-resizer-thickness)}.fc-direction-ltr .fc-h-event:not(.fc-event-selected) .fc-event-resizer-start,.fc-direction-rtl .fc-h-event:not(.fc-event-selected) .fc-event-resizer-end{cursor:w-resize;left:calc(var(--fc-event-resizer-thickness)*-.5)}.fc-direction-ltr .fc-h-event:not(.fc-event-selected) .fc-event-resizer-end,.fc-direction-rtl .fc-h-event:not(.fc-event-selected) .fc-event-resizer-start{cursor:e-resize;right:calc(var(--fc-event-resizer-thickness)*-.5)}.fc-h-event.fc-event-selected .fc-event-resizer{margin-top:calc(var(--fc-event-resizer-dot-total-width)*-.5);top:50%}.fc-direction-ltr .fc-h-event.fc-event-selected .fc-event-resizer-start,.fc-direction-rtl .fc-h-event.fc-event-selected .fc-event-resizer-end{left:calc(var(--fc-event-resizer-dot-total-width)*-.5)}.fc-direction-ltr .fc-h-event.fc-event-selected .fc-event-resizer-end,.fc-direction-rtl .fc-h-event.fc-event-selected .fc-event-resizer-start{right:calc(var(--fc-event-resizer-dot-total-width)*-.5)}.fc .fc-popover{box-shadow:0 2px 6px rgba(0,0,0,.15);position:absolute;z-index:9999}.fc .fc-popover-header{align-items:center;display:flex;flex-direction:row;justify-content:space-between;padding:3px 4px}.fc .fc-popover-title{margin:0 2px}.fc .fc-popover-close{cursor:pointer;font-size:1.1em;opacity:.65}.fc-theme-standard .fc-popover{background:var(--fc-page-bg-color);border:1px solid var(--fc-border-color)}.fc-theme-standard .fc-popover-header{background:var(--fc-neutral-bg-color)}';
Xs(aw);
class Go {
  constructor(e) {
    this.drainedOption = e, this.isRunning = !1, this.isDirty = !1, this.pauseDepths = {}, this.timeoutId = 0;
  }
  request(e) {
    this.isDirty = !0, this.isPaused() || (this.clearTimeout(), e == null ? this.tryDrain() : this.timeoutId = setTimeout(
      // NOT OPTIMAL! TODO: look at debounce
      this.tryDrain.bind(this),
      e
    ));
  }
  pause(e = "") {
    let { pauseDepths: n } = this;
    n[e] = (n[e] || 0) + 1, this.clearTimeout();
  }
  resume(e = "", n) {
    let { pauseDepths: a } = this;
    e in a && (n ? delete a[e] : (a[e] -= 1, a[e] <= 0 && delete a[e]), this.tryDrain());
  }
  isPaused() {
    return Object.keys(this.pauseDepths).length;
  }
  tryDrain() {
    if (!this.isRunning && !this.isPaused()) {
      for (this.isRunning = !0; this.isDirty; )
        this.isDirty = !1, this.drained();
      this.isRunning = !1;
    }
  }
  clear() {
    this.clearTimeout(), this.isDirty = !1, this.pauseDepths = {};
  }
  clearTimeout() {
    this.timeoutId && (clearTimeout(this.timeoutId), this.timeoutId = 0);
  }
  drained() {
    this.drainedOption && this.drainedOption();
  }
}
function $o(t) {
  t.parentNode && t.parentNode.removeChild(t);
}
function ae(t, e) {
  if (t.closest)
    return t.closest(e);
  if (!document.documentElement.contains(t))
    return null;
  do {
    if (rw(t, e))
      return t;
    t = t.parentElement || t.parentNode;
  } while (t !== null && t.nodeType === 1);
  return null;
}
function rw(t, e) {
  return (t.matches || t.matchesSelector || t.msMatchesSelector).call(t, e);
}
function ow(t, e) {
  let n = t instanceof HTMLElement ? [t] : t, a = [];
  for (let r = 0; r < n.length; r += 1) {
    let o = n[r].querySelectorAll(e);
    for (let i = 0; i < o.length; i += 1)
      a.push(o[i]);
  }
  return a;
}
const iw = /(top|left|right|bottom|width|height)$/i;
function Mt(t, e) {
  for (let n in e)
    tc(t, n, e[n]);
}
function tc(t, e, n) {
  n == null ? t.style[e] = "" : typeof n == "number" && iw.test(e) ? t.style[e] = `${n}px` : t.style[e] = n;
}
function nc(t) {
  var e, n;
  return (n = (e = t.composedPath) === null || e === void 0 ? void 0 : e.call(t)[0]) !== null && n !== void 0 ? n : t.target;
}
let il = 0;
function Bn() {
  return il += 1, "fc-dom-" + il;
}
function Ln(t) {
  t.preventDefault();
}
function lw(t, e) {
  return (n) => {
    let a = ae(n.target, t);
    a && e.call(a, n, a);
  };
}
function ac(t, e, n, a) {
  let r = lw(n, a);
  return t.addEventListener(e, r), () => {
    t.removeEventListener(e, r);
  };
}
function sw(t, e, n, a) {
  let r;
  return ac(t, "mouseover", e, (o, i) => {
    if (i !== r) {
      r = i, n(o, i);
      let l = (s) => {
        r = null, a(s, i), i.removeEventListener("mouseleave", l);
      };
      i.addEventListener("mouseleave", l);
    }
  });
}
const ll = [
  "webkitTransitionEnd",
  "otransitionend",
  "oTransitionEnd",
  "msTransitionEnd",
  "transitionend"
];
function cw(t, e) {
  let n = (a) => {
    e(a), ll.forEach((r) => {
      t.removeEventListener(r, n);
    });
  };
  ll.forEach((a) => {
    t.addEventListener(a, n);
  });
}
function rc(t) {
  return Object.assign({ onClick: t }, oc(t));
}
function oc(t) {
  return {
    tabIndex: 0,
    onKeyDown(e) {
      (e.key === "Enter" || e.key === " ") && (t(e), e.preventDefault());
    }
  };
}
let sl = 0;
function Je() {
  return sl += 1, String(sl);
}
function Qo() {
  document.body.classList.add("fc-not-allowed");
}
function Yo() {
  document.body.classList.remove("fc-not-allowed");
}
function dw(t) {
  t.style.userSelect = "none", t.style.webkitUserSelect = "none", t.addEventListener("selectstart", Ln);
}
function uw(t) {
  t.style.userSelect = "", t.style.webkitUserSelect = "", t.removeEventListener("selectstart", Ln);
}
function mw(t) {
  t.addEventListener("contextmenu", Ln);
}
function hw(t) {
  t.removeEventListener("contextmenu", Ln);
}
function fw(t) {
  let e = [], n = [], a, r;
  for (typeof t == "string" ? n = t.split(/\s*,\s*/) : typeof t == "function" ? n = [t] : Array.isArray(t) && (n = t), a = 0; a < n.length; a += 1)
    r = n[a], typeof r == "string" ? e.push(r.charAt(0) === "-" ? { field: r.substring(1), order: -1 } : { field: r, order: 1 }) : typeof r == "function" && e.push({ func: r });
  return e;
}
function pw(t, e, n) {
  let a, r;
  for (a = 0; a < n.length; a += 1)
    if (r = gw(t, e, n[a]), r)
      return r;
  return 0;
}
function gw(t, e, n) {
  return n.func ? n.func(t, e) : vw(t[n.field], e[n.field]) * (n.order || 1);
}
function vw(t, e) {
  return !t && !e ? 0 : e == null ? -1 : t == null ? 1 : typeof t == "string" || typeof e == "string" ? String(t).localeCompare(String(e)) : t - e;
}
function Qr(t, e) {
  let n = String(t);
  return "000".substr(0, e - n.length) + n;
}
function Dt(t, e, n) {
  return typeof t == "function" ? t(...e) : typeof t == "string" ? e.reduce((a, r, o) => a.replace("$" + o, r || ""), t) : n;
}
function _w(t, e) {
  return t - e;
}
function Yr(t) {
  return t % 1 === 0;
}
function ww(t) {
  let e = t.querySelector(".fc-scrollgrid-shrink-frame"), n = t.querySelector(".fc-scrollgrid-shrink-cushion");
  if (!e)
    throw new Error("needs fc-scrollgrid-shrink-frame className");
  if (!n)
    throw new Error("needs fc-scrollgrid-shrink-cushion className");
  return t.getBoundingClientRect().width - e.getBoundingClientRect().width + // the cell padding+border
  n.getBoundingClientRect().width;
}
const yw = /^(-?)(?:(\d+)\.)?(\d+):(\d\d)(?::(\d\d)(?:\.(\d\d\d))?)?/;
function L(t, e) {
  return typeof t == "string" ? bw(t) : typeof t == "object" && t ? cl(t) : typeof t == "number" ? cl({ [e || "milliseconds"]: t }) : null;
}
function bw(t) {
  let e = yw.exec(t);
  if (e) {
    let n = e[1] ? -1 : 1;
    return {
      years: 0,
      months: 0,
      days: n * (e[2] ? parseInt(e[2], 10) : 0),
      milliseconds: n * ((e[3] ? parseInt(e[3], 10) : 0) * 60 * 60 * 1e3 + // hours
      (e[4] ? parseInt(e[4], 10) : 0) * 60 * 1e3 + // minutes
      (e[5] ? parseInt(e[5], 10) : 0) * 1e3 + // seconds
      (e[6] ? parseInt(e[6], 10) : 0))
    };
  }
  return null;
}
function cl(t) {
  let e = {
    years: t.years || t.year || 0,
    months: t.months || t.month || 0,
    days: t.days || t.day || 0,
    milliseconds: (t.hours || t.hour || 0) * 60 * 60 * 1e3 + // hours
    (t.minutes || t.minute || 0) * 60 * 1e3 + // minutes
    (t.seconds || t.second || 0) * 1e3 + // seconds
    (t.milliseconds || t.millisecond || t.ms || 0)
    // ms
  }, n = t.weeks || t.week;
  return n && (e.days += n * 7, e.specifiedWeeks = !0), e;
}
function Cw(t, e) {
  return t.years === e.years && t.months === e.months && t.days === e.days && t.milliseconds === e.milliseconds;
}
function Aw(t, e) {
  return {
    years: t.years - e.years,
    months: t.months - e.months,
    days: t.days - e.days,
    milliseconds: t.milliseconds - e.milliseconds
  };
}
function xw(t) {
  return ut(t) / 365;
}
function Ew(t) {
  return ut(t) / 30;
}
function ut(t) {
  return Vt(t) / 864e5;
}
function Vt(t) {
  return t.years * (365 * 864e5) + t.months * (30 * 864e5) + t.days * 864e5 + t.milliseconds;
}
function po(t) {
  let e = t.milliseconds;
  if (e) {
    if (e % 1e3 !== 0)
      return { unit: "millisecond", value: e };
    if (e % (1e3 * 60) !== 0)
      return { unit: "second", value: e / 1e3 };
    if (e % (1e3 * 60 * 60) !== 0)
      return { unit: "minute", value: e / (1e3 * 60) };
    if (e)
      return { unit: "hour", value: e / (1e3 * 60 * 60) };
  }
  return t.days ? t.specifiedWeeks && t.days % 7 === 0 ? { unit: "week", value: t.days / 7 } : { unit: "day", value: t.days } : t.months ? { unit: "month", value: t.months } : t.years ? { unit: "year", value: t.years } : { unit: "millisecond", value: 0 };
}
function He(t, e, n) {
  if (t === e)
    return !0;
  let a = t.length, r;
  if (a !== e.length)
    return !1;
  for (r = 0; r < a; r += 1)
    if (!(n ? n(t[r], e[r]) : t[r] === e[r]))
      return !1;
  return !0;
}
const Sw = ["sun", "mon", "tue", "wed", "thu", "fri", "sat"];
function dl(t, e) {
  let n = De(t);
  return n[2] += e * 7, ie(n);
}
function X(t, e) {
  let n = De(t);
  return n[2] += e, ie(n);
}
function Ie(t, e) {
  let n = De(t);
  return n[6] += e, ie(n);
}
function Mw(t, e) {
  return yt(t, e) / 7;
}
function yt(t, e) {
  return (e.valueOf() - t.valueOf()) / (1e3 * 60 * 60 * 24);
}
function Dw(t, e) {
  return (e.valueOf() - t.valueOf()) / (1e3 * 60 * 60);
}
function Tw(t, e) {
  return (e.valueOf() - t.valueOf()) / (1e3 * 60);
}
function Rw(t, e) {
  return (e.valueOf() - t.valueOf()) / 1e3;
}
function Hw(t, e) {
  let n = G(t), a = G(e);
  return {
    years: 0,
    months: 0,
    days: Math.round(yt(n, a)),
    milliseconds: e.valueOf() - a.valueOf() - (t.valueOf() - n.valueOf())
  };
}
function Iw(t, e) {
  let n = _n(t, e);
  return n !== null && n % 7 === 0 ? n / 7 : null;
}
function _n(t, e) {
  return Te(t) === Te(e) ? Math.round(yt(t, e)) : null;
}
function G(t) {
  return ie([
    t.getUTCFullYear(),
    t.getUTCMonth(),
    t.getUTCDate()
  ]);
}
function kw(t) {
  return ie([
    t.getUTCFullYear(),
    t.getUTCMonth(),
    t.getUTCDate(),
    t.getUTCHours()
  ]);
}
function zw(t) {
  return ie([
    t.getUTCFullYear(),
    t.getUTCMonth(),
    t.getUTCDate(),
    t.getUTCHours(),
    t.getUTCMinutes()
  ]);
}
function Vw(t) {
  return ie([
    t.getUTCFullYear(),
    t.getUTCMonth(),
    t.getUTCDate(),
    t.getUTCHours(),
    t.getUTCMinutes(),
    t.getUTCSeconds()
  ]);
}
function Ow(t, e, n) {
  let a = t.getUTCFullYear(), r = Zr(t, a, e, n);
  if (r < 1)
    return Zr(t, a - 1, e, n);
  let o = Zr(t, a + 1, e, n);
  return o >= 1 ? Math.min(r, o) : r;
}
function Zr(t, e, n, a) {
  let r = ie([e, 0, 1 + Bw(e, n, a)]), o = G(t), i = Math.round(yt(r, o));
  return Math.floor(i / 7) + 1;
}
function Bw(t, e, n) {
  let a = 7 + e - n;
  return -((7 + ie([t, 0, a]).getUTCDay() - e) % 7) + a - 1;
}
function ul(t) {
  return [
    t.getFullYear(),
    t.getMonth(),
    t.getDate(),
    t.getHours(),
    t.getMinutes(),
    t.getSeconds(),
    t.getMilliseconds()
  ];
}
function ml(t) {
  return new Date(
    t[0],
    t[1] || 0,
    t[2] == null ? 1 : t[2],
    // day of month
    t[3] || 0,
    t[4] || 0,
    t[5] || 0
  );
}
function De(t) {
  return [
    t.getUTCFullYear(),
    t.getUTCMonth(),
    t.getUTCDate(),
    t.getUTCHours(),
    t.getUTCMinutes(),
    t.getUTCSeconds(),
    t.getUTCMilliseconds()
  ];
}
function ie(t) {
  return t.length === 1 && (t = t.concat([0])), new Date(Date.UTC(...t));
}
function ic(t) {
  return !isNaN(t.valueOf());
}
function Te(t) {
  return t.getUTCHours() * 1e3 * 60 * 60 + t.getUTCMinutes() * 1e3 * 60 + t.getUTCSeconds() * 1e3 + t.getUTCMilliseconds();
}
function Lw(t, e, n = !1) {
  let a = t.toISOString();
  return a = a.replace(".000", ""), n && (a = a.replace("T00:00:00Z", "")), a.length > 10 && (e == null ? a = a.replace("Z", "") : e !== 0 && (a = a.replace("Z", Ko(e, !0)))), a;
}
function Zo(t) {
  return t.toISOString().replace(/T.*$/, "");
}
function Nw(t) {
  return t.toISOString().match(/^\d{4}-\d{2}/)[0];
}
function Ko(t, e = !1) {
  let n = t < 0 ? "-" : "+", a = Math.abs(t), r = Math.floor(a / 60), o = Math.round(a % 60);
  return e ? `${n + Qr(r, 2)}:${Qr(o, 2)}` : `GMT${n}${r}${o ? `:${Qr(o, 2)}` : ""}`;
}
function O(t, e, n) {
  let a, r;
  return function(...o) {
    if (!a)
      r = t.apply(this, o);
    else if (!He(a, o)) {
      let i = t.apply(this, o);
      (!e || !e(i, r)) && (r = i);
    }
    return a = o, r;
  };
}
function sn(t, e, n) {
  let a, r;
  return (o) => (a ? pe(a, o) || (r = t.call(this, o)) : r = t.call(this, o), a = o, r);
}
const Kr = {
  week: 3,
  separator: 9,
  omitZeroMinute: 9,
  meridiem: 9,
  omitCommas: 9
}, wn = {
  timeZoneName: 7,
  era: 6,
  year: 5,
  month: 4,
  day: 2,
  weekday: 2,
  hour: 1,
  minute: 1,
  second: 1
}, Kt = /\s*([ap])\.?m\.?/i, Pw = /,/g, jw = /\s+/g, qw = /\u200e/g, Fw = /UTC|GMT/;
class Uw {
  constructor(e) {
    let n = {}, a = {}, r = 9;
    for (let o in e)
      o in Kr ? (a[o] = e[o], Kr[o] < 9 && (r = Math.min(Kr[o], r))) : (n[o] = e[o], o in wn && (r = Math.min(wn[o], r)));
    this.standardDateProps = n, this.extendedSettings = a, this.smallestUnitNum = r, this.buildFormattingFunc = O(hl);
  }
  format(e, n) {
    return this.buildFormattingFunc(this.standardDateProps, this.extendedSettings, n)(e);
  }
  formatRange(e, n, a, r) {
    let { standardDateProps: o, extendedSettings: i } = this, l = Zw(e.marker, n.marker, a.calendarSystem);
    if (!l)
      return this.format(e, a);
    let s = l;
    s > 1 && // the two dates are different in a way that's larger scale than time
    (o.year === "numeric" || o.year === "2-digit") && (o.month === "numeric" || o.month === "2-digit") && (o.day === "numeric" || o.day === "2-digit") && (s = 1);
    let u = this.format(e, a), d = this.format(n, a);
    if (u === d)
      return u;
    let g = Kw(o, s), v = hl(g, i, a), p = v(e), w = v(n), _ = Xw(u, p, d, w), y = i.separator || r || a.defaultSeparator || "";
    return _ ? _.before + p + y + w + _.after : u + y + d;
  }
  getSmallestUnit() {
    switch (this.smallestUnitNum) {
      case 7:
      case 6:
      case 5:
        return "year";
      case 4:
        return "month";
      case 3:
        return "week";
      case 2:
        return "day";
      default:
        return "time";
    }
  }
}
function hl(t, e, n) {
  let a = Object.keys(t).length;
  return a === 1 && t.timeZoneName === "short" ? (r) => Ko(r.timeZoneOffset) : a === 0 && e.week ? (r) => Yw(n.computeWeekNumber(r.marker), n.weekText, n.weekTextLong, n.locale, e.week) : Ww(t, e, n);
}
function Ww(t, e, n) {
  t = Object.assign({}, t), e = Object.assign({}, e), Gw(t, e), t.timeZone = "UTC";
  let a = new Intl.DateTimeFormat(n.locale.codes, t), r;
  if (e.omitZeroMinute) {
    let o = Object.assign({}, t);
    delete o.minute, r = new Intl.DateTimeFormat(n.locale.codes, o);
  }
  return (o) => {
    let { marker: i } = o, l;
    r && !i.getUTCMinutes() ? l = r : l = a;
    let s = l.format(i);
    return $w(s, o, t, e, n);
  };
}
function Gw(t, e) {
  t.timeZoneName && (t.hour || (t.hour = "2-digit"), t.minute || (t.minute = "2-digit")), t.timeZoneName === "long" && (t.timeZoneName = "short"), e.omitZeroMinute && (t.second || t.millisecond) && delete e.omitZeroMinute;
}
function $w(t, e, n, a, r) {
  return t = t.replace(qw, ""), n.timeZoneName === "short" && (t = Qw(t, r.timeZone === "UTC" || e.timeZoneOffset == null ? "UTC" : (
    // important to normalize for IE, which does "GMT"
    Ko(e.timeZoneOffset)
  ))), a.omitCommas && (t = t.replace(Pw, "").trim()), a.omitZeroMinute && (t = t.replace(":00", "")), a.meridiem === !1 ? t = t.replace(Kt, "").trim() : a.meridiem === "narrow" ? t = t.replace(Kt, (o, i) => i.toLocaleLowerCase()) : a.meridiem === "short" ? t = t.replace(Kt, (o, i) => `${i.toLocaleLowerCase()}m`) : a.meridiem === "lowercase" && (t = t.replace(Kt, (o) => o.toLocaleLowerCase())), t = t.replace(jw, " "), t = t.trim(), t;
}
function Qw(t, e) {
  let n = !1;
  return t = t.replace(Fw, () => (n = !0, e)), n || (t += ` ${e}`), t;
}
function Yw(t, e, n, a, r) {
  let o = [];
  return r === "long" ? o.push(n) : (r === "short" || r === "narrow") && o.push(e), (r === "long" || r === "short") && o.push(" "), o.push(a.simpleNumberFormat.format(t)), a.options.direction === "rtl" && o.reverse(), o.join("");
}
function Zw(t, e, n) {
  return n.getMarkerYear(t) !== n.getMarkerYear(e) ? 5 : n.getMarkerMonth(t) !== n.getMarkerMonth(e) ? 4 : n.getMarkerDay(t) !== n.getMarkerDay(e) ? 2 : Te(t) !== Te(e) ? 1 : 0;
}
function Kw(t, e) {
  let n = {};
  for (let a in t)
    (!(a in wn) || // not a date part prop (like timeZone)
    wn[a] <= e) && (n[a] = t[a]);
  return n;
}
function Xw(t, e, n, a) {
  let r = 0;
  for (; r < t.length; ) {
    let o = t.indexOf(e, r);
    if (o === -1)
      break;
    let i = t.substr(0, o);
    r = o + e.length;
    let l = t.substr(r), s = 0;
    for (; s < n.length; ) {
      let u = n.indexOf(a, s);
      if (u === -1)
        break;
      let d = n.substr(0, u);
      s = u + a.length;
      let g = n.substr(s);
      if (i === d && l === g)
        return {
          before: i,
          after: l
        };
    }
  }
  return null;
}
function fl(t, e) {
  let n = e.markerToArray(t.marker);
  return {
    marker: t.marker,
    timeZoneOffset: t.timeZoneOffset,
    array: n,
    year: n[0],
    month: n[1],
    day: n[2],
    hour: n[3],
    minute: n[4],
    second: n[5],
    millisecond: n[6]
  };
}
function yn(t, e, n, a) {
  let r = fl(t, n.calendarSystem), o = e ? fl(e, n.calendarSystem) : null;
  return {
    date: r,
    start: r,
    end: o,
    timeZone: n.timeZone,
    localeCodes: n.locale.codes,
    defaultSeparator: a || n.defaultSeparator
  };
}
class Jw {
  constructor(e) {
    this.cmdStr = e;
  }
  format(e, n, a) {
    return n.cmdFormatter(this.cmdStr, yn(e, null, n, a));
  }
  formatRange(e, n, a, r) {
    return a.cmdFormatter(this.cmdStr, yn(e, n, a, r));
  }
}
class ey {
  constructor(e) {
    this.func = e;
  }
  format(e, n, a) {
    return this.func(yn(e, null, n, a));
  }
  formatRange(e, n, a, r) {
    return this.func(yn(e, n, a, r));
  }
}
function K(t) {
  return typeof t == "object" && t ? new Uw(t) : typeof t == "string" ? new Jw(t) : typeof t == "function" ? new ey(t) : null;
}
const pl = {
  navLinkDayClick: b,
  navLinkWeekClick: b,
  duration: L,
  bootstrapFontAwesome: b,
  buttonIcons: b,
  customButtons: b,
  defaultAllDayEventDuration: L,
  defaultTimedEventDuration: L,
  nextDayThreshold: L,
  scrollTime: L,
  scrollTimeReset: Boolean,
  slotMinTime: L,
  slotMaxTime: L,
  dayPopoverFormat: K,
  slotDuration: L,
  snapDuration: L,
  headerToolbar: b,
  footerToolbar: b,
  defaultRangeSeparator: String,
  titleRangeSeparator: String,
  forceEventDuration: Boolean,
  dayHeaders: Boolean,
  dayHeaderFormat: K,
  dayHeaderClassNames: b,
  dayHeaderContent: b,
  dayHeaderDidMount: b,
  dayHeaderWillUnmount: b,
  dayCellClassNames: b,
  dayCellContent: b,
  dayCellDidMount: b,
  dayCellWillUnmount: b,
  initialView: String,
  aspectRatio: Number,
  weekends: Boolean,
  weekNumberCalculation: b,
  weekNumbers: Boolean,
  weekNumberClassNames: b,
  weekNumberContent: b,
  weekNumberDidMount: b,
  weekNumberWillUnmount: b,
  editable: Boolean,
  viewClassNames: b,
  viewDidMount: b,
  viewWillUnmount: b,
  nowIndicator: Boolean,
  nowIndicatorSnap: b,
  nowIndicatorClassNames: b,
  nowIndicatorContent: b,
  nowIndicatorDidMount: b,
  nowIndicatorWillUnmount: b,
  showNonCurrentDates: Boolean,
  lazyFetching: Boolean,
  startParam: String,
  endParam: String,
  timeZoneParam: String,
  timeZone: String,
  locales: b,
  locale: b,
  themeSystem: String,
  dragRevertDuration: Number,
  dragScroll: Boolean,
  allDayMaintainDuration: Boolean,
  unselectAuto: Boolean,
  dropAccept: b,
  eventOrder: fw,
  eventOrderStrict: Boolean,
  handleWindowResize: Boolean,
  windowResizeDelay: Number,
  longPressDelay: Number,
  eventDragMinDistance: Number,
  expandRows: Boolean,
  height: b,
  contentHeight: b,
  direction: String,
  weekNumberFormat: K,
  eventResizableFromStart: Boolean,
  displayEventTime: Boolean,
  displayEventEnd: Boolean,
  weekText: String,
  weekTextLong: String,
  progressiveEventRendering: Boolean,
  businessHours: b,
  initialDate: b,
  now: b,
  eventDataTransform: b,
  stickyHeaderDates: b,
  stickyFooterScrollbar: b,
  viewHeight: b,
  defaultAllDay: Boolean,
  eventSourceFailure: b,
  eventSourceSuccess: b,
  eventDisplay: String,
  eventStartEditable: Boolean,
  eventDurationEditable: Boolean,
  eventOverlap: b,
  eventConstraint: b,
  eventAllow: b,
  eventBackgroundColor: String,
  eventBorderColor: String,
  eventTextColor: String,
  eventColor: String,
  eventClassNames: b,
  eventContent: b,
  eventDidMount: b,
  eventWillUnmount: b,
  selectConstraint: b,
  selectOverlap: b,
  selectAllow: b,
  droppable: Boolean,
  unselectCancel: String,
  slotLabelFormat: b,
  slotLaneClassNames: b,
  slotLaneContent: b,
  slotLaneDidMount: b,
  slotLaneWillUnmount: b,
  slotLabelClassNames: b,
  slotLabelContent: b,
  slotLabelDidMount: b,
  slotLabelWillUnmount: b,
  dayMaxEvents: b,
  dayMaxEventRows: b,
  dayMinWidth: Number,
  slotLabelInterval: L,
  allDayText: String,
  allDayClassNames: b,
  allDayContent: b,
  allDayDidMount: b,
  allDayWillUnmount: b,
  slotMinWidth: Number,
  navLinks: Boolean,
  eventTimeFormat: K,
  rerenderDelay: Number,
  moreLinkText: b,
  moreLinkHint: b,
  selectMinDistance: Number,
  selectable: Boolean,
  selectLongPressDelay: Number,
  eventLongPressDelay: Number,
  selectMirror: Boolean,
  eventMaxStack: Number,
  eventMinHeight: Number,
  eventMinWidth: Number,
  eventShortHeight: Number,
  slotEventOverlap: Boolean,
  plugins: b,
  firstDay: Number,
  dayCount: Number,
  dateAlignment: String,
  dateIncrement: L,
  hiddenDays: b,
  fixedWeekCount: Boolean,
  validRange: b,
  visibleRange: b,
  titleFormat: b,
  eventInteractive: Boolean,
  // only used by list-view, but languages define the value, so we need it in base options
  noEventsText: String,
  viewHint: b,
  navLinkHint: b,
  closeHint: String,
  timeHint: String,
  eventHint: String,
  moreLinkClick: b,
  moreLinkClassNames: b,
  moreLinkContent: b,
  moreLinkDidMount: b,
  moreLinkWillUnmount: b,
  monthStartFormat: K,
  // for connectors
  // (can't be part of plugin system b/c must be provided at runtime)
  handleCustomRendering: b,
  customRenderingMetaMap: b,
  customRenderingReplaces: Boolean
}, Tt = {
  eventDisplay: "auto",
  defaultRangeSeparator: " - ",
  titleRangeSeparator: " – ",
  defaultTimedEventDuration: "01:00:00",
  defaultAllDayEventDuration: { day: 1 },
  forceEventDuration: !1,
  nextDayThreshold: "00:00:00",
  dayHeaders: !0,
  initialView: "",
  aspectRatio: 1.35,
  headerToolbar: {
    start: "title",
    center: "",
    end: "today prev,next"
  },
  weekends: !0,
  weekNumbers: !1,
  weekNumberCalculation: "local",
  editable: !1,
  nowIndicator: !1,
  scrollTime: "06:00:00",
  scrollTimeReset: !0,
  slotMinTime: "00:00:00",
  slotMaxTime: "24:00:00",
  showNonCurrentDates: !0,
  lazyFetching: !0,
  startParam: "start",
  endParam: "end",
  timeZoneParam: "timeZone",
  timeZone: "local",
  locales: [],
  locale: "",
  themeSystem: "standard",
  dragRevertDuration: 500,
  dragScroll: !0,
  allDayMaintainDuration: !1,
  unselectAuto: !0,
  dropAccept: "*",
  eventOrder: "start,-duration,allDay,title",
  dayPopoverFormat: { month: "long", day: "numeric", year: "numeric" },
  handleWindowResize: !0,
  windowResizeDelay: 100,
  longPressDelay: 1e3,
  eventDragMinDistance: 5,
  expandRows: !1,
  navLinks: !1,
  selectable: !1,
  eventMinHeight: 15,
  eventMinWidth: 30,
  eventShortHeight: 30,
  monthStartFormat: { month: "long", day: "numeric" },
  nowIndicatorSnap: "auto"
}, gl = {
  datesSet: b,
  eventsSet: b,
  eventAdd: b,
  eventChange: b,
  eventRemove: b,
  windowResize: b,
  eventClick: b,
  eventMouseEnter: b,
  eventMouseLeave: b,
  select: b,
  unselect: b,
  loading: b,
  // internal
  _unmount: b,
  _beforeprint: b,
  _afterprint: b,
  _noEventDrop: b,
  _noEventResize: b,
  _resize: b,
  _scrollRequest: b
}, vl = {
  buttonText: b,
  buttonHints: b,
  views: b,
  plugins: b,
  initialEvents: b,
  events: b,
  eventSources: b
}, Le = {
  headerToolbar: Ne,
  footerToolbar: Ne,
  buttonText: Ne,
  buttonHints: Ne,
  buttonIcons: Ne,
  dateIncrement: Ne,
  plugins: Xt,
  events: Xt,
  eventSources: Xt,
  resources: Xt
};
function Ne(t, e) {
  return typeof t == "object" && typeof e == "object" && t && e ? pe(t, e) : t === e;
}
function Xt(t, e) {
  return Array.isArray(t) && Array.isArray(e) ? He(t, e) : t === e;
}
const ty = {
  type: String,
  component: b,
  buttonText: String,
  buttonTextKey: String,
  dateProfileGeneratorClass: b,
  usesMinMaxTime: Boolean,
  classNames: b,
  content: b,
  didMount: b,
  willUnmount: b
};
function Xr(t) {
  return Jo(t, Le);
}
function Xo(t, e) {
  let n = {}, a = {};
  for (let r in e)
    r in t && (n[r] = e[r](t[r]));
  for (let r in t)
    r in e || (a[r] = t[r]);
  return { refined: n, extra: a };
}
function b(t) {
  return t;
}
const { hasOwnProperty: bn } = Object.prototype;
function Jo(t, e) {
  let n = {};
  if (e) {
    for (let a in e)
      if (e[a] === Ne) {
        let r = [];
        for (let o = t.length - 1; o >= 0; o -= 1) {
          let i = t[o][a];
          if (typeof i == "object" && i)
            r.unshift(i);
          else if (i !== void 0) {
            n[a] = i;
            break;
          }
        }
        r.length && (n[a] = Jo(r));
      }
  }
  for (let a = t.length - 1; a >= 0; a -= 1) {
    let r = t[a];
    for (let o in r)
      o in n || (n[o] = r[o]);
  }
  return n;
}
function Ge(t, e) {
  let n = {};
  for (let a in t)
    e(t[a], a) && (n[a] = t[a]);
  return n;
}
function et(t, e) {
  let n = {};
  for (let a in t)
    n[a] = e(t[a], a);
  return n;
}
function lc(t) {
  let e = {};
  for (let n of t)
    e[n] = !0;
  return e;
}
function e2(t) {
  let e = [];
  for (let n in t)
    e.push(t[n]);
  return e;
}
function pe(t, e) {
  if (t === e)
    return !0;
  for (let n in t)
    if (bn.call(t, n) && !(n in e))
      return !1;
  for (let n in e)
    if (bn.call(e, n) && t[n] !== e[n])
      return !1;
  return !0;
}
const ny = /^on[A-Z]/;
function ay(t, e) {
  const n = ry(t, e);
  for (let a of n)
    if (!ny.test(a))
      return !1;
  return !0;
}
function ry(t, e) {
  let n = [];
  for (let a in t)
    bn.call(t, a) && (a in e || n.push(a));
  for (let a in e)
    bn.call(e, a) && t[a] !== e[a] && n.push(a);
  return n;
}
function Jr(t, e, n = {}) {
  if (t === e)
    return !0;
  for (let a in e)
    if (!(a in t && oy(t[a], e[a], n[a]))) return !1;
  for (let a in t)
    if (!(a in e))
      return !1;
  return !0;
}
function oy(t, e, n) {
  return t === e || n === !0 ? !0 : n ? n(t, e) : !1;
}
function iy(t, e = 0, n, a = 1) {
  let r = [];
  n == null && (n = Object.keys(t).length);
  for (let o = e; o < n; o += a) {
    let i = t[o];
    i !== void 0 && r.push(i);
  }
  return r;
}
let sc = {};
function ly(t, e) {
  sc[t] = e;
}
function sy(t) {
  return new sc[t]();
}
class cy {
  getMarkerYear(e) {
    return e.getUTCFullYear();
  }
  getMarkerMonth(e) {
    return e.getUTCMonth();
  }
  getMarkerDay(e) {
    return e.getUTCDate();
  }
  arrayToMarker(e) {
    return ie(e);
  }
  markerToArray(e) {
    return De(e);
  }
}
ly("gregory", cy);
const dy = /^\s*(\d{4})(-?(\d{2})(-?(\d{2})([T ](\d{2}):?(\d{2})(:?(\d{2})(\.(\d+))?)?(Z|(([-+])(\d{2})(:?(\d{2}))?))?)?)?)?$/;
function uy(t) {
  let e = dy.exec(t);
  if (e) {
    let n = new Date(Date.UTC(Number(e[1]), e[3] ? Number(e[3]) - 1 : 0, Number(e[5] || 1), Number(e[7] || 0), Number(e[8] || 0), Number(e[10] || 0), e[12] ? +`0.${e[12]}` * 1e3 : 0));
    if (ic(n)) {
      let a = null;
      return e[13] && (a = (e[15] === "-" ? -1 : 1) * (Number(e[16] || 0) * 60 + Number(e[18] || 0))), {
        marker: n,
        isTimeUnspecified: !e[6],
        timeZoneOffset: a
      };
    }
  }
  return null;
}
class my {
  constructor(e) {
    let n = this.timeZone = e.timeZone, a = n !== "local" && n !== "UTC";
    e.namedTimeZoneImpl && a && (this.namedTimeZoneImpl = new e.namedTimeZoneImpl(n)), this.canComputeOffset = !!(!a || this.namedTimeZoneImpl), this.calendarSystem = sy(e.calendarSystem), this.locale = e.locale, this.weekDow = e.locale.week.dow, this.weekDoy = e.locale.week.doy, e.weekNumberCalculation === "ISO" && (this.weekDow = 1, this.weekDoy = 4), typeof e.firstDay == "number" && (this.weekDow = e.firstDay), typeof e.weekNumberCalculation == "function" && (this.weekNumberFunc = e.weekNumberCalculation), this.weekText = e.weekText != null ? e.weekText : e.locale.options.weekText, this.weekTextLong = (e.weekTextLong != null ? e.weekTextLong : e.locale.options.weekTextLong) || this.weekText, this.cmdFormatter = e.cmdFormatter, this.defaultSeparator = e.defaultSeparator;
  }
  // Creating / Parsing
  createMarker(e) {
    let n = this.createMarkerMeta(e);
    return n === null ? null : n.marker;
  }
  createNowMarker() {
    return this.canComputeOffset ? this.timestampToMarker((/* @__PURE__ */ new Date()).valueOf()) : ie(ul(/* @__PURE__ */ new Date()));
  }
  createMarkerMeta(e) {
    if (typeof e == "string")
      return this.parse(e);
    let n = null;
    return typeof e == "number" ? n = this.timestampToMarker(e) : e instanceof Date ? (e = e.valueOf(), isNaN(e) || (n = this.timestampToMarker(e))) : Array.isArray(e) && (n = ie(e)), n === null || !ic(n) ? null : { marker: n, isTimeUnspecified: !1, forcedTzo: null };
  }
  parse(e) {
    let n = uy(e);
    if (n === null)
      return null;
    let { marker: a } = n, r = null;
    return n.timeZoneOffset !== null && (this.canComputeOffset ? a = this.timestampToMarker(a.valueOf() - n.timeZoneOffset * 60 * 1e3) : r = n.timeZoneOffset), { marker: a, isTimeUnspecified: n.isTimeUnspecified, forcedTzo: r };
  }
  // Accessors
  getYear(e) {
    return this.calendarSystem.getMarkerYear(e);
  }
  getMonth(e) {
    return this.calendarSystem.getMarkerMonth(e);
  }
  getDay(e) {
    return this.calendarSystem.getMarkerDay(e);
  }
  // Adding / Subtracting
  add(e, n) {
    let a = this.calendarSystem.markerToArray(e);
    return a[0] += n.years, a[1] += n.months, a[2] += n.days, a[6] += n.milliseconds, this.calendarSystem.arrayToMarker(a);
  }
  subtract(e, n) {
    let a = this.calendarSystem.markerToArray(e);
    return a[0] -= n.years, a[1] -= n.months, a[2] -= n.days, a[6] -= n.milliseconds, this.calendarSystem.arrayToMarker(a);
  }
  addYears(e, n) {
    let a = this.calendarSystem.markerToArray(e);
    return a[0] += n, this.calendarSystem.arrayToMarker(a);
  }
  addMonths(e, n) {
    let a = this.calendarSystem.markerToArray(e);
    return a[1] += n, this.calendarSystem.arrayToMarker(a);
  }
  // Diffing Whole Units
  diffWholeYears(e, n) {
    let { calendarSystem: a } = this;
    return Te(e) === Te(n) && a.getMarkerDay(e) === a.getMarkerDay(n) && a.getMarkerMonth(e) === a.getMarkerMonth(n) ? a.getMarkerYear(n) - a.getMarkerYear(e) : null;
  }
  diffWholeMonths(e, n) {
    let { calendarSystem: a } = this;
    return Te(e) === Te(n) && a.getMarkerDay(e) === a.getMarkerDay(n) ? a.getMarkerMonth(n) - a.getMarkerMonth(e) + (a.getMarkerYear(n) - a.getMarkerYear(e)) * 12 : null;
  }
  // Range / Duration
  greatestWholeUnit(e, n) {
    let a = this.diffWholeYears(e, n);
    return a !== null ? { unit: "year", value: a } : (a = this.diffWholeMonths(e, n), a !== null ? { unit: "month", value: a } : (a = Iw(e, n), a !== null ? { unit: "week", value: a } : (a = _n(e, n), a !== null ? { unit: "day", value: a } : (a = Dw(e, n), Yr(a) ? { unit: "hour", value: a } : (a = Tw(e, n), Yr(a) ? { unit: "minute", value: a } : (a = Rw(e, n), Yr(a) ? { unit: "second", value: a } : { unit: "millisecond", value: n.valueOf() - e.valueOf() }))))));
  }
  countDurationsBetween(e, n, a) {
    let r;
    return a.years && (r = this.diffWholeYears(e, n), r !== null) ? r / xw(a) : a.months && (r = this.diffWholeMonths(e, n), r !== null) ? r / Ew(a) : a.days && (r = _n(e, n), r !== null) ? r / ut(a) : (n.valueOf() - e.valueOf()) / Vt(a);
  }
  // Start-Of
  // these DON'T return zoned-dates. only UTC start-of dates
  startOf(e, n) {
    return n === "year" ? this.startOfYear(e) : n === "month" ? this.startOfMonth(e) : n === "week" ? this.startOfWeek(e) : n === "day" ? G(e) : n === "hour" ? kw(e) : n === "minute" ? zw(e) : n === "second" ? Vw(e) : null;
  }
  startOfYear(e) {
    return this.calendarSystem.arrayToMarker([
      this.calendarSystem.getMarkerYear(e)
    ]);
  }
  startOfMonth(e) {
    return this.calendarSystem.arrayToMarker([
      this.calendarSystem.getMarkerYear(e),
      this.calendarSystem.getMarkerMonth(e)
    ]);
  }
  startOfWeek(e) {
    return this.calendarSystem.arrayToMarker([
      this.calendarSystem.getMarkerYear(e),
      this.calendarSystem.getMarkerMonth(e),
      e.getUTCDate() - (e.getUTCDay() - this.weekDow + 7) % 7
    ]);
  }
  // Week Number
  computeWeekNumber(e) {
    return this.weekNumberFunc ? this.weekNumberFunc(this.toDate(e)) : Ow(e, this.weekDow, this.weekDoy);
  }
  // TODO: choke on timeZoneName: long
  format(e, n, a = {}) {
    return n.format({
      marker: e,
      timeZoneOffset: a.forcedTzo != null ? a.forcedTzo : this.offsetForMarker(e)
    }, this);
  }
  formatRange(e, n, a, r = {}) {
    return r.isEndExclusive && (n = Ie(n, -1)), a.formatRange({
      marker: e,
      timeZoneOffset: r.forcedStartTzo != null ? r.forcedStartTzo : this.offsetForMarker(e)
    }, {
      marker: n,
      timeZoneOffset: r.forcedEndTzo != null ? r.forcedEndTzo : this.offsetForMarker(n)
    }, this, r.defaultSeparator);
  }
  /*
  DUMB: the omitTime arg is dumb. if we omit the time, we want to omit the timezone offset. and if we do that,
  might as well use buildIsoString or some other util directly
  */
  formatIso(e, n = {}) {
    let a = null;
    return n.omitTimeZoneOffset || (n.forcedTzo != null ? a = n.forcedTzo : a = this.offsetForMarker(e)), Lw(e, a, n.omitTime);
  }
  // TimeZone
  timestampToMarker(e) {
    return this.timeZone === "local" ? ie(ul(new Date(e))) : this.timeZone === "UTC" || !this.namedTimeZoneImpl ? new Date(e) : ie(this.namedTimeZoneImpl.timestampToArray(e));
  }
  offsetForMarker(e) {
    return this.timeZone === "local" ? -ml(De(e)).getTimezoneOffset() : this.timeZone === "UTC" ? 0 : this.namedTimeZoneImpl ? this.namedTimeZoneImpl.offsetForArray(De(e)) : null;
  }
  // Conversion
  toDate(e, n) {
    return this.timeZone === "local" ? ml(De(e)) : this.timeZone === "UTC" ? new Date(e.valueOf()) : this.namedTimeZoneImpl ? new Date(e.valueOf() - this.namedTimeZoneImpl.offsetForArray(De(e)) * 1e3 * 60) : new Date(e.valueOf() - (n || 0));
  }
}
class jt {
  constructor(e) {
    this.iconOverrideOption && this.setIconOverride(e[this.iconOverrideOption]);
  }
  setIconOverride(e) {
    let n, a;
    if (typeof e == "object" && e) {
      n = Object.assign({}, this.iconClasses);
      for (a in e)
        n[a] = this.applyIconOverridePrefix(e[a]);
      this.iconClasses = n;
    } else e === !1 && (this.iconClasses = {});
  }
  applyIconOverridePrefix(e) {
    let n = this.iconOverridePrefix;
    return n && e.indexOf(n) !== 0 && (e = n + e), e;
  }
  getClass(e) {
    return this.classes[e] || "";
  }
  getIconClass(e, n) {
    let a;
    return n && this.rtlIconClasses ? a = this.rtlIconClasses[e] || this.iconClasses[e] : a = this.iconClasses[e], a ? `${this.baseIconClass} ${a}` : "";
  }
  getCustomButtonIconClass(e) {
    let n;
    return this.iconOverrideCustomButtonOption && (n = e[this.iconOverrideCustomButtonOption], n) ? `${this.baseIconClass} ${this.applyIconOverridePrefix(n)}` : "";
  }
}
jt.prototype.classes = {};
jt.prototype.iconClasses = {};
jt.prototype.baseIconClass = "";
jt.prototype.iconOverridePrefix = "";
function Cn(t) {
  t();
  let e = D.debounceRendering, n = [];
  function a(r) {
    n.push(r);
  }
  for (D.debounceRendering = a, zt(C(hy, {}), document.createElement("div")); n.length; )
    n.shift()();
  D.debounceRendering = e;
}
class hy extends ce {
  render() {
    return C("div", {});
  }
  componentDidMount() {
    this.setState({});
  }
}
function cc(t) {
  let e = L7(t), n = e.Provider;
  return e.Provider = function() {
    let a = !this.getChildContext, r = n.apply(this, arguments);
    if (a) {
      let o = [];
      this.shouldComponentUpdate = (i) => {
        this.props.value !== i.value && o.forEach((l) => {
          l.context = i.value, l.forceUpdate();
        });
      }, this.sub = (i) => {
        o.push(i);
        let l = i.componentWillUnmount;
        i.componentWillUnmount = () => {
          o.splice(o.indexOf(i), 1), l && l.call(i);
        };
      };
    }
    return r;
  }, e;
}
class fy {
  constructor(e, n, a, r) {
    this.execFunc = e, this.emitter = n, this.scrollTime = a, this.scrollTimeReset = r, this.handleScrollRequest = (o) => {
      this.queuedRequest = Object.assign({}, this.queuedRequest || {}, o), this.drain();
    }, n.on("_scrollRequest", this.handleScrollRequest), this.fireInitialScroll();
  }
  detach() {
    this.emitter.off("_scrollRequest", this.handleScrollRequest);
  }
  update(e) {
    e && this.scrollTimeReset ? this.fireInitialScroll() : this.drain();
  }
  fireInitialScroll() {
    this.handleScrollRequest({
      time: this.scrollTime
    });
  }
  drain() {
    this.queuedRequest && this.execFunc(this.queuedRequest) && (this.queuedRequest = null);
  }
}
const tt = cc({});
function py(t, e, n, a, r, o, i, l, s, u, d, g, v, p) {
  return {
    dateEnv: r,
    nowManager: o,
    options: n,
    pluginHooks: l,
    emitter: d,
    dispatch: s,
    getCurrentData: u,
    calendarApi: g,
    viewSpec: t,
    viewApi: e,
    dateProfileGenerator: a,
    theme: i,
    isRtl: n.direction === "rtl",
    addResizeHandler(w) {
      d.on("_resize", w);
    },
    removeResizeHandler(w) {
      d.off("_resize", w);
    },
    createScrollResponder(w) {
      return new fy(w, d, L(n.scrollTime), n.scrollTimeReset);
    },
    registerInteractiveComponent: v,
    unregisterInteractiveComponent: p
  };
}
class nt extends ce {
  // debug: boolean
  shouldComponentUpdate(e, n) {
    return !Jr(
      this.props,
      e,
      this.propEquality
      /*, this.debug */
    ) || !Jr(
      this.state,
      n,
      this.stateEquality
      /*, this.debug */
    );
  }
  // HACK for freakin' React StrictMode
  safeSetState(e) {
    Jr(this.state, Object.assign(Object.assign({}, this.state), e), this.stateEquality) || this.setState(e);
  }
}
nt.addPropsEquality = gy;
nt.addStateEquality = vy;
nt.contextType = tt;
nt.prototype.propEquality = {};
nt.prototype.stateEquality = {};
class Y extends nt {
}
Y.contextType = tt;
function gy(t) {
  let e = Object.create(this.prototype.propEquality);
  Object.assign(e, t), this.prototype.propEquality = e;
}
function vy(t) {
  let e = Object.create(this.prototype.stateEquality);
  Object.assign(e, t), this.prototype.stateEquality = e;
}
function we(t, e) {
  typeof t == "function" ? t(e) : t && (t.current = e);
}
class t2 extends Y {
  constructor() {
    super(...arguments), this.id = Je(), this.queuedDomNodes = [], this.currentDomNodes = [], this.handleEl = (e) => {
      const { options: n } = this.context, { generatorName: a } = this.props;
      (!n.customRenderingReplaces || !go(a, n)) && this.updateElRef(e);
    }, this.updateElRef = (e) => {
      this.props.elRef && we(this.props.elRef, e);
    };
  }
  render() {
    const { props: e, context: n } = this, { options: a } = n, { customGenerator: r, defaultGenerator: o, renderProps: i } = e, l = dc(e, [], this.handleEl);
    let s = !1, u, d = [], g;
    if (r != null) {
      const v = typeof r == "function" ? r(i, C) : r;
      if (v === !0)
        s = !0;
      else {
        const p = v && typeof v == "object";
        p && "html" in v ? l.dangerouslySetInnerHTML = { __html: v.html } : p && "domNodes" in v ? d = Array.prototype.slice.call(v.domNodes) : (p ? zs(v) : typeof v != "function") ? u = v : g = v;
      }
    } else
      s = !go(e.generatorName, a);
    return s && o && (u = o(i)), this.queuedDomNodes = d, this.currentGeneratorMeta = g, C(e.elTag, l, u);
  }
  componentDidMount() {
    this.applyQueueudDomNodes(), this.triggerCustomRendering(!0);
  }
  componentDidUpdate() {
    this.applyQueueudDomNodes(), this.triggerCustomRendering(!0);
  }
  componentWillUnmount() {
    this.triggerCustomRendering(!1);
  }
  triggerCustomRendering(e) {
    var n;
    const { props: a, context: r } = this, { handleCustomRendering: o, customRenderingMetaMap: i } = r.options;
    if (o) {
      const l = (n = this.currentGeneratorMeta) !== null && n !== void 0 ? n : i?.[a.generatorName];
      l && o(Object.assign(Object.assign({
        id: this.id,
        isActive: e,
        containerEl: this.base,
        reportNewContainerEl: this.updateElRef,
        // front-end framework tells us about new container els
        generatorMeta: l
      }, a), { elClasses: (a.elClasses || []).filter(_y) }));
    }
  }
  applyQueueudDomNodes() {
    const { queuedDomNodes: e, currentDomNodes: n } = this, a = this.base;
    if (!He(e, n)) {
      n.forEach($o);
      for (let r of e)
        a.appendChild(r);
      this.currentDomNodes = e;
    }
  }
}
t2.addPropsEquality({
  elClasses: He,
  elStyle: pe,
  elAttrs: ay,
  renderProps: pe
});
function go(t, e) {
  var n;
  return !!(e.handleCustomRendering && t && (!((n = e.customRenderingMetaMap) === null || n === void 0) && n[t]));
}
function dc(t, e, n) {
  const a = Object.assign(Object.assign({}, t.elAttrs), { ref: n });
  return (t.elClasses || e) && (a.className = (t.elClasses || []).concat(e || []).concat(a.className || []).filter(Boolean).join(" ")), t.elStyle && (a.style = t.elStyle), a;
}
function _y(t) {
  return !!t;
}
const uc = cc(0);
class xe extends ce {
  constructor() {
    super(...arguments), this.InnerContent = wy.bind(void 0, this), this.handleEl = (e) => {
      this.el = e, this.props.elRef && (we(this.props.elRef, e), e && this.didMountMisfire && this.componentDidMount());
    };
  }
  render() {
    const { props: e } = this, n = yy(e.classNameGenerator, e.renderProps);
    if (e.children) {
      const a = dc(e, n, this.handleEl), r = e.children(this.InnerContent, e.renderProps, a);
      return e.elTag ? C(e.elTag, a, r) : r;
    } else
      return C(t2, Object.assign(Object.assign({}, e), { elRef: this.handleEl, elTag: e.elTag || "div", elClasses: (e.elClasses || []).concat(n), renderId: this.context }));
  }
  componentDidMount() {
    var e, n;
    this.el ? (n = (e = this.props).didMount) === null || n === void 0 || n.call(e, Object.assign(Object.assign({}, this.props.renderProps), { el: this.el })) : this.didMountMisfire = !0;
  }
  componentWillUnmount() {
    var e, n;
    (n = (e = this.props).willUnmount) === null || n === void 0 || n.call(e, Object.assign(Object.assign({}, this.props.renderProps), { el: this.el }));
  }
}
xe.contextType = uc;
function wy(t, e) {
  const n = t.props;
  return C(t2, Object.assign({ renderProps: n.renderProps, generatorName: n.generatorName, customGenerator: n.customGenerator, defaultGenerator: n.defaultGenerator, renderId: t.context }, e));
}
function yy(t, e) {
  const n = typeof t == "function" ? t(e) : t || [];
  return typeof n == "string" ? [n] : n;
}
class _l extends Y {
  render() {
    let { props: e, context: n } = this, { options: a } = n, r = { view: n.viewApi };
    return C(xe, { elRef: e.elRef, elTag: e.elTag || "div", elAttrs: e.elAttrs, elClasses: [
      ...mc(e.viewSpec),
      ...e.elClasses || []
    ], elStyle: e.elStyle, renderProps: r, classNameGenerator: a.viewClassNames, generatorName: void 0, didMount: a.viewDidMount, willUnmount: a.viewWillUnmount }, () => e.children);
  }
}
function mc(t) {
  return [
    `fc-${t.type}-view`,
    "fc-view"
  ];
}
function by(t, e) {
  let n = null, a = null;
  return t.start && (n = e.createMarker(t.start)), t.end && (a = e.createMarker(t.end)), !n && !a || n && a && a < n ? null : { start: n, end: a };
}
function wl(t, e) {
  let n = [], { start: a } = e, r, o;
  for (t.sort(Cy), r = 0; r < t.length; r += 1)
    o = t[r], o.start > a && n.push({ start: a, end: o.start }), o.end > a && (a = o.end);
  return a < e.end && n.push({ start: a, end: e.end }), n;
}
function Cy(t, e) {
  return t.start.valueOf() - e.start.valueOf();
}
function gt(t, e) {
  let { start: n, end: a } = t, r = null;
  return e.start !== null && (n === null ? n = e.start : n = new Date(Math.max(n.valueOf(), e.start.valueOf()))), e.end != null && (a === null ? a = e.end : a = new Date(Math.min(a.valueOf(), e.end.valueOf()))), (n === null || a === null || n < a) && (r = { start: n, end: a }), r;
}
function Ay(t, e) {
  return (t.start === null ? null : t.start.valueOf()) === (e.start === null ? null : e.start.valueOf()) && (t.end === null ? null : t.end.valueOf()) === (e.end === null ? null : e.end.valueOf());
}
function n2(t, e) {
  return (t.end === null || e.start === null || t.end > e.start) && (t.start === null || e.end === null || t.start < e.end);
}
function Nn(t, e) {
  return (t.start === null || e.start !== null && e.start >= t.start) && (t.end === null || e.end !== null && e.end <= t.end);
}
function Re(t, e) {
  return (t.start === null || e >= t.start) && (t.end === null || e < t.end);
}
function xy(t, e) {
  return e.start != null && t < e.start ? e.start : e.end != null && t >= e.end ? new Date(e.end.valueOf() - 1) : t;
}
function hc(t) {
  let e = Math.floor(yt(t.start, t.end)) || 1, n = G(t.start), a = X(n, e);
  return { start: n, end: a };
}
function fc(t, e = L(0)) {
  let n = null, a = null;
  if (t.end) {
    a = G(t.end);
    let r = t.end.valueOf() - a.valueOf();
    r && r >= Vt(e) && (a = X(a, 1));
  }
  return t.start && (n = G(t.start), a && a <= n && (a = X(n, 1))), { start: n, end: a };
}
function st(t, e, n, a) {
  return a === "year" ? L(n.diffWholeYears(t, e), "year") : a === "month" ? L(n.diffWholeMonths(t, e), "month") : Hw(t, e);
}
class pc {
  constructor(e) {
    this.props = e, this.initHiddenDays();
  }
  /* Date Range Computation
  ------------------------------------------------------------------------------------------------------------------*/
  // Builds a structure with info about what the dates/ranges will be for the "prev" view.
  buildPrev(e, n, a) {
    let { dateEnv: r } = this.props, o = r.subtract(
      r.startOf(n, e.currentRangeUnit),
      // important for start-of-month
      e.dateIncrement
    );
    return this.build(o, -1, a);
  }
  // Builds a structure with info about what the dates/ranges will be for the "next" view.
  buildNext(e, n, a) {
    let { dateEnv: r } = this.props, o = r.add(
      r.startOf(n, e.currentRangeUnit),
      // important for start-of-month
      e.dateIncrement
    );
    return this.build(o, 1, a);
  }
  // Builds a structure holding dates/ranges for rendering around the given date.
  // Optional direction param indicates whether the date is being incremented/decremented
  // from its previous value. decremented = -1, incremented = 1 (default).
  build(e, n, a = !0) {
    let { props: r } = this, o, i, l, s, u, d;
    return o = this.buildValidRange(), o = this.trimHiddenDays(o), a && (e = xy(e, o)), i = this.buildCurrentRangeInfo(e, n), l = /^(year|month|week|day)$/.test(i.unit), s = this.buildRenderRange(this.trimHiddenDays(i.range), i.unit, l), s = this.trimHiddenDays(s), u = s, r.showNonCurrentDates || (u = gt(u, i.range)), u = this.adjustActiveRange(u), u = gt(u, o), d = n2(i.range, o), Re(s, e) || (e = s.start), {
      currentDate: e,
      // constraint for where prev/next operations can go and where events can be dragged/resized to.
      // an object with optional start and end properties.
      validRange: o,
      // range the view is formally responsible for.
      // for example, a month view might have 1st-31st, excluding padded dates
      currentRange: i.range,
      // name of largest unit being displayed, like "month" or "week"
      currentRangeUnit: i.unit,
      isRangeAllDay: l,
      // dates that display events and accept drag-n-drop
      // will be `null` if no dates accept events
      activeRange: u,
      // date range with a rendered skeleton
      // includes not-active days that need some sort of DOM
      renderRange: s,
      // Duration object that denotes the first visible time of any given day
      slotMinTime: r.slotMinTime,
      // Duration object that denotes the exclusive visible end time of any given day
      slotMaxTime: r.slotMaxTime,
      isValid: d,
      // how far the current date will move for a prev/next operation
      dateIncrement: this.buildDateIncrement(i.duration)
      // pass a fallback (might be null) ^
    };
  }
  // Builds an object with optional start/end properties.
  // Indicates the minimum/maximum dates to display.
  // not responsible for trimming hidden days.
  buildValidRange() {
    let e = this.props.validRangeInput, n = typeof e == "function" ? e.call(this.props.calendarApi, this.props.dateEnv.toDate(this.props.nowManager.getDateMarker())) : e;
    return this.refineRange(n) || { start: null, end: null };
  }
  // Builds a structure with info about the "current" range, the range that is
  // highlighted as being the current month for example.
  // See build() for a description of `direction`.
  // Guaranteed to have `range` and `unit` properties. `duration` is optional.
  buildCurrentRangeInfo(e, n) {
    let { props: a } = this, r = null, o = null, i = null, l;
    return a.duration ? (r = a.duration, o = a.durationUnit, i = this.buildRangeFromDuration(e, n, r, o)) : (l = this.props.dayCount) ? (o = "day", i = this.buildRangeFromDayCount(e, n, l)) : (i = this.buildCustomVisibleRange(e)) ? o = a.dateEnv.greatestWholeUnit(i.start, i.end).unit : (r = this.getFallbackDuration(), o = po(r).unit, i = this.buildRangeFromDuration(e, n, r, o)), { duration: r, unit: o, range: i };
  }
  getFallbackDuration() {
    return L({ day: 1 });
  }
  // Returns a new activeRange to have time values (un-ambiguate)
  // slotMinTime or slotMaxTime causes the range to expand.
  adjustActiveRange(e) {
    let { dateEnv: n, usesMinMaxTime: a, slotMinTime: r, slotMaxTime: o } = this.props, { start: i, end: l } = e;
    return a && (ut(r) < 0 && (i = G(i), i = n.add(i, r)), ut(o) > 1 && (l = G(l), l = X(l, -1), l = n.add(l, o))), { start: i, end: l };
  }
  // Builds the "current" range when it is specified as an explicit duration.
  // `unit` is the already-computed greatestDurationDenominator unit of duration.
  buildRangeFromDuration(e, n, a, r) {
    let { dateEnv: o, dateAlignment: i } = this.props, l, s, u;
    if (!i) {
      let { dateIncrement: g } = this.props;
      g && Vt(g) < Vt(a) ? i = po(g).unit : i = r;
    }
    ut(a) <= 1 && this.isHiddenDay(l) && (l = this.skipHiddenDays(l, n), l = G(l));
    function d() {
      l = o.startOf(e, i), s = o.add(l, a), u = { start: l, end: s };
    }
    return d(), this.trimHiddenDays(u) || (e = this.skipHiddenDays(e, n), d()), u;
  }
  // Builds the "current" range when a dayCount is specified.
  buildRangeFromDayCount(e, n, a) {
    let { dateEnv: r, dateAlignment: o } = this.props, i = 0, l = e, s;
    o && (l = r.startOf(l, o)), l = G(l), l = this.skipHiddenDays(l, n), s = l;
    do
      s = X(s, 1), this.isHiddenDay(s) || (i += 1);
    while (i < a);
    return { start: l, end: s };
  }
  // Builds a normalized range object for the "visible" range,
  // which is a way to define the currentRange and activeRange at the same time.
  buildCustomVisibleRange(e) {
    let { props: n } = this, a = n.visibleRangeInput, r = typeof a == "function" ? a.call(n.calendarApi, n.dateEnv.toDate(e)) : a, o = this.refineRange(r);
    return o && (o.start == null || o.end == null) ? null : o;
  }
  // Computes the range that will represent the element/cells for *rendering*,
  // but which may have voided days/times.
  // not responsible for trimming hidden days.
  buildRenderRange(e, n, a) {
    return e;
  }
  // Compute the duration value that should be added/substracted to the current date
  // when a prev/next operation happens.
  buildDateIncrement(e) {
    let { dateIncrement: n } = this.props, a;
    return n || ((a = this.props.dateAlignment) ? L(1, a) : e || L({ days: 1 }));
  }
  refineRange(e) {
    if (e) {
      let n = by(e, this.props.dateEnv);
      return n && (n = fc(n)), n;
    }
    return null;
  }
  /* Hidden Days
  ------------------------------------------------------------------------------------------------------------------*/
  // Initializes internal variables related to calculating hidden days-of-week
  initHiddenDays() {
    let e = this.props.hiddenDays || [], n = [], a = 0, r;
    for (this.props.weekends === !1 && e.push(0, 6), r = 0; r < 7; r += 1)
      (n[r] = e.indexOf(r) !== -1) || (a += 1);
    if (!a)
      throw new Error("invalid hiddenDays");
    this.isHiddenDayHash = n;
  }
  // Remove days from the beginning and end of the range that are computed as hidden.
  // If the whole range is trimmed off, returns null
  trimHiddenDays(e) {
    let { start: n, end: a } = e;
    return n && (n = this.skipHiddenDays(n)), a && (a = this.skipHiddenDays(a, -1, !0)), n == null || a == null || n < a ? { start: n, end: a } : null;
  }
  // Is the current day hidden?
  // `day` is a day-of-week index (0-6), or a Date (used for UTC)
  isHiddenDay(e) {
    return e instanceof Date && (e = e.getUTCDay()), this.isHiddenDayHash[e];
  }
  // Incrementing the current day until it is no longer a hidden day, returning a copy.
  // DOES NOT CONSIDER validRange!
  // If the initial value of `date` is not a hidden day, don't do anything.
  // Pass `isExclusive` as `true` if you are dealing with an end date.
  // `inc` defaults to `1` (increment one day forward each time)
  skipHiddenDays(e, n = 1, a = !1) {
    for (; this.isHiddenDayHash[(e.getUTCDay() + (a ? n : 0) + 7) % 7]; )
      e = X(e, n);
    return e;
  }
}
function a2(t, e, n, a) {
  return {
    instanceId: Je(),
    defId: t,
    range: e,
    forcedStartTzo: n ?? null,
    forcedEndTzo: a ?? null
  };
}
function Ey(t, e, n, a) {
  for (let r = 0; r < a.length; r += 1) {
    let o = a[r].parse(t, n);
    if (o) {
      let { allDay: i } = t;
      return i == null && (i = e, i == null && (i = o.allDayGuess, i == null && (i = !1))), {
        allDay: i,
        duration: o.duration,
        typeData: o.typeData,
        typeId: r
      };
    }
  }
  return null;
}
function $e(t, e, n) {
  let { dateEnv: a, pluginHooks: r, options: o } = n, { defs: i, instances: l } = t;
  l = Ge(l, (s) => !i[s.defId].recurringDef);
  for (let s in i) {
    let u = i[s];
    if (u.recurringDef) {
      let { duration: d } = u.recurringDef;
      d || (d = u.allDay ? o.defaultAllDayEventDuration : o.defaultTimedEventDuration);
      let g = Sy(u, d, e, a, r.recurringTypes);
      for (let v of g) {
        let p = a2(s, {
          start: v,
          end: a.add(v, d)
        });
        l[p.instanceId] = p;
      }
    }
  }
  return { defs: i, instances: l };
}
function Sy(t, e, n, a, r) {
  let i = r[t.recurringDef.typeId].expand(t.recurringDef.typeData, {
    start: a.subtract(n.start, e),
    end: n.end
  }, a);
  return t.allDay && (i = i.map(G)), i;
}
const cn = {
  id: String,
  groupId: String,
  title: String,
  url: String,
  interactive: Boolean
}, gc = {
  start: b,
  end: b,
  date: b,
  allDay: Boolean
}, My = Object.assign(Object.assign(Object.assign({}, cn), gc), { extendedProps: b });
function vc(t, e, n, a, r = r2(n), o, i) {
  let { refined: l, extra: s } = _c(t, n, r), u = Ty(e, n), d = Ey(l, u, n.dateEnv, n.pluginHooks.recurringTypes);
  if (d) {
    let v = vo(l, s, e ? e.sourceId : "", d.allDay, !!d.duration, n, o);
    return v.recurringDef = {
      typeId: d.typeId,
      typeData: d.typeData,
      duration: d.duration
    }, { def: v, instance: null };
  }
  let g = Dy(l, u, n, a);
  if (g) {
    let v = vo(l, s, e ? e.sourceId : "", g.allDay, g.hasEnd, n, o), p = a2(v.defId, g.range, g.forcedStartTzo, g.forcedEndTzo);
    return i && v.publicId && i[v.publicId] && (p.instanceId = i[v.publicId]), { def: v, instance: p };
  }
  return null;
}
function _c(t, e, n = r2(e)) {
  return Xo(t, n);
}
function r2(t) {
  return Object.assign(Object.assign(Object.assign({}, An), My), t.pluginHooks.eventRefiners);
}
function vo(t, e, n, a, r, o, i) {
  let l = {
    title: t.title || "",
    groupId: t.groupId || "",
    publicId: t.id || "",
    url: t.url || "",
    recurringDef: null,
    defId: (i && t.id ? i[t.id] : "") || Je(),
    sourceId: n,
    allDay: a,
    hasEnd: r,
    interactive: t.interactive,
    ui: xn(t, o),
    extendedProps: Object.assign(Object.assign({}, t.extendedProps || {}), e)
  };
  for (let s of o.pluginHooks.eventDefMemberAdders)
    Object.assign(l, s(t));
  return Object.freeze(l.ui.classNames), Object.freeze(l.extendedProps), l;
}
function Dy(t, e, n, a) {
  let { allDay: r } = t, o, i = null, l = !1, s, u = null, d = t.start != null ? t.start : t.date;
  if (o = n.dateEnv.createMarkerMeta(d), o)
    i = o.marker;
  else if (!a)
    return null;
  return t.end != null && (s = n.dateEnv.createMarkerMeta(t.end)), r == null && (e != null ? r = e : r = (!o || o.isTimeUnspecified) && (!s || s.isTimeUnspecified)), r && i && (i = G(i)), s && (u = s.marker, r && (u = G(u)), i && u <= i && (u = null)), u ? l = !0 : a || (l = n.options.forceEventDuration || !1, u = n.dateEnv.add(i, r ? n.options.defaultAllDayEventDuration : n.options.defaultTimedEventDuration)), {
    allDay: r,
    hasEnd: l,
    range: { start: i, end: u },
    forcedStartTzo: o ? o.forcedTzo : null,
    forcedEndTzo: s ? s.forcedTzo : null
  };
}
function Ty(t, e) {
  let n = null;
  return t && (n = t.defaultAllDay), n == null && (n = e.options.defaultAllDay), n;
}
function Ot(t, e, n, a, r, o) {
  let i = fe(), l = r2(n);
  for (let s of t) {
    let u = vc(s, e, n, a, l, r, o);
    u && _o(u, i);
  }
  return i;
}
function _o(t, e = fe()) {
  return e.defs[t.def.defId] = t.def, t.instance && (e.instances[t.instance.instanceId] = t.instance), e;
}
function o2(t, e) {
  let n = t.instances[e];
  if (n) {
    let a = t.defs[n.defId], r = Pn(t, (o) => Ry(a, o));
    return r.defs[a.defId] = a, r.instances[n.instanceId] = n, r;
  }
  return fe();
}
function Ry(t, e) {
  return !!(t.groupId && t.groupId === e.groupId);
}
function fe() {
  return { defs: {}, instances: {} };
}
function i2(t, e) {
  return {
    defs: Object.assign(Object.assign({}, t.defs), e.defs),
    instances: Object.assign(Object.assign({}, t.instances), e.instances)
  };
}
function Pn(t, e) {
  let n = Ge(t.defs, e), a = Ge(t.instances, (r) => n[r.defId]);
  return { defs: n, instances: a };
}
function Hy(t, e) {
  let { defs: n, instances: a } = t, r = {}, o = {};
  for (let i in n)
    e.defs[i] || (r[i] = n[i]);
  for (let i in a)
    !e.instances[i] && // not explicitly excluded
    r[a[i].defId] && (o[i] = a[i]);
  return {
    defs: r,
    instances: o
  };
}
function Iy(t, e) {
  return Array.isArray(t) ? Ot(t, null, e, !0) : typeof t == "object" && t ? Ot([t], null, e, !0) : t != null ? String(t) : null;
}
function yl(t) {
  return Array.isArray(t) ? t : typeof t == "string" ? t.split(/\s+/) : [];
}
const An = {
  display: String,
  editable: Boolean,
  startEditable: Boolean,
  durationEditable: Boolean,
  constraint: b,
  overlap: b,
  allow: b,
  className: yl,
  classNames: yl,
  color: String,
  backgroundColor: String,
  borderColor: String,
  textColor: String
}, ky = {
  display: null,
  startEditable: null,
  durationEditable: null,
  constraints: [],
  overlap: null,
  allows: [],
  backgroundColor: "",
  borderColor: "",
  textColor: "",
  classNames: []
};
function xn(t, e) {
  let n = Iy(t.constraint, e);
  return {
    display: t.display || null,
    startEditable: t.startEditable != null ? t.startEditable : t.editable,
    durationEditable: t.durationEditable != null ? t.durationEditable : t.editable,
    constraints: n != null ? [n] : [],
    overlap: t.overlap != null ? t.overlap : null,
    allows: t.allow != null ? [t.allow] : [],
    backgroundColor: t.backgroundColor || t.color || "",
    borderColor: t.borderColor || t.color || "",
    textColor: t.textColor || "",
    classNames: (t.className || []).concat(t.classNames || [])
    // join singular and plural
  };
}
function zy(t) {
  return t.reduce(Vy, ky);
}
function Vy(t, e) {
  return {
    display: e.display != null ? e.display : t.display,
    startEditable: e.startEditable != null ? e.startEditable : t.startEditable,
    durationEditable: e.durationEditable != null ? e.durationEditable : t.durationEditable,
    constraints: t.constraints.concat(e.constraints),
    overlap: typeof e.overlap == "boolean" ? e.overlap : t.overlap,
    allows: t.allows.concat(e.allows),
    backgroundColor: e.backgroundColor || t.backgroundColor,
    borderColor: e.borderColor || t.borderColor,
    textColor: e.textColor || t.textColor,
    classNames: t.classNames.concat(e.classNames)
  };
}
const Oy = {
  id: String,
  defaultAllDay: Boolean,
  url: String,
  format: String,
  events: b,
  eventDataTransform: b,
  // for any network-related sources
  success: b,
  failure: b
};
function wc(t, e, n = yc(e)) {
  let a;
  if (typeof t == "string" ? a = { url: t } : typeof t == "function" || Array.isArray(t) ? a = { events: t } : typeof t == "object" && t && (a = t), a) {
    let { refined: r, extra: o } = Xo(a, n), i = By(r, e);
    if (i)
      return {
        _raw: t,
        isFetching: !1,
        latestFetchId: "",
        fetchRange: null,
        defaultAllDay: r.defaultAllDay,
        eventDataTransform: r.eventDataTransform,
        success: r.success,
        failure: r.failure,
        publicId: r.id || "",
        sourceId: Je(),
        sourceDefId: i.sourceDefId,
        meta: i.meta,
        ui: xn(r, e),
        extendedProps: o
      };
  }
  return null;
}
function yc(t) {
  return Object.assign(Object.assign(Object.assign({}, An), Oy), t.pluginHooks.eventSourceRefiners);
}
function By(t, e) {
  let n = e.pluginHooks.eventSourceDefs;
  for (let a = n.length - 1; a >= 0; a -= 1) {
    let o = n[a].parseMeta(t);
    if (o)
      return { sourceDefId: a, meta: o };
  }
  return null;
}
function Ly(t, e, n, a, r) {
  switch (e.type) {
    case "RECEIVE_EVENTS":
      return Ny(t, n[e.sourceId], e.fetchId, e.fetchRange, e.rawEvents, r);
    case "RESET_RAW_EVENTS":
      return Py(t, n[e.sourceId], e.rawEvents, a.activeRange, r);
    case "ADD_EVENTS":
      return jy(
        t,
        e.eventStore,
        // new ones
        a ? a.activeRange : null,
        r
      );
    case "RESET_EVENTS":
      return e.eventStore;
    case "MERGE_EVENTS":
      return i2(t, e.eventStore);
    case "PREV":
    // TODO: how do we track all actions that affect dateProfile :(
    case "NEXT":
    case "CHANGE_DATE":
    case "CHANGE_VIEW_TYPE":
      return a ? $e(t, a.activeRange, r) : t;
    case "REMOVE_EVENTS":
      return Hy(t, e.eventStore);
    case "REMOVE_EVENT_SOURCE":
      return Cc(t, e.sourceId);
    case "REMOVE_ALL_EVENT_SOURCES":
      return Pn(t, (o) => !o.sourceId);
    case "REMOVE_ALL_EVENTS":
      return fe();
    default:
      return t;
  }
}
function Ny(t, e, n, a, r, o) {
  if (e && // not already removed
  n === e.latestFetchId) {
    let i = Ot(bc(r, e, o), e, o);
    return a && (i = $e(i, a, o)), i2(Cc(t, e.sourceId), i);
  }
  return t;
}
function Py(t, e, n, a, r) {
  const { defIdMap: o, instanceIdMap: i } = Fy(t);
  let l = Ot(bc(n, e, r), e, r, !1, o, i);
  return $e(l, a, r);
}
function bc(t, e, n) {
  let a = n.options.eventDataTransform, r = e ? e.eventDataTransform : null;
  return r && (t = bl(t, r)), a && (t = bl(t, a)), t;
}
function bl(t, e) {
  let n;
  if (!e)
    n = t;
  else {
    n = [];
    for (let a of t) {
      let r = e(a);
      r ? n.push(r) : r == null && n.push(a);
    }
  }
  return n;
}
function jy(t, e, n, a) {
  return n && (e = $e(e, n, a)), i2(t, e);
}
function Cl(t, e, n) {
  let { defs: a } = t, r = et(t.instances, (o) => a[o.defId].allDay ? o : Object.assign(Object.assign({}, o), { range: {
    start: n.createMarker(e.toDate(o.range.start, o.forcedStartTzo)),
    end: n.createMarker(e.toDate(o.range.end, o.forcedEndTzo))
  }, forcedStartTzo: n.canComputeOffset ? null : o.forcedStartTzo, forcedEndTzo: n.canComputeOffset ? null : o.forcedEndTzo }));
  return { defs: a, instances: r };
}
function Cc(t, e) {
  return Pn(t, (n) => n.sourceId !== e);
}
function qy(t, e) {
  return {
    defs: t.defs,
    instances: Ge(t.instances, (n) => !e[n.instanceId])
  };
}
function Fy(t) {
  const { defs: e, instances: n } = t, a = {}, r = {};
  for (let o in e) {
    const i = e[o], { publicId: l } = i;
    l && (a[l] = o);
  }
  for (let o in n) {
    const i = n[o], l = e[i.defId], { publicId: s } = l;
    s && (r[s] = o);
  }
  return { defIdMap: a, instanceIdMap: r };
}
class jn {
  constructor() {
    this.handlers = {}, this.thisContext = null;
  }
  setThisContext(e) {
    this.thisContext = e;
  }
  setOptions(e) {
    this.options = e;
  }
  on(e, n) {
    Uy(this.handlers, e, n);
  }
  off(e, n) {
    Wy(this.handlers, e, n);
  }
  trigger(e, ...n) {
    let a = this.handlers[e] || [], r = this.options && this.options[e], o = [].concat(r || [], a);
    for (let i of o)
      i.apply(this.thisContext, n);
  }
  hasHandlers(e) {
    return !!(this.handlers[e] && this.handlers[e].length || this.options && this.options[e]);
  }
}
function Uy(t, e, n) {
  (t[e] || (t[e] = [])).push(n);
}
function Wy(t, e, n) {
  n ? t[e] && (t[e] = t[e].filter((a) => a !== n)) : delete t[e];
}
const Gy = {
  startTime: "09:00",
  endTime: "17:00",
  daysOfWeek: [1, 2, 3, 4, 5],
  display: "inverse-background",
  classNames: "fc-non-business",
  groupId: "_businessHours"
  // so multiple defs get grouped
};
function $y(t, e) {
  return Ot(Qy(t), null, e);
}
function Qy(t) {
  let e;
  return t === !0 ? e = [{}] : Array.isArray(t) ? e = t.filter((n) => n.daysOfWeek) : typeof t == "object" && t ? e = [t] : e = [], e = e.map((n) => Object.assign(Object.assign({}, Gy), n)), e;
}
function Ac(t, e, n) {
  n.emitter.trigger("select", Object.assign(Object.assign({}, l2(t, n)), { jsEvent: e ? e.origEvent : null, view: n.viewApi || n.calendarApi.view }));
}
function Yy(t, e) {
  e.emitter.trigger("unselect", {
    jsEvent: t ? t.origEvent : null,
    view: e.viewApi || e.calendarApi.view
  });
}
function l2(t, e) {
  let n = {};
  for (let a of e.pluginHooks.dateSpanTransforms)
    Object.assign(n, a(t, e));
  return Object.assign(n, db(t, e.dateEnv)), n;
}
function Al(t, e, n) {
  let { dateEnv: a, options: r } = n, o = e;
  return t ? (o = G(o), o = a.add(o, r.defaultAllDayEventDuration)) : o = a.add(o, r.defaultTimedEventDuration), o;
}
function s2(t, e, n, a) {
  let r = En(t.defs, e), o = fe();
  for (let i in t.defs) {
    let l = t.defs[i];
    o.defs[i] = Zy(l, r[i], n, a);
  }
  for (let i in t.instances) {
    let l = t.instances[i], s = o.defs[l.defId];
    o.instances[i] = Ky(l, s, r[l.defId], n, a);
  }
  return o;
}
function Zy(t, e, n, a) {
  let r = n.standardProps || {};
  r.hasEnd == null && e.durationEditable && (n.startDelta || n.endDelta) && (r.hasEnd = !0);
  let o = Object.assign(Object.assign(Object.assign({}, t), r), { ui: Object.assign(Object.assign({}, t.ui), r.ui) });
  n.extendedProps && (o.extendedProps = Object.assign(Object.assign({}, o.extendedProps), n.extendedProps));
  for (let i of a.pluginHooks.eventDefMutationAppliers)
    i(o, n, a);
  return !o.hasEnd && a.options.forceEventDuration && (o.hasEnd = !0), o;
}
function Ky(t, e, n, a, r) {
  let { dateEnv: o } = r, i = a.standardProps && a.standardProps.allDay === !0, l = a.standardProps && a.standardProps.hasEnd === !1, s = Object.assign({}, t);
  return i && (s.range = hc(s.range)), a.datesDelta && n.startEditable && (s.range = {
    start: o.add(s.range.start, a.datesDelta),
    end: o.add(s.range.end, a.datesDelta)
  }), a.startDelta && n.durationEditable && (s.range = {
    start: o.add(s.range.start, a.startDelta),
    end: s.range.end
  }), a.endDelta && n.durationEditable && (s.range = {
    start: s.range.start,
    end: o.add(s.range.end, a.endDelta)
  }), l && (s.range = {
    start: s.range.start,
    end: Al(e.allDay, s.range.start, r)
  }), e.allDay && (s.range = {
    start: G(s.range.start),
    end: G(s.range.end)
  }), s.range.end < s.range.start && (s.range.end = Al(e.allDay, s.range.start, r)), s;
}
class lt {
  constructor(e, n) {
    this.context = e, this.internalEventSource = n;
  }
  remove() {
    this.context.dispatch({
      type: "REMOVE_EVENT_SOURCE",
      sourceId: this.internalEventSource.sourceId
    });
  }
  refetch() {
    this.context.dispatch({
      type: "FETCH_EVENT_SOURCES",
      sourceIds: [this.internalEventSource.sourceId],
      isRefetch: !0
    });
  }
  get id() {
    return this.internalEventSource.publicId;
  }
  get url() {
    return this.internalEventSource.meta.url;
  }
  get format() {
    return this.internalEventSource.meta.format;
  }
}
class $ {
  // instance will be null if expressing a recurring event that has no current instances,
  // OR if trying to validate an incoming external event that has no dates assigned
  constructor(e, n, a) {
    this._context = e, this._def = n, this._instance = a || null;
  }
  /*
  TODO: make event struct more responsible for this
  */
  setProp(e, n) {
    if (e in gc)
      console.warn("Could not set date-related prop 'name'. Use one of the date-related methods instead.");
    else if (e === "id")
      n = cn[e](n), this.mutate({
        standardProps: { publicId: n }
        // hardcoded internal name
      });
    else if (e in cn)
      n = cn[e](n), this.mutate({
        standardProps: { [e]: n }
      });
    else if (e in An) {
      let a = An[e](n);
      e === "color" ? a = { backgroundColor: n, borderColor: n } : e === "editable" ? a = { startEditable: n, durationEditable: n } : a = { [e]: n }, this.mutate({
        standardProps: { ui: a }
      });
    } else
      console.warn(`Could not set prop '${e}'. Use setExtendedProp instead.`);
  }
  setExtendedProp(e, n) {
    this.mutate({
      extendedProps: { [e]: n }
    });
  }
  setStart(e, n = {}) {
    let { dateEnv: a } = this._context, r = a.createMarker(e);
    if (r && this._instance) {
      let o = this._instance.range, i = st(o.start, r, a, n.granularity);
      n.maintainDuration ? this.mutate({ datesDelta: i }) : this.mutate({ startDelta: i });
    }
  }
  setEnd(e, n = {}) {
    let { dateEnv: a } = this._context, r;
    if (!(e != null && (r = a.createMarker(e), !r)) && this._instance)
      if (r) {
        let o = st(this._instance.range.end, r, a, n.granularity);
        this.mutate({ endDelta: o });
      } else
        this.mutate({ standardProps: { hasEnd: !1 } });
  }
  setDates(e, n, a = {}) {
    let { dateEnv: r } = this._context, o = { allDay: a.allDay }, i = r.createMarker(e), l;
    if (i && !(n != null && (l = r.createMarker(n), !l)) && this._instance) {
      let s = this._instance.range;
      a.allDay === !0 && (s = hc(s));
      let u = st(s.start, i, r, a.granularity);
      if (l) {
        let d = st(s.end, l, r, a.granularity);
        Cw(u, d) ? this.mutate({ datesDelta: u, standardProps: o }) : this.mutate({ startDelta: u, endDelta: d, standardProps: o });
      } else
        o.hasEnd = !1, this.mutate({ datesDelta: u, standardProps: o });
    }
  }
  moveStart(e) {
    let n = L(e);
    n && this.mutate({ startDelta: n });
  }
  moveEnd(e) {
    let n = L(e);
    n && this.mutate({ endDelta: n });
  }
  moveDates(e) {
    let n = L(e);
    n && this.mutate({ datesDelta: n });
  }
  setAllDay(e, n = {}) {
    let a = { allDay: e }, { maintainDuration: r } = n;
    r == null && (r = this._context.options.allDayMaintainDuration), this._def.allDay !== e && (a.hasEnd = r), this.mutate({ standardProps: a });
  }
  formatRange(e) {
    let { dateEnv: n } = this._context, a = this._instance, r = K(e);
    return this._def.hasEnd ? n.formatRange(a.range.start, a.range.end, r, {
      forcedStartTzo: a.forcedStartTzo,
      forcedEndTzo: a.forcedEndTzo
    }) : n.format(a.range.start, r, {
      forcedTzo: a.forcedStartTzo
    });
  }
  mutate(e) {
    let n = this._instance;
    if (n) {
      let a = this._def, r = this._context, { eventStore: o } = r.getCurrentData(), i = o2(o, n.instanceId);
      i = s2(i, {
        "": {
          display: "",
          startEditable: !0,
          durationEditable: !0,
          constraints: [],
          overlap: null,
          allows: [],
          backgroundColor: "",
          borderColor: "",
          textColor: "",
          classNames: []
        }
      }, e, r);
      let s = new $(r, a, n);
      this._def = i.defs[a.defId], this._instance = i.instances[n.instanceId], r.dispatch({
        type: "MERGE_EVENTS",
        eventStore: i
      }), r.emitter.trigger("eventChange", {
        oldEvent: s,
        event: this,
        relatedEvents: qe(i, r, n),
        revert() {
          r.dispatch({
            type: "RESET_EVENTS",
            eventStore: o
            // the ORIGINAL store
          });
        }
      });
    }
  }
  remove() {
    let e = this._context, n = xc(this);
    e.dispatch({
      type: "REMOVE_EVENTS",
      eventStore: n
    }), e.emitter.trigger("eventRemove", {
      event: this,
      relatedEvents: [],
      revert() {
        e.dispatch({
          type: "MERGE_EVENTS",
          eventStore: n
        });
      }
    });
  }
  get source() {
    let { sourceId: e } = this._def;
    return e ? new lt(this._context, this._context.getCurrentData().eventSources[e]) : null;
  }
  get start() {
    return this._instance ? this._context.dateEnv.toDate(this._instance.range.start) : null;
  }
  get end() {
    return this._instance && this._def.hasEnd ? this._context.dateEnv.toDate(this._instance.range.end) : null;
  }
  get startStr() {
    let e = this._instance;
    return e ? this._context.dateEnv.formatIso(e.range.start, {
      omitTime: this._def.allDay,
      forcedTzo: e.forcedStartTzo
    }) : "";
  }
  get endStr() {
    let e = this._instance;
    return e && this._def.hasEnd ? this._context.dateEnv.formatIso(e.range.end, {
      omitTime: this._def.allDay,
      forcedTzo: e.forcedEndTzo
    }) : "";
  }
  // computable props that all access the def
  // TODO: find a TypeScript-compatible way to do this at scale
  get id() {
    return this._def.publicId;
  }
  get groupId() {
    return this._def.groupId;
  }
  get allDay() {
    return this._def.allDay;
  }
  get title() {
    return this._def.title;
  }
  get url() {
    return this._def.url;
  }
  get display() {
    return this._def.ui.display || "auto";
  }
  // bad. just normalize the type earlier
  get startEditable() {
    return this._def.ui.startEditable;
  }
  get durationEditable() {
    return this._def.ui.durationEditable;
  }
  get constraint() {
    return this._def.ui.constraints[0] || null;
  }
  get overlap() {
    return this._def.ui.overlap;
  }
  get allow() {
    return this._def.ui.allows[0] || null;
  }
  get backgroundColor() {
    return this._def.ui.backgroundColor;
  }
  get borderColor() {
    return this._def.ui.borderColor;
  }
  get textColor() {
    return this._def.ui.textColor;
  }
  // NOTE: user can't modify these because Object.freeze was called in event-def parsing
  get classNames() {
    return this._def.ui.classNames;
  }
  get extendedProps() {
    return this._def.extendedProps;
  }
  toPlainObject(e = {}) {
    let n = this._def, { ui: a } = n, { startStr: r, endStr: o } = this, i = {
      allDay: n.allDay
    };
    return n.title && (i.title = n.title), r && (i.start = r), o && (i.end = o), n.publicId && (i.id = n.publicId), n.groupId && (i.groupId = n.groupId), n.url && (i.url = n.url), a.display && a.display !== "auto" && (i.display = a.display), e.collapseColor && a.backgroundColor && a.backgroundColor === a.borderColor ? i.color = a.backgroundColor : (a.backgroundColor && (i.backgroundColor = a.backgroundColor), a.borderColor && (i.borderColor = a.borderColor)), a.textColor && (i.textColor = a.textColor), a.classNames.length && (i.classNames = a.classNames), Object.keys(n.extendedProps).length && (e.collapseExtendedProps ? Object.assign(i, n.extendedProps) : i.extendedProps = n.extendedProps), i;
  }
  toJSON() {
    return this.toPlainObject();
  }
}
function xc(t) {
  let e = t._def, n = t._instance;
  return {
    defs: { [e.defId]: e },
    instances: n ? { [n.instanceId]: n } : {}
  };
}
function qe(t, e, n) {
  let { defs: a, instances: r } = t, o = [], i = n ? n.instanceId : "";
  for (let l in r) {
    let s = r[l], u = a[s.defId];
    s.instanceId !== i && o.push(new $(e, u, s));
  }
  return o;
}
function xl(t, e, n, a) {
  let r = {}, o = {}, i = {}, l = [], s = [], u = En(t.defs, e);
  for (let d in t.defs) {
    let g = t.defs[d];
    u[g.defId].display === "inverse-background" && (g.groupId ? (r[g.groupId] = [], i[g.groupId] || (i[g.groupId] = g)) : o[d] = []);
  }
  for (let d in t.instances) {
    let g = t.instances[d], v = t.defs[g.defId], p = u[v.defId], w = g.range, _ = !v.allDay && a ? fc(w, a) : w, y = gt(_, n);
    y && (p.display === "inverse-background" ? v.groupId ? r[v.groupId].push(y) : o[g.defId].push(y) : p.display !== "none" && (p.display === "background" ? l : s).push({
      def: v,
      ui: p,
      instance: g,
      range: y,
      isStart: _.start && _.start.valueOf() === y.start.valueOf(),
      isEnd: _.end && _.end.valueOf() === y.end.valueOf()
    }));
  }
  for (let d in r) {
    let g = r[d], v = wl(g, n);
    for (let p of v) {
      let w = i[d], _ = u[w.defId];
      l.push({
        def: w,
        ui: _,
        instance: null,
        range: p,
        isStart: !1,
        isEnd: !1
      });
    }
  }
  for (let d in o) {
    let g = o[d], v = wl(g, n);
    for (let p of v)
      l.push({
        def: t.defs[d],
        ui: u[d],
        instance: null,
        range: p,
        isStart: !1,
        isEnd: !1
      });
  }
  return { bg: l, fg: s };
}
function El(t, e) {
  t.fcSeg = e;
}
function vt(t) {
  return t.fcSeg || t.parentNode.fcSeg || // for the harness
  null;
}
function En(t, e) {
  return et(t, (n) => Ec(n, e));
}
function Ec(t, e) {
  let n = [];
  return e[""] && n.push(e[""]), e[t.defId] && n.push(e[t.defId]), n.push(t.ui), zy(n);
}
function Xy(t, e) {
  let n = t.map(Jy);
  return n.sort((a, r) => pw(a, r, e)), n.map((a) => a._seg);
}
function Jy(t) {
  let { eventRange: e } = t, n = e.def, a = e.instance ? e.instance.range : e.range, r = a.start ? a.start.valueOf() : 0, o = a.end ? a.end.valueOf() : 0;
  return Object.assign(Object.assign(Object.assign({}, n.extendedProps), n), {
    id: n.publicId,
    start: r,
    end: o,
    duration: o - r,
    allDay: Number(n.allDay),
    _seg: t
  });
}
function eb(t, e) {
  let { pluginHooks: n } = e, a = n.isDraggableTransformers, { def: r, ui: o } = t.eventRange, i = o.startEditable;
  for (let l of a)
    i = l(i, r, o, e);
  return i;
}
function tb(t, e) {
  return t.isStart && t.eventRange.ui.durationEditable && e.options.eventResizableFromStart;
}
function nb(t, e) {
  return t.isEnd && t.eventRange.ui.durationEditable;
}
function Sc(t, e, n, a, r, o, i) {
  let { dateEnv: l, options: s } = n, { displayEventTime: u, displayEventEnd: d } = s, g = t.eventRange.def, v = t.eventRange.instance;
  u == null && (u = a !== !1), d == null && (d = r !== !1);
  let p = v.range.start, w = v.range.end, _ = t.start || t.eventRange.range.start, y = t.end || t.eventRange.range.end, A = G(p).valueOf() === G(_).valueOf(), E = G(Ie(w, -1)).valueOf() === G(Ie(y, -1)).valueOf();
  return u && !g.allDay && (A || E) ? (_ = A ? p : _, y = E ? w : y, d && g.hasEnd ? l.formatRange(_, y, e, {
    forcedStartTzo: v.forcedStartTzo,
    forcedEndTzo: v.forcedEndTzo
  }) : l.format(_, e, {
    forcedTzo: v.forcedStartTzo
    // nooooo, same
  })) : "";
}
function Rt(t, e, n) {
  let a = t.eventRange.range;
  return {
    isPast: a.end <= e.start,
    isFuture: a.start >= e.end,
    isToday: e && Re(e, a.start)
  };
}
function ab(t) {
  let e = ["fc-event"];
  return t.isMirror && e.push("fc-event-mirror"), t.isDraggable && e.push("fc-event-draggable"), (t.isStartResizable || t.isEndResizable) && e.push("fc-event-resizable"), t.isDragging && e.push("fc-event-dragging"), t.isResizing && e.push("fc-event-resizing"), t.isSelected && e.push("fc-event-selected"), t.isStart && e.push("fc-event-start"), t.isEnd && e.push("fc-event-end"), t.isPast && e.push("fc-event-past"), t.isToday && e.push("fc-event-today"), t.isFuture && e.push("fc-event-future"), e;
}
function rb(t) {
  return t.instance ? t.instance.instanceId : `${t.def.defId}:${t.range.start.toISOString()}`;
}
function Mc(t, e) {
  let { def: n, instance: a } = t.eventRange, { url: r } = n;
  if (r)
    return { href: r };
  let { emitter: o, options: i } = e, { eventInteractive: l } = i;
  return l == null && (l = n.interactive, l == null && (l = !!o.hasHandlers("eventClick"))), l ? oc((s) => {
    o.trigger("eventClick", {
      el: s.target,
      event: new $(e, n, a),
      jsEvent: s,
      view: e.viewApi
    });
  }) : {};
}
const ob = {
  start: b,
  end: b,
  allDay: Boolean
};
function ib(t, e, n) {
  let a = lb(t, e), { range: r } = a;
  if (!r.start)
    return null;
  if (!r.end) {
    if (n == null)
      return null;
    r.end = e.add(r.start, n);
  }
  return a;
}
function lb(t, e) {
  let { refined: n, extra: a } = Xo(t, ob), r = n.start ? e.createMarkerMeta(n.start) : null, o = n.end ? e.createMarkerMeta(n.end) : null, { allDay: i } = n;
  return i == null && (i = r && r.isTimeUnspecified && (!o || o.isTimeUnspecified)), Object.assign({ range: {
    start: r ? r.marker : null,
    end: o ? o.marker : null
  }, allDay: i }, a);
}
function sb(t, e) {
  return Ay(t.range, e.range) && t.allDay === e.allDay && cb(t, e);
}
function cb(t, e) {
  for (let n in e)
    if (n !== "range" && n !== "allDay" && t[n] !== e[n])
      return !1;
  for (let n in t)
    if (!(n in e))
      return !1;
  return !0;
}
function db(t, e) {
  return Object.assign(Object.assign({}, Tc(t.range, e, t.allDay)), { allDay: t.allDay });
}
function Dc(t, e, n) {
  return Object.assign(Object.assign({}, Tc(t, e, n)), { timeZone: e.timeZone });
}
function Tc(t, e, n) {
  return {
    start: e.toDate(t.start),
    end: e.toDate(t.end),
    startStr: e.formatIso(t.start, { omitTime: n }),
    endStr: e.formatIso(t.end, { omitTime: n })
  };
}
function ub(t, e, n) {
  let a = _c({ editable: !1 }, n), r = vo(
    a.refined,
    a.extra,
    "",
    // sourceId
    t.allDay,
    !0,
    // hasEnd
    n
  );
  return {
    def: r,
    ui: Ec(r, e),
    instance: a2(r.defId, t.range),
    range: t.range,
    isStart: !0,
    isEnd: !0
  };
}
function mb(t, e, n) {
  let a = !1, r = function(l) {
    a || (a = !0, e(l));
  }, o = function(l) {
    a || (a = !0, n(l));
  }, i = t(r, o);
  i && typeof i.then == "function" && i.then(r, o);
}
class Sl extends Error {
  constructor(e, n) {
    super(e), this.response = n;
  }
}
function hb(t, e, n) {
  t = t.toUpperCase();
  const a = {
    method: t
  };
  return t === "GET" ? e += (e.indexOf("?") === -1 ? "?" : "&") + new URLSearchParams(n) : (a.body = new URLSearchParams(n), a.headers = {
    "Content-Type": "application/x-www-form-urlencoded"
  }), fetch(e, a).then((r) => {
    if (r.ok)
      return r.json().then((o) => [o, r], () => {
        throw new Sl("Failure parsing JSON", r);
      });
    throw new Sl("Request failed", r);
  });
}
let eo;
function Rc() {
  return eo == null && (eo = fb()), eo;
}
function fb() {
  if (typeof document > "u")
    return !0;
  let t = document.createElement("div");
  t.style.position = "absolute", t.style.top = "0px", t.style.left = "0px", t.innerHTML = "<table><tr><td><div></div></td></tr></table>", t.querySelector("table").style.height = "100px", t.querySelector("div").style.height = "100%", document.body.appendChild(t);
  let n = t.querySelector("div").offsetHeight > 0;
  return document.body.removeChild(t), n;
}
class pb extends Y {
  constructor() {
    super(...arguments), this.state = {
      forPrint: !1
    }, this.handleBeforePrint = () => {
      Cn(() => {
        this.setState({ forPrint: !0 });
      });
    }, this.handleAfterPrint = () => {
      Cn(() => {
        this.setState({ forPrint: !1 });
      });
    };
  }
  render() {
    let { props: e } = this, { options: n } = e, { forPrint: a } = this.state, r = a || n.height === "auto" || n.contentHeight === "auto", o = !r && n.height != null ? n.height : "", i = [
      "fc",
      a ? "fc-media-print" : "fc-media-screen",
      `fc-direction-${n.direction}`,
      e.theme.getClass("root")
    ];
    return Rc() || i.push("fc-liquid-hack"), e.children(i, o, r, a);
  }
  componentDidMount() {
    let { emitter: e } = this.props;
    e.on("_beforeprint", this.handleBeforePrint), e.on("_afterprint", this.handleAfterPrint);
  }
  componentWillUnmount() {
    let { emitter: e } = this.props;
    e.off("_beforeprint", this.handleBeforePrint), e.off("_afterprint", this.handleAfterPrint);
  }
}
class bt {
  constructor(e) {
    this.component = e.component, this.isHitComboAllowed = e.isHitComboAllowed || null;
  }
  destroy() {
  }
}
function gb(t, e) {
  return {
    component: t,
    el: e.el,
    useEventCenter: e.useEventCenter != null ? e.useEventCenter : !0,
    isHitComboAllowed: e.isHitComboAllowed || null
  };
}
function c2(t) {
  return {
    [t.component.uid]: t
  };
}
const wo = {};
class qn extends ce {
  constructor(e, n) {
    super(e, n), this.handleRefresh = () => {
      let a = this.computeTiming();
      a.state.nowDate.valueOf() !== this.state.nowDate.valueOf() && this.setState(a.state), this.clearTimeout(), this.setTimeout(a.waitMs);
    }, this.handleVisibilityChange = () => {
      document.hidden || this.handleRefresh();
    }, this.state = this.computeTiming().state;
  }
  render() {
    let { props: e, state: n } = this;
    return e.children(n.nowDate, n.todayRange);
  }
  componentDidMount() {
    this.setTimeout(), this.context.nowManager.addResetListener(this.handleRefresh), document.addEventListener("visibilitychange", this.handleVisibilityChange);
  }
  componentDidUpdate(e) {
    e.unit !== this.props.unit && (this.clearTimeout(), this.setTimeout());
  }
  componentWillUnmount() {
    this.clearTimeout(), this.context.nowManager.removeResetListener(this.handleRefresh), document.removeEventListener("visibilitychange", this.handleVisibilityChange);
  }
  computeTiming() {
    let { props: e, context: n } = this, a = n.nowManager.getDateMarker(), { nowIndicatorSnap: r } = n.options;
    r === "auto" && (r = // large unit?
    /year|month|week|day/.test(e.unit) || // if slotDuration 30 mins for example, would NOT appear to snap (legacy behavior)
    (e.unitValue || 1) === 1);
    let o, i;
    return r ? (o = n.dateEnv.startOf(a, e.unit), i = n.dateEnv.add(o, L(1, e.unit)).valueOf() - a.valueOf()) : (o = a, i = 1e3 * 60), i = Math.min(1e3 * 60 * 60 * 24, i), {
      state: { nowDate: o, todayRange: vb(o) },
      waitMs: i
    };
  }
  setTimeout(e = this.computeTiming().waitMs) {
    this.timeoutId = setTimeout(() => {
      const n = this.computeTiming();
      this.setState(n.state, () => {
        this.setTimeout(n.waitMs);
      });
    }, e);
  }
  clearTimeout() {
    this.timeoutId && clearTimeout(this.timeoutId);
  }
}
qn.contextType = tt;
function vb(t) {
  let e = G(t), n = X(e, 1);
  return { start: e, end: n };
}
class _b {
  getCurrentData() {
    return this.currentDataManager.getCurrentData();
  }
  dispatch(e) {
    this.currentDataManager.dispatch(e);
  }
  get view() {
    return this.getCurrentData().viewApi;
  }
  batchRendering(e) {
    e();
  }
  updateSize() {
    this.trigger("_resize", !0);
  }
  // Options
  // -----------------------------------------------------------------------------------------------------------------
  setOption(e, n) {
    this.dispatch({
      type: "SET_OPTION",
      optionName: e,
      rawOptionValue: n
    });
  }
  getOption(e) {
    return this.currentDataManager.currentCalendarOptionsInput[e];
  }
  getAvailableLocaleCodes() {
    return Object.keys(this.getCurrentData().availableRawLocales);
  }
  // Trigger
  // -----------------------------------------------------------------------------------------------------------------
  on(e, n) {
    let { currentDataManager: a } = this;
    a.currentCalendarOptionsRefiners[e] ? a.emitter.on(e, n) : console.warn(`Unknown listener name '${e}'`);
  }
  off(e, n) {
    this.currentDataManager.emitter.off(e, n);
  }
  // not meant for public use
  trigger(e, ...n) {
    this.currentDataManager.emitter.trigger(e, ...n);
  }
  // View
  // -----------------------------------------------------------------------------------------------------------------
  changeView(e, n) {
    this.batchRendering(() => {
      if (this.unselect(), n)
        if (n.start && n.end)
          this.dispatch({
            type: "CHANGE_VIEW_TYPE",
            viewType: e
          }), this.dispatch({
            type: "SET_OPTION",
            optionName: "visibleRange",
            rawOptionValue: n
          });
        else {
          let { dateEnv: a } = this.getCurrentData();
          this.dispatch({
            type: "CHANGE_VIEW_TYPE",
            viewType: e,
            dateMarker: a.createMarker(n)
          });
        }
      else
        this.dispatch({
          type: "CHANGE_VIEW_TYPE",
          viewType: e
        });
    });
  }
  // Forces navigation to a view for the given date.
  // `viewType` can be a specific view name or a generic one like "week" or "day".
  // needs to change
  zoomTo(e, n) {
    let a = this.getCurrentData(), r;
    n = n || "day", r = a.viewSpecs[n] || this.getUnitViewSpec(n), this.unselect(), r ? this.dispatch({
      type: "CHANGE_VIEW_TYPE",
      viewType: r.type,
      dateMarker: e
    }) : this.dispatch({
      type: "CHANGE_DATE",
      dateMarker: e
    });
  }
  // Given a duration singular unit, like "week" or "day", finds a matching view spec.
  // Preference is given to views that have corresponding buttons.
  getUnitViewSpec(e) {
    let { viewSpecs: n, toolbarConfig: a } = this.getCurrentData(), r = [].concat(a.header ? a.header.viewsWithButtons : [], a.footer ? a.footer.viewsWithButtons : []), o, i;
    for (let l in n)
      r.push(l);
    for (o = 0; o < r.length; o += 1)
      if (i = n[r[o]], i && i.singleUnit === e)
        return i;
    return null;
  }
  // Current Date
  // -----------------------------------------------------------------------------------------------------------------
  prev() {
    this.unselect(), this.dispatch({ type: "PREV" });
  }
  next() {
    this.unselect(), this.dispatch({ type: "NEXT" });
  }
  prevYear() {
    let e = this.getCurrentData();
    this.unselect(), this.dispatch({
      type: "CHANGE_DATE",
      dateMarker: e.dateEnv.addYears(e.currentDate, -1)
    });
  }
  nextYear() {
    let e = this.getCurrentData();
    this.unselect(), this.dispatch({
      type: "CHANGE_DATE",
      dateMarker: e.dateEnv.addYears(e.currentDate, 1)
    });
  }
  today() {
    let e = this.getCurrentData();
    this.unselect(), this.dispatch({
      type: "CHANGE_DATE",
      dateMarker: e.nowManager.getDateMarker()
    });
  }
  gotoDate(e) {
    let n = this.getCurrentData();
    this.unselect(), this.dispatch({
      type: "CHANGE_DATE",
      dateMarker: n.dateEnv.createMarker(e)
    });
  }
  incrementDate(e) {
    let n = this.getCurrentData(), a = L(e);
    a && (this.unselect(), this.dispatch({
      type: "CHANGE_DATE",
      dateMarker: n.dateEnv.add(n.currentDate, a)
    }));
  }
  getDate() {
    let e = this.getCurrentData();
    return e.dateEnv.toDate(e.currentDate);
  }
  // Date Formatting Utils
  // -----------------------------------------------------------------------------------------------------------------
  formatDate(e, n) {
    let { dateEnv: a } = this.getCurrentData();
    return a.format(a.createMarker(e), K(n));
  }
  // `settings` is for formatter AND isEndExclusive
  formatRange(e, n, a) {
    let { dateEnv: r } = this.getCurrentData();
    return r.formatRange(r.createMarker(e), r.createMarker(n), K(a), a);
  }
  formatIso(e, n) {
    let { dateEnv: a } = this.getCurrentData();
    return a.formatIso(a.createMarker(e), { omitTime: n });
  }
  // Date Selection / Event Selection / DayClick
  // -----------------------------------------------------------------------------------------------------------------
  select(e, n) {
    let a;
    n == null ? e.start != null ? a = e : a = {
      start: e,
      end: null
    } : a = {
      start: e,
      end: n
    };
    let r = this.getCurrentData(), o = ib(a, r.dateEnv, L({ days: 1 }));
    o && (this.dispatch({ type: "SELECT_DATES", selection: o }), Ac(o, null, r));
  }
  unselect(e) {
    let n = this.getCurrentData();
    n.dateSelection && (this.dispatch({ type: "UNSELECT_DATES" }), Yy(e, n));
  }
  // Public Events API
  // -----------------------------------------------------------------------------------------------------------------
  addEvent(e, n) {
    if (e instanceof $) {
      let i = e._def, l = e._instance;
      return this.getCurrentData().eventStore.defs[i.defId] || (this.dispatch({
        type: "ADD_EVENTS",
        eventStore: _o({ def: i, instance: l })
        // TODO: better util for two args?
      }), this.triggerEventAdd(e)), e;
    }
    let a = this.getCurrentData(), r;
    if (n instanceof lt)
      r = n.internalEventSource;
    else if (typeof n == "boolean")
      n && ([r] = e2(a.eventSources));
    else if (n != null) {
      let i = this.getEventSourceById(n);
      if (!i)
        return console.warn(`Could not find an event source with ID "${n}"`), null;
      r = i.internalEventSource;
    }
    let o = vc(e, r, a, !1);
    if (o) {
      let i = new $(a, o.def, o.def.recurringDef ? null : o.instance);
      return this.dispatch({
        type: "ADD_EVENTS",
        eventStore: _o(o)
      }), this.triggerEventAdd(i), i;
    }
    return null;
  }
  triggerEventAdd(e) {
    let { emitter: n } = this.getCurrentData();
    n.trigger("eventAdd", {
      event: e,
      relatedEvents: [],
      revert: () => {
        this.dispatch({
          type: "REMOVE_EVENTS",
          eventStore: xc(e)
        });
      }
    });
  }
  // TODO: optimize
  getEventById(e) {
    let n = this.getCurrentData(), { defs: a, instances: r } = n.eventStore;
    e = String(e);
    for (let o in a) {
      let i = a[o];
      if (i.publicId === e) {
        if (i.recurringDef)
          return new $(n, i, null);
        for (let l in r) {
          let s = r[l];
          if (s.defId === i.defId)
            return new $(n, i, s);
        }
      }
    }
    return null;
  }
  getEvents() {
    let e = this.getCurrentData();
    return qe(e.eventStore, e);
  }
  removeAllEvents() {
    this.dispatch({ type: "REMOVE_ALL_EVENTS" });
  }
  // Public Event Sources API
  // -----------------------------------------------------------------------------------------------------------------
  getEventSources() {
    let e = this.getCurrentData(), n = e.eventSources, a = [];
    for (let r in n)
      a.push(new lt(e, n[r]));
    return a;
  }
  getEventSourceById(e) {
    let n = this.getCurrentData(), a = n.eventSources;
    e = String(e);
    for (let r in a)
      if (a[r].publicId === e)
        return new lt(n, a[r]);
    return null;
  }
  addEventSource(e) {
    let n = this.getCurrentData();
    if (e instanceof lt)
      return n.eventSources[e.internalEventSource.sourceId] || this.dispatch({
        type: "ADD_EVENT_SOURCES",
        sources: [e.internalEventSource]
      }), e;
    let a = wc(e, n);
    return a ? (this.dispatch({ type: "ADD_EVENT_SOURCES", sources: [a] }), new lt(n, a)) : null;
  }
  removeAllEventSources() {
    this.dispatch({ type: "REMOVE_ALL_EVENT_SOURCES" });
  }
  refetchEvents() {
    this.dispatch({ type: "FETCH_EVENT_SOURCES", isRefetch: !0 });
  }
  // Scroll
  // -----------------------------------------------------------------------------------------------------------------
  scrollToTime(e) {
    let n = L(e);
    n && this.trigger("_scrollRequest", { time: n });
  }
}
function wb(t, e) {
  return t.left >= e.left && t.left < e.right && t.top >= e.top && t.top < e.bottom;
}
function Hc(t, e) {
  let n = {
    left: Math.max(t.left, e.left),
    right: Math.min(t.right, e.right),
    top: Math.max(t.top, e.top),
    bottom: Math.min(t.bottom, e.bottom)
  };
  return n.left < n.right && n.top < n.bottom ? n : !1;
}
function yb(t, e) {
  return {
    left: Math.min(Math.max(t.left, e.left), e.right),
    top: Math.min(Math.max(t.top, e.top), e.bottom)
  };
}
function bb(t) {
  return {
    left: (t.left + t.right) / 2,
    top: (t.top + t.bottom) / 2
  };
}
function Cb(t, e) {
  return {
    left: t.left - e.left,
    top: t.top - e.top
  };
}
function Ic(t, e, n, a) {
  return {
    dow: t.getUTCDay(),
    isDisabled: !!(a && (!a.activeRange || !Re(a.activeRange, t))),
    isOther: !!(a && !Re(a.currentRange, t)),
    isToday: !!(e && Re(e, t)),
    isPast: !!(e && t < e.start),
    isFuture: !!(e && t >= e.end)
  };
}
function d2(t, e) {
  let n = [
    "fc-day",
    `fc-day-${Sw[t.dow]}`
  ];
  return t.isDisabled ? n.push("fc-day-disabled") : (t.isToday && (n.push("fc-day-today"), n.push(e.getClass("today"))), t.isPast && n.push("fc-day-past"), t.isFuture && n.push("fc-day-future"), t.isOther && n.push("fc-day-other")), n;
}
const Ab = K({ year: "numeric", month: "long", day: "numeric" }), xb = K({ week: "long" });
function yo(t, e, n = "day", a = !0) {
  const { dateEnv: r, options: o, calendarApi: i } = t;
  let l = r.format(e, n === "week" ? xb : Ab);
  if (o.navLinks) {
    let s = r.toDate(e);
    const u = (d) => {
      let g = n === "day" ? o.navLinkDayClick : n === "week" ? o.navLinkWeekClick : null;
      typeof g == "function" ? g.call(i, r.toDate(e), d) : (typeof g == "string" && (n = g), i.zoomTo(e, n));
    };
    return Object.assign({ title: Dt(o.navLinkHint, [l, s], l), "data-navlink": "" }, a ? rc(u) : { onClick: u });
  }
  return { "aria-label": l };
}
let to = null;
function Eb() {
  return to === null && (to = Sb()), to;
}
function Sb() {
  let t = document.createElement("div");
  Mt(t, {
    position: "absolute",
    top: -1e3,
    left: 0,
    border: 0,
    padding: 0,
    overflow: "scroll",
    direction: "rtl"
  }), t.innerHTML = "<div></div>", document.body.appendChild(t);
  let n = t.firstChild.getBoundingClientRect().left > t.getBoundingClientRect().left;
  return $o(t), n;
}
let no;
function Mb() {
  return no || (no = Db()), no;
}
function Db() {
  let t = document.createElement("div");
  t.style.overflow = "scroll", t.style.position = "absolute", t.style.top = "-9999px", t.style.left = "-9999px", document.body.appendChild(t);
  let e = kc(t);
  return document.body.removeChild(t), e;
}
function kc(t) {
  return {
    x: t.offsetHeight - t.clientHeight,
    y: t.offsetWidth - t.clientWidth
  };
}
function Tb(t, e = !1) {
  let n = window.getComputedStyle(t), a = parseInt(n.borderLeftWidth, 10) || 0, r = parseInt(n.borderRightWidth, 10) || 0, o = parseInt(n.borderTopWidth, 10) || 0, i = parseInt(n.borderBottomWidth, 10) || 0, l = kc(t), s = l.y - a - r, u = l.x - o - i, d = {
    borderLeft: a,
    borderRight: r,
    borderTop: o,
    borderBottom: i,
    scrollbarBottom: u,
    scrollbarLeft: 0,
    scrollbarRight: 0
  };
  return Eb() && n.direction === "rtl" ? d.scrollbarLeft = s : d.scrollbarRight = s, e && (d.paddingLeft = parseInt(n.paddingLeft, 10) || 0, d.paddingRight = parseInt(n.paddingRight, 10) || 0, d.paddingTop = parseInt(n.paddingTop, 10) || 0, d.paddingBottom = parseInt(n.paddingBottom, 10) || 0), d;
}
function Rb(t, e = !1, n) {
  let a = u2(t), r = Tb(t, e), o = {
    left: a.left + r.borderLeft + r.scrollbarLeft,
    right: a.right - r.borderRight - r.scrollbarRight,
    top: a.top + r.borderTop,
    bottom: a.bottom - r.borderBottom - r.scrollbarBottom
  };
  return e && (o.left += r.paddingLeft, o.right -= r.paddingRight, o.top += r.paddingTop, o.bottom -= r.paddingBottom), o;
}
function u2(t) {
  let e = t.getBoundingClientRect();
  return {
    left: e.left + window.scrollX,
    top: e.top + window.scrollY,
    right: e.right + window.scrollX,
    bottom: e.bottom + window.scrollY
  };
}
function Hb(t) {
  let e = zc(t), n = t.getBoundingClientRect();
  for (let a of e) {
    let r = Hc(n, a.getBoundingClientRect());
    if (r)
      n = r;
    else
      return null;
  }
  return n;
}
function zc(t) {
  let e = [];
  for (; t instanceof HTMLElement; ) {
    let n = window.getComputedStyle(t);
    if (n.position === "fixed")
      break;
    /(auto|scroll)/.test(n.overflow + n.overflowY + n.overflowX) && e.push(t), t = t.parentNode;
  }
  return e;
}
class Sn {
  constructor(e, n, a, r) {
    this.els = n;
    let o = this.originClientRect = e.getBoundingClientRect();
    a && this.buildElHorizontals(o.left), r && this.buildElVerticals(o.top);
  }
  // Populates the left/right internal coordinate arrays
  buildElHorizontals(e) {
    let n = [], a = [];
    for (let r of this.els) {
      let o = r.getBoundingClientRect();
      n.push(o.left - e), a.push(o.right - e);
    }
    this.lefts = n, this.rights = a;
  }
  // Populates the top/bottom internal coordinate arrays
  buildElVerticals(e) {
    let n = [], a = [];
    for (let r of this.els) {
      let o = r.getBoundingClientRect();
      n.push(o.top - e), a.push(o.bottom - e);
    }
    this.tops = n, this.bottoms = a;
  }
  // Given a left offset (from document left), returns the index of the el that it horizontally intersects.
  // If no intersection is made, returns undefined.
  leftToIndex(e) {
    let { lefts: n, rights: a } = this, r = n.length, o;
    for (o = 0; o < r; o += 1)
      if (e >= n[o] && e < a[o])
        return o;
  }
  // Given a top offset (from document top), returns the index of the el that it vertically intersects.
  // If no intersection is made, returns undefined.
  topToIndex(e) {
    let { tops: n, bottoms: a } = this, r = n.length, o;
    for (o = 0; o < r; o += 1)
      if (e >= n[o] && e < a[o])
        return o;
  }
  // Gets the width of the element at the given index
  getWidth(e) {
    return this.rights[e] - this.lefts[e];
  }
  // Gets the height of the element at the given index
  getHeight(e) {
    return this.bottoms[e] - this.tops[e];
  }
  similarTo(e) {
    return Jt(this.tops || [], e.tops || []) && Jt(this.bottoms || [], e.bottoms || []) && Jt(this.lefts || [], e.lefts || []) && Jt(this.rights || [], e.rights || []);
  }
}
function Jt(t, e) {
  const n = t.length;
  if (n !== e.length)
    return !1;
  for (let a = 0; a < n; a++)
    if (Math.round(t[a]) !== Math.round(e[a]))
      return !1;
  return !0;
}
class m2 {
  getMaxScrollTop() {
    return this.getScrollHeight() - this.getClientHeight();
  }
  getMaxScrollLeft() {
    return this.getScrollWidth() - this.getClientWidth();
  }
  canScrollVertically() {
    return this.getMaxScrollTop() > 0;
  }
  canScrollHorizontally() {
    return this.getMaxScrollLeft() > 0;
  }
  canScrollUp() {
    return this.getScrollTop() > 0;
  }
  canScrollDown() {
    return this.getScrollTop() < this.getMaxScrollTop();
  }
  canScrollLeft() {
    return this.getScrollLeft() > 0;
  }
  canScrollRight() {
    return this.getScrollLeft() < this.getMaxScrollLeft();
  }
}
class Ib extends m2 {
  constructor(e) {
    super(), this.el = e;
  }
  getScrollTop() {
    return this.el.scrollTop;
  }
  getScrollLeft() {
    return this.el.scrollLeft;
  }
  setScrollTop(e) {
    this.el.scrollTop = e;
  }
  setScrollLeft(e) {
    this.el.scrollLeft = e;
  }
  getScrollWidth() {
    return this.el.scrollWidth;
  }
  getScrollHeight() {
    return this.el.scrollHeight;
  }
  getClientHeight() {
    return this.el.clientHeight;
  }
  getClientWidth() {
    return this.el.clientWidth;
  }
}
class kb extends m2 {
  getScrollTop() {
    return window.scrollY;
  }
  getScrollLeft() {
    return window.scrollX;
  }
  setScrollTop(e) {
    window.scroll(window.scrollX, e);
  }
  setScrollLeft(e) {
    window.scroll(e, window.scrollY);
  }
  getScrollWidth() {
    return document.documentElement.scrollWidth;
  }
  getScrollHeight() {
    return document.documentElement.scrollHeight;
  }
  getClientHeight() {
    return document.documentElement.clientHeight;
  }
  getClientWidth() {
    return document.documentElement.clientWidth;
  }
}
class at extends Y {
  constructor() {
    super(...arguments), this.uid = Je();
  }
  // Hit System
  // -----------------------------------------------------------------------------------------------------------------
  prepareHits() {
  }
  queryHit(e, n, a, r) {
    return null;
  }
  // Pointer Interaction Utils
  // -----------------------------------------------------------------------------------------------------------------
  isValidSegDownEl(e) {
    return !this.props.eventDrag && // HACK
    !this.props.eventResize && // HACK
    !ae(e, ".fc-event-mirror");
  }
  isValidDateDownEl(e) {
    return !ae(e, ".fc-event:not(.fc-bg-event)") && !ae(e, ".fc-more-link") && // a "more.." link
    !ae(e, "a[data-navlink]") && // a clickable nav link
    !ae(e, ".fc-popover");
  }
}
class zb {
  constructor(e = (n) => n.thickness || 1) {
    this.getEntryThickness = e, this.strictOrder = !1, this.allowReslicing = !1, this.maxCoord = -1, this.maxStackCnt = -1, this.levelCoords = [], this.entriesByLevel = [], this.stackCnts = {};
  }
  addSegs(e) {
    let n = [];
    for (let a of e)
      this.insertEntry(a, n);
    return n;
  }
  insertEntry(e, n) {
    let a = this.findInsertion(e);
    this.isInsertionValid(a, e) ? this.insertEntryAt(e, a) : this.handleInvalidInsertion(a, e, n);
  }
  isInsertionValid(e, n) {
    return (this.maxCoord === -1 || e.levelCoord + this.getEntryThickness(n) <= this.maxCoord) && (this.maxStackCnt === -1 || e.stackCnt < this.maxStackCnt);
  }
  handleInvalidInsertion(e, n, a) {
    if (this.allowReslicing && e.touchingEntry) {
      const r = Object.assign(Object.assign({}, n), { span: Vc(n.span, e.touchingEntry.span) });
      a.push(r), this.splitEntry(n, e.touchingEntry, a);
    } else
      a.push(n);
  }
  /*
  Does NOT add what hit the `barrier` into hiddenEntries. Should already be done.
  */
  splitEntry(e, n, a) {
    let r = e.span, o = n.span;
    r.start < o.start && this.insertEntry({
      index: e.index,
      thickness: e.thickness,
      span: { start: r.start, end: o.start }
    }, a), r.end > o.end && this.insertEntry({
      index: e.index,
      thickness: e.thickness,
      span: { start: o.end, end: r.end }
    }, a);
  }
  insertEntryAt(e, n) {
    let { entriesByLevel: a, levelCoords: r } = this;
    n.lateral === -1 ? (ao(r, n.level, n.levelCoord), ao(a, n.level, [e])) : ao(a[n.level], n.lateral, e), this.stackCnts[Ht(e)] = n.stackCnt;
  }
  /*
  does not care about limits
  */
  findInsertion(e) {
    let { levelCoords: n, entriesByLevel: a, strictOrder: r, stackCnts: o } = this, i = n.length, l = 0, s = -1, u = -1, d = null, g = 0;
    for (let w = 0; w < i; w += 1) {
      const _ = n[w];
      if (!r && _ >= l + this.getEntryThickness(e))
        break;
      let y = a[w], A, E = Dl(y, e.span.start, Ml), S = E[0] + E[1];
      for (
        ;
        // loop through entries that horizontally intersect
        (A = y[S]) && // but not past the whole entry list
        A.span.start < e.span.end;
      ) {
        let M = _ + this.getEntryThickness(A);
        M > l && (l = M, d = A, s = w, u = S), M === l && (g = Math.max(g, o[Ht(A)] + 1)), S += 1;
      }
    }
    let v = 0;
    if (d)
      for (v = s + 1; v < i && n[v] < l; )
        v += 1;
    let p = -1;
    return v < i && n[v] === l && (p = Dl(a[v], e.span.end, Ml)[0]), {
      touchingLevel: s,
      touchingLateral: u,
      touchingEntry: d,
      stackCnt: g,
      levelCoord: l,
      level: v,
      lateral: p
    };
  }
  // sorted by levelCoord (lowest to highest)
  toRects() {
    let { entriesByLevel: e, levelCoords: n } = this, a = e.length, r = [];
    for (let o = 0; o < a; o += 1) {
      let i = e[o], l = n[o];
      for (let s of i)
        r.push(Object.assign(Object.assign({}, s), { thickness: this.getEntryThickness(s), levelCoord: l }));
    }
    return r;
  }
}
function Ml(t) {
  return t.span.end;
}
function Ht(t) {
  return t.index + ":" + t.span.start;
}
function Vc(t, e) {
  let n = Math.max(t.start, e.start), a = Math.min(t.end, e.end);
  return n < a ? { start: n, end: a } : null;
}
function ao(t, e, n) {
  t.splice(e, 0, n);
}
function Dl(t, e, n) {
  let a = 0, r = t.length;
  if (!r || e < n(t[a]))
    return [0, 0];
  if (e > n(t[r - 1]))
    return [r, 0];
  for (; a < r; ) {
    let o = Math.floor(a + (r - a) / 2), i = n(t[o]);
    if (e < i)
      r = o;
    else if (e > i)
      a = o + 1;
    else
      return [o, 1];
  }
  return [a, 0];
}
class Vb {
  constructor(e, n) {
    this.emitter = new jn();
  }
  destroy() {
  }
  setMirrorIsVisible(e) {
  }
  setMirrorNeedsRevert(e) {
  }
  setAutoScrollEnabled(e) {
  }
}
const h2 = {};
function Ob(t, e) {
  return !t || e > 10 ? K({ weekday: "short" }) : e > 1 ? K({ weekday: "short", month: "numeric", day: "numeric", omitCommas: !0 }) : K({ weekday: "long" });
}
const Oc = "fc-col-header-cell";
function Bc(t) {
  return t.text;
}
class Bb extends Y {
  render() {
    let { dateEnv: e, options: n, theme: a, viewApi: r } = this.context, { props: o } = this, { date: i, dateProfile: l } = o, s = Ic(i, o.todayRange, null, l), u = [Oc].concat(d2(s, a)), d = e.format(i, o.dayHeaderFormat), g = !s.isDisabled && o.colCnt > 1 ? yo(this.context, i) : {}, v = e.toDate(i);
    e.namedTimeZoneImpl && (v = Ie(v, 36e5));
    let p = Object.assign(Object.assign(Object.assign({ date: v, view: r }, o.extraRenderProps), { text: d }), s);
    return C(xe, { elTag: "th", elClasses: u, elAttrs: Object.assign({ role: "columnheader", colSpan: o.colSpan, "data-date": s.isDisabled ? void 0 : Zo(i) }, o.extraDataAttrs), renderProps: p, generatorName: "dayHeaderContent", customGenerator: n.dayHeaderContent, defaultGenerator: Bc, classNameGenerator: n.dayHeaderClassNames, didMount: n.dayHeaderDidMount, willUnmount: n.dayHeaderWillUnmount }, (w) => C("div", { className: "fc-scrollgrid-sync-inner" }, !s.isDisabled && C(w, { elTag: "a", elAttrs: g, elClasses: [
      "fc-col-header-cell-cushion",
      o.isSticky && "fc-sticky"
    ] })));
  }
}
const Lb = K({ weekday: "long" });
class Nb extends Y {
  render() {
    let { props: e } = this, { dateEnv: n, theme: a, viewApi: r, options: o } = this.context, i = X(/* @__PURE__ */ new Date(2592e5), e.dow), l = {
      dow: e.dow,
      isDisabled: !1,
      isFuture: !1,
      isPast: !1,
      isToday: !1,
      isOther: !1
    }, s = n.format(i, e.dayHeaderFormat), u = Object.assign(Object.assign(Object.assign(Object.assign({
      // TODO: make this public?
      date: i
    }, l), { view: r }), e.extraRenderProps), { text: s });
    return C(xe, { elTag: "th", elClasses: [
      Oc,
      ...d2(l, a),
      ...e.extraClassNames || []
    ], elAttrs: Object.assign({ role: "columnheader", colSpan: e.colSpan }, e.extraDataAttrs), renderProps: u, generatorName: "dayHeaderContent", customGenerator: o.dayHeaderContent, defaultGenerator: Bc, classNameGenerator: o.dayHeaderClassNames, didMount: o.dayHeaderDidMount, willUnmount: o.dayHeaderWillUnmount }, (d) => C(
      "div",
      { className: "fc-scrollgrid-sync-inner" },
      C(d, { elTag: "a", elClasses: [
        "fc-col-header-cell-cushion",
        e.isSticky && "fc-sticky"
      ], elAttrs: {
        "aria-label": n.format(i, Lb)
      } })
    ));
  }
}
class Pb extends Y {
  constructor() {
    super(...arguments), this.createDayHeaderFormatter = O(jb);
  }
  render() {
    let { context: e } = this, { dates: n, dateProfile: a, datesRepDistinctDays: r, renderIntro: o } = this.props, i = this.createDayHeaderFormatter(e.options.dayHeaderFormat, r, n.length);
    return C(qn, { unit: "day" }, (l, s) => C(
      "tr",
      { role: "row" },
      o && o("day"),
      n.map((u) => r ? C(Bb, { key: u.toISOString(), date: u, dateProfile: a, todayRange: s, colCnt: n.length, dayHeaderFormat: i }) : C(Nb, { key: u.getUTCDay(), dow: u.getUTCDay(), dayHeaderFormat: i }))
    ));
  }
}
function jb(t, e, n) {
  return t || Ob(e, n);
}
class qb {
  constructor(e, n) {
    let a = e.start, { end: r } = e, o = [], i = [], l = -1;
    for (; a < r; )
      n.isHiddenDay(a) ? o.push(l + 0.5) : (l += 1, o.push(l), i.push(a)), a = X(a, 1);
    this.dates = i, this.indices = o, this.cnt = i.length;
  }
  sliceRange(e) {
    let n = this.getDateDayIndex(e.start), a = this.getDateDayIndex(X(e.end, -1)), r = Math.max(0, n), o = Math.min(this.cnt - 1, a);
    return r = Math.ceil(r), o = Math.floor(o), r <= o ? {
      firstIndex: r,
      lastIndex: o,
      isStart: n === r,
      isEnd: a === o
    } : null;
  }
  // Given a date, returns its chronolocial cell-index from the first cell of the grid.
  // If the date lies between cells (because of hiddenDays), returns a floating-point value between offsets.
  // If before the first offset, returns a negative number.
  // If after the last offset, returns an offset past the last cell offset.
  // Only works for *start* dates of cells. Will not work for exclusive end dates for cells.
  getDateDayIndex(e) {
    let { indices: n } = this, a = Math.floor(yt(this.dates[0], e));
    return a < 0 ? n[0] - 1 : a >= n.length ? n[n.length - 1] + 1 : n[a];
  }
}
class Fb {
  constructor(e, n) {
    let { dates: a } = e, r, o, i;
    if (n) {
      for (o = a[0].getUTCDay(), r = 1; r < a.length && a[r].getUTCDay() !== o; r += 1)
        ;
      i = Math.ceil(a.length / r);
    } else
      i = 1, r = a.length;
    this.rowCnt = i, this.colCnt = r, this.daySeries = e, this.cells = this.buildCells(), this.headerDates = this.buildHeaderDates();
  }
  buildCells() {
    let e = [];
    for (let n = 0; n < this.rowCnt; n += 1) {
      let a = [];
      for (let r = 0; r < this.colCnt; r += 1)
        a.push(this.buildCell(n, r));
      e.push(a);
    }
    return e;
  }
  buildCell(e, n) {
    let a = this.daySeries.dates[e * this.colCnt + n];
    return {
      key: a.toISOString(),
      date: a
    };
  }
  buildHeaderDates() {
    let e = [];
    for (let n = 0; n < this.colCnt; n += 1)
      e.push(this.cells[0][n].date);
    return e;
  }
  sliceRange(e) {
    let { colCnt: n } = this, a = this.daySeries.sliceRange(e), r = [];
    if (a) {
      let { firstIndex: o, lastIndex: i } = a, l = o;
      for (; l <= i; ) {
        let s = Math.floor(l / n), u = Math.min((s + 1) * n, i + 1);
        r.push({
          row: s,
          firstCol: l % n,
          lastCol: (u - 1) % n,
          isStart: a.isStart && l === o,
          isEnd: a.isEnd && u - 1 === i
        }), l = u;
      }
    }
    return r;
  }
}
class Ub {
  constructor() {
    this.sliceBusinessHours = O(this._sliceBusinessHours), this.sliceDateSelection = O(this._sliceDateSpan), this.sliceEventStore = O(this._sliceEventStore), this.sliceEventDrag = O(this._sliceInteraction), this.sliceEventResize = O(this._sliceInteraction), this.forceDayIfListItem = !1;
  }
  sliceProps(e, n, a, r, ...o) {
    let { eventUiBases: i } = e, l = this.sliceEventStore(e.eventStore, i, n, a, ...o);
    return {
      dateSelectionSegs: this.sliceDateSelection(e.dateSelection, n, a, i, r, ...o),
      businessHourSegs: this.sliceBusinessHours(e.businessHours, n, a, r, ...o),
      fgEventSegs: l.fg,
      bgEventSegs: l.bg,
      eventDrag: this.sliceEventDrag(e.eventDrag, i, n, a, ...o),
      eventResize: this.sliceEventResize(e.eventResize, i, n, a, ...o),
      eventSelection: e.eventSelection
    };
  }
  sliceNowDate(e, n, a, r, ...o) {
    return this._sliceDateSpan(
      { range: { start: e, end: Ie(e, 1) }, allDay: !1 },
      // add 1 ms, protect against null range
      n,
      a,
      {},
      r,
      ...o
    );
  }
  _sliceBusinessHours(e, n, a, r, ...o) {
    return e ? this._sliceEventStore($e(e, en(n, !!a), r), {}, n, a, ...o).bg : [];
  }
  _sliceEventStore(e, n, a, r, ...o) {
    if (e) {
      let i = xl(e, n, en(a, !!r), r);
      return {
        bg: this.sliceEventRanges(i.bg, o),
        fg: this.sliceEventRanges(i.fg, o)
      };
    }
    return { bg: [], fg: [] };
  }
  _sliceInteraction(e, n, a, r, ...o) {
    if (!e)
      return null;
    let i = xl(e.mutatedEvents, n, en(a, !!r), r);
    return {
      segs: this.sliceEventRanges(i.fg, o),
      affectedInstances: e.affectedEvents.instances,
      isEvent: e.isEvent
    };
  }
  _sliceDateSpan(e, n, a, r, o, ...i) {
    if (!e)
      return [];
    let l = en(n, !!a), s = gt(e.range, l);
    if (s) {
      e = Object.assign(Object.assign({}, e), { range: s });
      let u = ub(e, r, o), d = this.sliceRange(e.range, ...i);
      for (let g of d)
        g.eventRange = u;
      return d;
    }
    return [];
  }
  /*
  "complete" seg means it has component and eventRange
  */
  sliceEventRanges(e, n) {
    let a = [];
    for (let r of e)
      a.push(...this.sliceEventRange(r, n));
    return a;
  }
  /*
  "complete" seg means it has component and eventRange
  */
  sliceEventRange(e, n) {
    let a = e.range;
    this.forceDayIfListItem && e.ui.display === "list-item" && (a = {
      start: a.start,
      end: X(a.start, 1)
    });
    let r = this.sliceRange(a, ...n);
    for (let o of r)
      o.eventRange = e, o.isStart = e.isStart && o.isStart, o.isEnd = e.isEnd && o.isEnd;
    return r;
  }
}
function en(t, e) {
  let n = t.activeRange;
  return e ? n : {
    start: Ie(n.start, t.slotMinTime.milliseconds),
    end: Ie(n.end, t.slotMaxTime.milliseconds - 864e5)
    // 864e5 = ms in a day
  };
}
function Lc(t, e, n) {
  let { instances: a } = t.mutatedEvents;
  for (let r in a)
    if (!Nn(e.validRange, a[r].range))
      return !1;
  return Nc({ eventDrag: t }, n);
}
function Wb(t, e, n) {
  return Nn(e.validRange, t.range) ? Nc({ dateSelection: t }, n) : !1;
}
function Nc(t, e) {
  let n = e.getCurrentData(), a = Object.assign({ businessHours: n.businessHours, dateSelection: "", eventStore: n.eventStore, eventUiBases: n.eventUiBases, eventSelection: "", eventDrag: null, eventResize: null }, t);
  return (e.pluginHooks.isPropsValid || Gb)(a, e);
}
function Gb(t, e, n = {}, a) {
  return !(t.eventDrag && !$b(t, e, n, a) || t.dateSelection && !Qb(t, e, n, a));
}
function $b(t, e, n, a) {
  let r = e.getCurrentData(), o = t.eventDrag, i = o.mutatedEvents, l = i.defs, s = i.instances, u = En(l, o.isEvent ? t.eventUiBases : { "": r.selectionConfig });
  a && (u = et(u, a));
  let d = qy(t.eventStore, o.affectedEvents.instances), g = d.defs, v = d.instances, p = En(g, t.eventUiBases);
  for (let w in s) {
    let _ = s[w], y = _.range, A = u[_.defId], E = l[_.defId];
    if (!Pc(A.constraints, y, d, t.businessHours, e))
      return !1;
    let { eventOverlap: S } = e.options, M = typeof S == "function" ? S : null;
    for (let z in v) {
      let T = v[z];
      if (n2(y, T.range) && (p[T.defId].overlap === !1 && o.isEvent || A.overlap === !1 || M && !M(
        new $(e, g[T.defId], T),
        // still event
        new $(e, E, _)
      )))
        return !1;
    }
    let P = r.eventStore;
    for (let z of A.allows) {
      let T = Object.assign(Object.assign({}, n), { range: _.range, allDay: E.allDay }), R = P.defs[E.defId], H = P.instances[w], Q;
      if (R ? Q = new $(e, R, H) : Q = new $(e, E), !z(l2(T, e), Q))
        return !1;
    }
  }
  return !0;
}
function Qb(t, e, n, a) {
  let r = t.eventStore, o = r.defs, i = r.instances, l = t.dateSelection, s = l.range, { selectionConfig: u } = e.getCurrentData();
  if (a && (u = a(u)), !Pc(u.constraints, s, r, t.businessHours, e))
    return !1;
  let { selectOverlap: d } = e.options, g = typeof d == "function" ? d : null;
  for (let v in i) {
    let p = i[v];
    if (n2(s, p.range) && (u.overlap === !1 || g && !g(new $(e, o[p.defId], p), null)))
      return !1;
  }
  for (let v of u.allows) {
    let p = Object.assign(Object.assign({}, n), l);
    if (!v(l2(p, e), null))
      return !1;
  }
  return !0;
}
function Pc(t, e, n, a, r) {
  for (let o of t)
    if (!Zb(Yb(o, e, n, a, r), e))
      return !1;
  return !0;
}
function Yb(t, e, n, a, r) {
  return t === "businessHours" ? ro($e(a, e, r)) : typeof t == "string" ? ro(Pn(n, (o) => o.groupId === t)) : typeof t == "object" && t ? ro($e(t, e, r)) : [];
}
function ro(t) {
  let { instances: e } = t, n = [];
  for (let a in e)
    n.push(e[a].range);
  return n;
}
function Zb(t, e) {
  for (let n of t)
    if (Nn(n, e))
      return !0;
  return !1;
}
const tn = /^(visible|hidden)$/;
class Kb extends Y {
  constructor() {
    super(...arguments), this.handleEl = (e) => {
      this.el = e, we(this.props.elRef, e);
    };
  }
  render() {
    let { props: e } = this, { liquid: n, liquidIsAbsolute: a } = e, r = n && a, o = ["fc-scroller"];
    return n && (a ? o.push("fc-scroller-liquid-absolute") : o.push("fc-scroller-liquid")), C("div", { ref: this.handleEl, className: o.join(" "), style: {
      overflowX: e.overflowX,
      overflowY: e.overflowY,
      left: r && -(e.overcomeLeft || 0) || "",
      right: r && -(e.overcomeRight || 0) || "",
      bottom: r && -(e.overcomeBottom || 0) || "",
      marginLeft: !r && -(e.overcomeLeft || 0) || "",
      marginRight: !r && -(e.overcomeRight || 0) || "",
      marginBottom: !r && -(e.overcomeBottom || 0) || "",
      maxHeight: e.maxHeight || ""
    } }, e.children);
  }
  needsXScrolling() {
    if (tn.test(this.props.overflowX))
      return !1;
    let { el: e } = this, n = this.el.getBoundingClientRect().width - this.getYScrollbarWidth(), { children: a } = e;
    for (let r = 0; r < a.length; r += 1)
      if (a[r].getBoundingClientRect().width > n)
        return !0;
    return !1;
  }
  needsYScrolling() {
    if (tn.test(this.props.overflowY))
      return !1;
    let { el: e } = this, n = this.el.getBoundingClientRect().height - this.getXScrollbarWidth(), { children: a } = e;
    for (let r = 0; r < a.length; r += 1)
      if (a[r].getBoundingClientRect().height > n)
        return !0;
    return !1;
  }
  getXScrollbarWidth() {
    return tn.test(this.props.overflowX) ? 0 : this.el.offsetHeight - this.el.clientHeight;
  }
  getYScrollbarWidth() {
    return tn.test(this.props.overflowY) ? 0 : this.el.offsetWidth - this.el.clientWidth;
  }
}
class je {
  constructor(e) {
    this.masterCallback = e, this.currentMap = {}, this.depths = {}, this.callbackMap = {}, this.handleValue = (n, a) => {
      let { depths: r, currentMap: o } = this, i = !1, l = !1;
      n !== null ? (i = a in o, o[a] = n, r[a] = (r[a] || 0) + 1, l = !0) : (r[a] -= 1, r[a] || (delete o[a], delete this.callbackMap[a], i = !0)), this.masterCallback && (i && this.masterCallback(null, String(a)), l && this.masterCallback(n, String(a)));
    };
  }
  createRef(e) {
    let n = this.callbackMap[e];
    return n || (n = this.callbackMap[e] = (a) => {
      this.handleValue(a, String(e));
    }), n;
  }
  // TODO: check callers that don't care about order. should use getAll instead
  // NOTE: this method has become less valuable now that we are encouraged to map order by some other index
  // TODO: provide ONE array-export function, buildArray, which fails on non-numeric indexes. caller can manipulate and "collect"
  collect(e, n, a) {
    return iy(this.currentMap, e, n, a);
  }
  getAll() {
    return e2(this.currentMap);
  }
}
function Xb(t) {
  let e = ow(t, ".fc-scrollgrid-shrink"), n = 0;
  for (let a of e)
    n = Math.max(n, ww(a));
  return Math.ceil(n);
}
function jc(t, e) {
  return t.liquid && e.liquid;
}
function Jb(t, e) {
  return e.maxHeight != null || // if its possible for the height to max out, we might need scrollbars
  jc(t, e);
}
function eC(t, e, n, a) {
  let { expandRows: r } = n;
  return typeof e.content == "function" ? e.content(n) : C("table", {
    role: "presentation",
    className: [
      e.tableClassName,
      t.syncRowHeights ? "fc-scrollgrid-sync-table" : ""
    ].join(" "),
    style: {
      minWidth: n.tableMinWidth,
      width: n.clientWidth,
      height: r ? n.clientHeight : ""
      // css `height` on a <table> serves as a min-height
    }
  }, n.tableColGroupNode, C(a ? "thead" : "tbody", {
    role: "presentation"
  }, typeof e.rowContent == "function" ? e.rowContent(n) : e.rowContent));
}
function tC(t, e) {
  return He(t, e, pe);
}
function nC(t, e) {
  let n = [];
  for (let a of t) {
    let r = a.span || 1;
    for (let o = 0; o < r; o += 1)
      n.push(C("col", { style: {
        width: a.width === "shrink" ? aC(e) : a.width || "",
        minWidth: a.minWidth || ""
      } }));
  }
  return C("colgroup", {}, ...n);
}
function aC(t) {
  return t ?? 4;
}
function rC(t) {
  for (let e of t)
    if (e.width === "shrink")
      return !0;
  return !1;
}
function oC(t, e) {
  let n = [
    "fc-scrollgrid",
    e.theme.getClass("table")
  ];
  return t && n.push("fc-scrollgrid-liquid"), n;
}
function iC(t, e) {
  let n = [
    "fc-scrollgrid-section",
    `fc-scrollgrid-section-${t.type}`,
    t.className
    // used?
  ];
  return e && t.liquid && t.maxHeight == null && n.push("fc-scrollgrid-section-liquid"), t.isSticky && n.push("fc-scrollgrid-section-sticky"), n;
}
function lC(t) {
  return C("div", { className: "fc-scrollgrid-sticky-shim", style: {
    width: t.clientWidth,
    minWidth: t.tableMinWidth
  } });
}
function Tl(t) {
  let { stickyHeaderDates: e } = t;
  return (e == null || e === "auto") && (e = t.height === "auto" || t.viewHeight === "auto"), e;
}
function sC(t) {
  let { stickyFooterScrollbar: e } = t;
  return (e == null || e === "auto") && (e = t.height === "auto" || t.viewHeight === "auto"), e;
}
class qc extends Y {
  constructor() {
    super(...arguments), this.processCols = O((e) => e, tC), this.renderMicroColGroup = O(nC), this.scrollerRefs = new je(), this.scrollerElRefs = new je(this._handleScrollerEl.bind(this)), this.state = {
      shrinkWidth: null,
      forceYScrollbars: !1,
      scrollerClientWidths: {},
      scrollerClientHeights: {}
    }, this.handleSizing = () => {
      this.safeSetState(Object.assign({ shrinkWidth: this.computeShrinkWidth() }, this.computeScrollerDims()));
    };
  }
  render() {
    let { props: e, state: n, context: a } = this, r = e.sections || [], o = this.processCols(e.cols), i = this.renderMicroColGroup(o, n.shrinkWidth), l = oC(e.liquid, a);
    e.collapsibleWidth && l.push("fc-scrollgrid-collapsible");
    let s = r.length, u = 0, d, g = [], v = [], p = [];
    for (; u < s && (d = r[u]).type === "header"; )
      g.push(this.renderSection(d, i, !0)), u += 1;
    for (; u < s && (d = r[u]).type === "body"; )
      v.push(this.renderSection(d, i, !1)), u += 1;
    for (; u < s && (d = r[u]).type === "footer"; )
      p.push(this.renderSection(d, i, !0)), u += 1;
    let w = !Rc();
    const _ = { role: "rowgroup" };
    return C("table", {
      role: "grid",
      className: l.join(" "),
      style: { height: e.height }
    }, !!(!w && g.length) && C("thead", _, ...g), !!(!w && v.length) && C("tbody", _, ...v), !!(!w && p.length) && C("tfoot", _, ...p), w && C("tbody", _, ...g, ...v, ...p));
  }
  renderSection(e, n, a) {
    return "outerContent" in e ? C(Z, { key: e.key }, e.outerContent) : C("tr", { key: e.key, role: "presentation", className: iC(e, this.props.liquid).join(" ") }, this.renderChunkTd(e, n, e.chunk, a));
  }
  renderChunkTd(e, n, a, r) {
    if ("outerContent" in a)
      return a.outerContent;
    let { props: o } = this, { forceYScrollbars: i, scrollerClientWidths: l, scrollerClientHeights: s } = this.state, u = Jb(o, e), d = jc(o, e), g = o.liquid ? i ? "scroll" : u ? "auto" : "hidden" : "visible", v = e.key, p = eC(e, a, {
      tableColGroupNode: n,
      tableMinWidth: "",
      clientWidth: !o.collapsibleWidth && l[v] !== void 0 ? l[v] : null,
      clientHeight: s[v] !== void 0 ? s[v] : null,
      expandRows: e.expandRows,
      syncRowHeights: !1,
      rowSyncHeights: [],
      reportRowHeightChange: () => {
      }
    }, r);
    return C(r ? "th" : "td", {
      ref: a.elRef,
      role: "presentation"
    }, C(
      "div",
      { className: `fc-scroller-harness${d ? " fc-scroller-harness-liquid" : ""}` },
      C(Kb, { ref: this.scrollerRefs.createRef(v), elRef: this.scrollerElRefs.createRef(v), overflowY: g, overflowX: o.liquid ? "hidden" : "visible", maxHeight: e.maxHeight, liquid: d, liquidIsAbsolute: !0 }, p)
    ));
  }
  _handleScrollerEl(e, n) {
    let a = cC(this.props.sections, n);
    a && we(a.chunk.scrollerElRef, e);
  }
  componentDidMount() {
    this.handleSizing(), this.context.addResizeHandler(this.handleSizing);
  }
  componentDidUpdate() {
    this.handleSizing();
  }
  componentWillUnmount() {
    this.context.removeResizeHandler(this.handleSizing);
  }
  computeShrinkWidth() {
    return rC(this.props.cols) ? Xb(this.scrollerElRefs.getAll()) : 0;
  }
  computeScrollerDims() {
    let e = Mb(), { scrollerRefs: n, scrollerElRefs: a } = this, r = !1, o = {}, i = {};
    for (let l in n.currentMap) {
      let s = n.currentMap[l];
      if (s && s.needsYScrolling()) {
        r = !0;
        break;
      }
    }
    for (let l of this.props.sections) {
      let s = l.key, u = a.currentMap[s];
      if (u) {
        let d = u.parentNode;
        o[s] = Math.floor(d.getBoundingClientRect().width - (r ? e.y : 0)), i[s] = Math.floor(d.getBoundingClientRect().height);
      }
    }
    return { forceYScrollbars: r, scrollerClientWidths: o, scrollerClientHeights: i };
  }
}
qc.addStateEquality({
  scrollerClientWidths: pe,
  scrollerClientHeights: pe
});
function cC(t, e) {
  for (let n of t)
    if (n.key === e)
      return n;
  return null;
}
class f2 extends Y {
  constructor() {
    super(...arguments), this.buildPublicEvent = O((e, n, a) => new $(e, n, a)), this.handleEl = (e) => {
      this.el = e, we(this.props.elRef, e), e && El(e, this.props.seg);
    };
  }
  render() {
    const { props: e, context: n } = this, { options: a } = n, { seg: r } = e, { eventRange: o } = r, { ui: i } = o, l = {
      event: this.buildPublicEvent(n, o.def, o.instance),
      view: n.viewApi,
      timeText: e.timeText,
      textColor: i.textColor,
      backgroundColor: i.backgroundColor,
      borderColor: i.borderColor,
      isDraggable: !e.disableDragging && eb(r, n),
      isStartResizable: !e.disableResizing && tb(r, n),
      isEndResizable: !e.disableResizing && nb(r),
      isMirror: !!(e.isDragging || e.isResizing || e.isDateSelecting),
      isStart: !!r.isStart,
      isEnd: !!r.isEnd,
      isPast: !!e.isPast,
      isFuture: !!e.isFuture,
      isToday: !!e.isToday,
      isSelected: !!e.isSelected,
      isDragging: !!e.isDragging,
      isResizing: !!e.isResizing
    };
    return C(xe, { elRef: this.handleEl, elTag: e.elTag, elAttrs: e.elAttrs, elClasses: [
      ...ab(l),
      ...r.eventRange.ui.classNames,
      ...e.elClasses || []
    ], elStyle: e.elStyle, renderProps: l, generatorName: "eventContent", customGenerator: a.eventContent, defaultGenerator: e.defaultGenerator, classNameGenerator: a.eventClassNames, didMount: a.eventDidMount, willUnmount: a.eventWillUnmount }, e.children);
  }
  componentDidUpdate(e) {
    this.el && this.props.seg !== e.seg && El(this.el, this.props.seg);
  }
}
class Fc extends Y {
  render() {
    let { props: e, context: n } = this, { options: a } = n, { seg: r } = e, { ui: o } = r.eventRange, i = a.eventTimeFormat || e.defaultTimeFormat, l = Sc(r, i, n, e.defaultDisplayEventTime, e.defaultDisplayEventEnd);
    return C(f2, Object.assign({}, e, { elTag: "a", elStyle: {
      borderColor: o.borderColor,
      backgroundColor: o.backgroundColor
    }, elAttrs: Mc(r, n), defaultGenerator: dC, timeText: l }), (s, u) => C(
      Z,
      null,
      C(s, { elTag: "div", elClasses: ["fc-event-main"], elStyle: { color: u.textColor } }),
      !!u.isStartResizable && C("div", { className: "fc-event-resizer fc-event-resizer-start" }),
      !!u.isEndResizable && C("div", { className: "fc-event-resizer fc-event-resizer-end" })
    ));
  }
}
Fc.addPropsEquality({
  seg: pe
});
function dC(t) {
  return C(
    "div",
    { className: "fc-event-main-frame" },
    t.timeText && C("div", { className: "fc-event-time" }, t.timeText),
    C(
      "div",
      { className: "fc-event-title-container" },
      C("div", { className: "fc-event-title fc-sticky" }, t.event.title || C(Z, null, " "))
    )
  );
}
const uC = K({ day: "numeric" });
class Uc extends Y {
  constructor() {
    super(...arguments), this.refineRenderProps = sn(mC);
  }
  render() {
    let { props: e, context: n } = this, { options: a } = n, r = this.refineRenderProps({
      date: e.date,
      dateProfile: e.dateProfile,
      todayRange: e.todayRange,
      isMonthStart: e.isMonthStart || !1,
      showDayNumber: e.showDayNumber,
      extraRenderProps: e.extraRenderProps,
      viewApi: n.viewApi,
      dateEnv: n.dateEnv,
      monthStartFormat: a.monthStartFormat
    });
    return C(xe, { elRef: e.elRef, elTag: e.elTag, elAttrs: Object.assign(Object.assign({}, e.elAttrs), r.isDisabled ? {} : { "data-date": Zo(e.date) }), elClasses: [
      ...d2(r, n.theme),
      ...e.elClasses || []
    ], elStyle: e.elStyle, renderProps: r, generatorName: "dayCellContent", customGenerator: a.dayCellContent, defaultGenerator: e.defaultGenerator, classNameGenerator: (
      // don't use custom classNames if disabled
      r.isDisabled ? void 0 : a.dayCellClassNames
    ), didMount: a.dayCellDidMount, willUnmount: a.dayCellWillUnmount }, e.children);
  }
}
function Wc(t) {
  return !!(t.dayCellContent || go("dayCellContent", t));
}
function mC(t) {
  let { date: e, dateEnv: n, dateProfile: a, isMonthStart: r } = t, o = Ic(e, t.todayRange, null, a), i = t.showDayNumber ? n.format(e, r ? t.monthStartFormat : uC) : "";
  return Object.assign(Object.assign(Object.assign({ date: n.toDate(e), view: t.viewApi }, o), {
    isMonthStart: r,
    dayNumberText: i
  }), t.extraRenderProps);
}
class hC extends Y {
  render() {
    let { props: e } = this, { seg: n } = e;
    return C(f2, { elTag: "div", elClasses: ["fc-bg-event"], elStyle: { backgroundColor: n.eventRange.ui.backgroundColor }, defaultGenerator: fC, seg: n, timeText: "", isDragging: !1, isResizing: !1, isDateSelecting: !1, isSelected: !1, isPast: e.isPast, isFuture: e.isFuture, isToday: e.isToday, disableDragging: !0, disableResizing: !0 });
  }
}
function fC(t) {
  let { title: e } = t.event;
  return e && C("div", { className: "fc-event-title" }, t.event.title);
}
function pC(t) {
  return C("div", { className: `fc-${t}` });
}
const gC = (t) => C(tt.Consumer, null, (e) => {
  let { dateEnv: n, options: a } = e, { date: r } = t, o = a.weekNumberFormat || t.defaultFormat, i = n.computeWeekNumber(r), l = n.format(r, o), s = { num: i, text: l, date: r };
  return C(
    xe,
    { elRef: t.elRef, elTag: t.elTag, elAttrs: t.elAttrs, elClasses: t.elClasses, elStyle: t.elStyle, renderProps: s, generatorName: "weekNumberContent", customGenerator: a.weekNumberContent, defaultGenerator: vC, classNameGenerator: a.weekNumberClassNames, didMount: a.weekNumberDidMount, willUnmount: a.weekNumberWillUnmount },
    t.children
  );
});
function vC(t) {
  return t.text;
}
const oo = 10;
class _C extends Y {
  constructor() {
    super(...arguments), this.state = {
      titleId: Bn()
    }, this.handleRootEl = (e) => {
      this.rootEl = e, this.props.elRef && we(this.props.elRef, e);
    }, this.handleDocumentMouseDown = (e) => {
      const n = nc(e);
      this.rootEl.contains(n) || this.handleCloseClick();
    }, this.handleDocumentKeyDown = (e) => {
      e.key === "Escape" && this.handleCloseClick();
    }, this.handleCloseClick = () => {
      let { onClose: e } = this.props;
      e && e();
    };
  }
  render() {
    let { theme: e, options: n } = this.context, { props: a, state: r } = this, o = [
      "fc-popover",
      e.getClass("popover")
    ].concat(a.extraClassNames || []);
    return W7(C(
      "div",
      Object.assign({}, a.extraAttrs, { id: a.id, className: o.join(" "), "aria-labelledby": r.titleId, ref: this.handleRootEl }),
      C(
        "div",
        { className: "fc-popover-header " + e.getClass("popoverHeader") },
        C("span", { className: "fc-popover-title", id: r.titleId }, a.title),
        C("span", { className: "fc-popover-close " + e.getIconClass("close"), title: n.closeHint, onClick: this.handleCloseClick })
      ),
      C("div", { className: "fc-popover-body " + e.getClass("popoverContent") }, a.children)
    ), a.parentEl);
  }
  componentDidMount() {
    document.addEventListener("mousedown", this.handleDocumentMouseDown), document.addEventListener("keydown", this.handleDocumentKeyDown), this.updateSize();
  }
  componentWillUnmount() {
    document.removeEventListener("mousedown", this.handleDocumentMouseDown), document.removeEventListener("keydown", this.handleDocumentKeyDown);
  }
  updateSize() {
    let { isRtl: e } = this.context, { alignmentEl: n, alignGridTop: a } = this.props, { rootEl: r } = this, o = Hb(n);
    if (o) {
      let i = r.getBoundingClientRect(), l = a ? ae(n, ".fc-scrollgrid").getBoundingClientRect().top : o.top, s = e ? o.right - i.width : o.left;
      l = Math.max(l, oo), s = Math.min(s, document.documentElement.clientWidth - oo - i.width), s = Math.max(s, oo);
      let u = r.offsetParent.getBoundingClientRect();
      Mt(r, {
        top: l - u.top,
        left: s - u.left
      });
    }
  }
}
class wC extends at {
  constructor() {
    super(...arguments), this.handleRootEl = (e) => {
      this.rootEl = e, e ? this.context.registerInteractiveComponent(this, {
        el: e,
        useEventCenter: !1
      }) : this.context.unregisterInteractiveComponent(this);
    };
  }
  render() {
    let { options: e, dateEnv: n } = this.context, { props: a } = this, { startDate: r, todayRange: o, dateProfile: i } = a, l = n.format(r, e.dayPopoverFormat);
    return C(Uc, { elRef: this.handleRootEl, date: r, dateProfile: i, todayRange: o }, (s, u, d) => C(
      _C,
      { elRef: d.ref, id: a.id, title: l, extraClassNames: ["fc-more-popover"].concat(d.className || []), extraAttrs: d, parentEl: a.parentEl, alignmentEl: a.alignmentEl, alignGridTop: a.alignGridTop, onClose: a.onClose },
      Wc(e) && C(s, { elTag: "div", elClasses: ["fc-more-popover-misc"] }),
      a.children
    ));
  }
  queryHit(e, n, a, r) {
    let { rootEl: o, props: i } = this;
    return e >= 0 && e < a && n >= 0 && n < r ? {
      dateProfile: i.dateProfile,
      dateSpan: Object.assign({ allDay: !i.forceTimed, range: {
        start: i.startDate,
        end: i.endDate
      } }, i.extraDateSpan),
      dayEl: o,
      rect: {
        left: 0,
        top: 0,
        right: a,
        bottom: r
      },
      layer: 1
      // important when comparing with hits from other components
    } : null;
  }
}
class yC extends Y {
  constructor() {
    super(...arguments), this.state = {
      isPopoverOpen: !1,
      popoverId: Bn()
    }, this.handleLinkEl = (e) => {
      this.linkEl = e, this.props.elRef && we(this.props.elRef, e);
    }, this.handleClick = (e) => {
      let { props: n, context: a } = this, { moreLinkClick: r } = a.options, o = Rl(n).start;
      function i(l) {
        let { def: s, instance: u, range: d } = l.eventRange;
        return {
          event: new $(a, s, u),
          start: a.dateEnv.toDate(d.start),
          end: a.dateEnv.toDate(d.end),
          isStart: l.isStart,
          isEnd: l.isEnd
        };
      }
      typeof r == "function" && (r = r({
        date: o,
        allDay: !!n.allDayDate,
        allSegs: n.allSegs.map(i),
        hiddenSegs: n.hiddenSegs.map(i),
        jsEvent: e,
        view: a.viewApi
      })), !r || r === "popover" ? this.setState({ isPopoverOpen: !0 }) : typeof r == "string" && a.calendarApi.zoomTo(o, r);
    }, this.handlePopoverClose = () => {
      this.setState({ isPopoverOpen: !1 });
    };
  }
  render() {
    let { props: e, state: n } = this;
    return C(tt.Consumer, null, (a) => {
      let { viewApi: r, options: o, calendarApi: i } = a, { moreLinkText: l } = o, { moreCnt: s } = e, u = Rl(e), d = typeof l == "function" ? l.call(i, s) : `+${s} ${l}`, g = Dt(o.moreLinkHint, [s], d), v = {
        num: s,
        shortText: `+${s}`,
        text: d,
        view: r
      };
      return C(
        Z,
        null,
        !!e.moreCnt && C(xe, { elTag: e.elTag || "a", elRef: this.handleLinkEl, elClasses: [
          ...e.elClasses || [],
          "fc-more-link"
        ], elStyle: e.elStyle, elAttrs: Object.assign(Object.assign(Object.assign({}, e.elAttrs), rc(this.handleClick)), { title: g, "aria-expanded": n.isPopoverOpen, "aria-controls": n.isPopoverOpen ? n.popoverId : "" }), renderProps: v, generatorName: "moreLinkContent", customGenerator: o.moreLinkContent, defaultGenerator: e.defaultGenerator || bC, classNameGenerator: o.moreLinkClassNames, didMount: o.moreLinkDidMount, willUnmount: o.moreLinkWillUnmount }, e.children),
        n.isPopoverOpen && C(wC, { id: n.popoverId, startDate: u.start, endDate: u.end, dateProfile: e.dateProfile, todayRange: e.todayRange, extraDateSpan: e.extraDateSpan, parentEl: this.parentEl, alignmentEl: e.alignmentElRef ? e.alignmentElRef.current : this.linkEl, alignGridTop: e.alignGridTop, forceTimed: e.forceTimed, onClose: this.handlePopoverClose }, e.popoverContent())
      );
    });
  }
  componentDidMount() {
    this.updateParentEl();
  }
  componentDidUpdate() {
    this.updateParentEl();
  }
  updateParentEl() {
    this.linkEl && (this.parentEl = ae(this.linkEl, ".fc-view-harness"));
  }
}
function bC(t) {
  return t.text;
}
function Rl(t) {
  if (t.allDayDate)
    return {
      start: t.allDayDate,
      end: X(t.allDayDate, 1)
    };
  let { hiddenSegs: e } = t;
  return {
    start: CC(e),
    end: xC(e)
  };
}
function CC(t) {
  return t.reduce(AC).eventRange.range.start;
}
function AC(t, e) {
  return t.eventRange.range.start < e.eventRange.range.start ? t : e;
}
function xC(t) {
  return t.reduce(EC).eventRange.range.end;
}
function EC(t, e) {
  return t.eventRange.range.end > e.eventRange.range.end ? t : e;
}
const SC = [], Gc = {
  code: "en",
  week: {
    dow: 0,
    doy: 4
    // 4 days need to be within the year to be considered the first week
  },
  direction: "ltr",
  buttonText: {
    prev: "prev",
    next: "next",
    prevYear: "prev year",
    nextYear: "next year",
    year: "year",
    today: "today",
    month: "month",
    week: "week",
    day: "day",
    list: "list"
  },
  weekText: "W",
  weekTextLong: "Week",
  closeHint: "Close",
  timeHint: "Time",
  eventHint: "Event",
  allDayText: "all-day",
  moreLinkText: "more",
  noEventsText: "No events to display"
}, $c = Object.assign(Object.assign({}, Gc), {
  // Includes things we don't want other locales to inherit,
  // things that derive from other translatable strings.
  buttonHints: {
    prev: "Previous $0",
    next: "Next $0",
    today(t, e) {
      return e === "day" ? "Today" : `This ${t}`;
    }
  },
  viewHint: "$0 view",
  navLinkHint: "Go to $0",
  moreLinkHint(t) {
    return `Show ${t} more event${t === 1 ? "" : "s"}`;
  }
});
function MC(t) {
  let e = t.length > 0 ? t[0].code : "en", n = SC.concat(t), a = {
    en: $c
  };
  for (let r of n)
    a[r.code] = r;
  return {
    map: a,
    defaultCode: e
  };
}
function Qc(t, e) {
  return typeof t == "object" && !Array.isArray(t) ? Yc(t.code, [t.code], t) : DC(t, e);
}
function DC(t, e) {
  let n = [].concat(t || []), a = TC(n, e) || $c;
  return Yc(t, n, a);
}
function TC(t, e) {
  for (let n = 0; n < t.length; n += 1) {
    let a = t[n].toLocaleLowerCase().split("-");
    for (let r = a.length; r > 0; r -= 1) {
      let o = a.slice(0, r).join("-");
      if (e[o])
        return e[o];
    }
  }
  return null;
}
function Yc(t, e, n) {
  let a = Jo([Gc, n], ["buttonText"]);
  delete a.code;
  let { week: r } = a;
  return delete a.week, {
    codeArg: t,
    codes: e,
    week: r,
    simpleNumberFormat: new Intl.NumberFormat(t),
    options: a
  };
}
function ke(t) {
  return {
    id: Je(),
    name: t.name,
    premiumReleaseDate: t.premiumReleaseDate ? new Date(t.premiumReleaseDate) : void 0,
    deps: t.deps || [],
    reducers: t.reducers || [],
    isLoadingFuncs: t.isLoadingFuncs || [],
    contextInit: [].concat(t.contextInit || []),
    eventRefiners: t.eventRefiners || {},
    eventDefMemberAdders: t.eventDefMemberAdders || [],
    eventSourceRefiners: t.eventSourceRefiners || {},
    isDraggableTransformers: t.isDraggableTransformers || [],
    eventDragMutationMassagers: t.eventDragMutationMassagers || [],
    eventDefMutationAppliers: t.eventDefMutationAppliers || [],
    dateSelectionTransformers: t.dateSelectionTransformers || [],
    datePointTransforms: t.datePointTransforms || [],
    dateSpanTransforms: t.dateSpanTransforms || [],
    views: t.views || {},
    viewPropsTransformers: t.viewPropsTransformers || [],
    isPropsValid: t.isPropsValid || null,
    externalDefTransforms: t.externalDefTransforms || [],
    viewContainerAppends: t.viewContainerAppends || [],
    eventDropTransformers: t.eventDropTransformers || [],
    componentInteractions: t.componentInteractions || [],
    calendarInteractions: t.calendarInteractions || [],
    themeClasses: t.themeClasses || {},
    eventSourceDefs: t.eventSourceDefs || [],
    cmdFormatter: t.cmdFormatter,
    recurringTypes: t.recurringTypes || [],
    namedTimeZonedImpl: t.namedTimeZonedImpl,
    initialView: t.initialView || "",
    elementDraggingImpl: t.elementDraggingImpl,
    optionChangeHandlers: t.optionChangeHandlers || {},
    scrollGridImpl: t.scrollGridImpl || null,
    listenerRefiners: t.listenerRefiners || {},
    optionRefiners: t.optionRefiners || {},
    propSetHandlers: t.propSetHandlers || {}
  };
}
function RC(t, e) {
  let n = {}, a = {
    premiumReleaseDate: void 0,
    reducers: [],
    isLoadingFuncs: [],
    contextInit: [],
    eventRefiners: {},
    eventDefMemberAdders: [],
    eventSourceRefiners: {},
    isDraggableTransformers: [],
    eventDragMutationMassagers: [],
    eventDefMutationAppliers: [],
    dateSelectionTransformers: [],
    datePointTransforms: [],
    dateSpanTransforms: [],
    views: {},
    viewPropsTransformers: [],
    isPropsValid: null,
    externalDefTransforms: [],
    viewContainerAppends: [],
    eventDropTransformers: [],
    componentInteractions: [],
    calendarInteractions: [],
    themeClasses: {},
    eventSourceDefs: [],
    cmdFormatter: null,
    recurringTypes: [],
    namedTimeZonedImpl: null,
    initialView: "",
    elementDraggingImpl: null,
    optionChangeHandlers: {},
    scrollGridImpl: null,
    listenerRefiners: {},
    optionRefiners: {},
    propSetHandlers: {}
  };
  function r(o) {
    for (let i of o) {
      const l = i.name, s = n[l];
      s === void 0 ? (n[l] = i.id, r(i.deps), a = IC(a, i)) : s !== i.id && console.warn(`Duplicate plugin '${l}'`);
    }
  }
  return t && r(t), r(e), a;
}
function HC() {
  let t = [], e = [], n;
  return (a, r) => ((!n || !He(a, t) || !He(r, e)) && (n = RC(a, r)), t = a, e = r, n);
}
function IC(t, e) {
  return {
    premiumReleaseDate: kC(t.premiumReleaseDate, e.premiumReleaseDate),
    reducers: t.reducers.concat(e.reducers),
    isLoadingFuncs: t.isLoadingFuncs.concat(e.isLoadingFuncs),
    contextInit: t.contextInit.concat(e.contextInit),
    eventRefiners: Object.assign(Object.assign({}, t.eventRefiners), e.eventRefiners),
    eventDefMemberAdders: t.eventDefMemberAdders.concat(e.eventDefMemberAdders),
    eventSourceRefiners: Object.assign(Object.assign({}, t.eventSourceRefiners), e.eventSourceRefiners),
    isDraggableTransformers: t.isDraggableTransformers.concat(e.isDraggableTransformers),
    eventDragMutationMassagers: t.eventDragMutationMassagers.concat(e.eventDragMutationMassagers),
    eventDefMutationAppliers: t.eventDefMutationAppliers.concat(e.eventDefMutationAppliers),
    dateSelectionTransformers: t.dateSelectionTransformers.concat(e.dateSelectionTransformers),
    datePointTransforms: t.datePointTransforms.concat(e.datePointTransforms),
    dateSpanTransforms: t.dateSpanTransforms.concat(e.dateSpanTransforms),
    views: Object.assign(Object.assign({}, t.views), e.views),
    viewPropsTransformers: t.viewPropsTransformers.concat(e.viewPropsTransformers),
    isPropsValid: e.isPropsValid || t.isPropsValid,
    externalDefTransforms: t.externalDefTransforms.concat(e.externalDefTransforms),
    viewContainerAppends: t.viewContainerAppends.concat(e.viewContainerAppends),
    eventDropTransformers: t.eventDropTransformers.concat(e.eventDropTransformers),
    calendarInteractions: t.calendarInteractions.concat(e.calendarInteractions),
    componentInteractions: t.componentInteractions.concat(e.componentInteractions),
    themeClasses: Object.assign(Object.assign({}, t.themeClasses), e.themeClasses),
    eventSourceDefs: t.eventSourceDefs.concat(e.eventSourceDefs),
    cmdFormatter: e.cmdFormatter || t.cmdFormatter,
    recurringTypes: t.recurringTypes.concat(e.recurringTypes),
    namedTimeZonedImpl: e.namedTimeZonedImpl || t.namedTimeZonedImpl,
    initialView: t.initialView || e.initialView,
    elementDraggingImpl: t.elementDraggingImpl || e.elementDraggingImpl,
    optionChangeHandlers: Object.assign(Object.assign({}, t.optionChangeHandlers), e.optionChangeHandlers),
    scrollGridImpl: e.scrollGridImpl || t.scrollGridImpl,
    listenerRefiners: Object.assign(Object.assign({}, t.listenerRefiners), e.listenerRefiners),
    optionRefiners: Object.assign(Object.assign({}, t.optionRefiners), e.optionRefiners),
    propSetHandlers: Object.assign(Object.assign({}, t.propSetHandlers), e.propSetHandlers)
  };
}
function kC(t, e) {
  return t === void 0 ? e : e === void 0 ? t : new Date(Math.max(t.valueOf(), e.valueOf()));
}
class ze extends jt {
}
ze.prototype.classes = {
  root: "fc-theme-standard",
  tableCellShaded: "fc-cell-shaded",
  buttonGroup: "fc-button-group",
  button: "fc-button fc-button-primary",
  buttonActive: "fc-button-active"
};
ze.prototype.baseIconClass = "fc-icon";
ze.prototype.iconClasses = {
  close: "fc-icon-x",
  prev: "fc-icon-chevron-left",
  next: "fc-icon-chevron-right",
  prevYear: "fc-icon-chevrons-left",
  nextYear: "fc-icon-chevrons-right"
};
ze.prototype.rtlIconClasses = {
  prev: "fc-icon-chevron-right",
  next: "fc-icon-chevron-left",
  prevYear: "fc-icon-chevrons-right",
  nextYear: "fc-icon-chevrons-left"
};
ze.prototype.iconOverrideOption = "buttonIcons";
ze.prototype.iconOverrideCustomButtonOption = "icon";
ze.prototype.iconOverridePrefix = "fc-icon-";
function zC(t, e) {
  let n = {}, a;
  for (a in t)
    bo(a, n, t, e);
  for (a in e)
    bo(a, n, t, e);
  return n;
}
function bo(t, e, n, a) {
  if (e[t])
    return e[t];
  let r = VC(t, e, n, a);
  return r && (e[t] = r), r;
}
function VC(t, e, n, a) {
  let r = n[t], o = a[t], i = (d) => r && r[d] !== null ? r[d] : o && o[d] !== null ? o[d] : null, l = i("component"), s = i("superType"), u = null;
  if (s) {
    if (s === t)
      throw new Error("Can't have a custom view type that references itself");
    u = bo(s, e, n, a);
  }
  return !l && u && (l = u.component), l ? {
    type: t,
    component: l,
    defaults: Object.assign(Object.assign({}, u ? u.defaults : {}), r ? r.rawOptions : {}),
    overrides: Object.assign(Object.assign({}, u ? u.overrides : {}), o ? o.rawOptions : {})
  } : null;
}
function Hl(t) {
  return et(t, OC);
}
function OC(t) {
  let e = typeof t == "function" ? { component: t } : t, { component: n } = e;
  return e.content ? n = Il(e) : n && !(n.prototype instanceof Y) && (n = Il(Object.assign(Object.assign({}, e), { content: n }))), {
    superType: e.type,
    component: n,
    rawOptions: e
    // includes type and component too :(
  };
}
function Il(t) {
  return (e) => C(tt.Consumer, null, (n) => C(xe, { elTag: "div", elClasses: mc(n.viewSpec), renderProps: Object.assign(Object.assign({}, e), { nextDayThreshold: n.options.nextDayThreshold }), generatorName: void 0, customGenerator: t.content, classNameGenerator: t.classNames, didMount: t.didMount, willUnmount: t.willUnmount }));
}
function BC(t, e, n, a) {
  let r = Hl(t), o = Hl(e.views), i = zC(r, o);
  return et(i, (l) => LC(l, o, e, n, a));
}
function LC(t, e, n, a, r) {
  let o = t.overrides.duration || t.defaults.duration || a.duration || n.duration, i = null, l = "", s = "", u = {};
  if (o && (i = NC(o), i)) {
    let v = po(i);
    l = v.unit, v.value === 1 && (s = l, u = e[l] ? e[l].rawOptions : {});
  }
  let d = (v) => {
    let p = v.buttonText || {}, w = t.defaults.buttonTextKey;
    return w != null && p[w] != null ? p[w] : p[t.type] != null ? p[t.type] : p[s] != null ? p[s] : null;
  }, g = (v) => {
    let p = v.buttonHints || {}, w = t.defaults.buttonTextKey;
    return w != null && p[w] != null ? p[w] : p[t.type] != null ? p[t.type] : p[s] != null ? p[s] : null;
  };
  return {
    type: t.type,
    component: t.component,
    duration: i,
    durationUnit: l,
    singleUnit: s,
    optionDefaults: t.defaults,
    optionOverrides: Object.assign(Object.assign({}, u), t.overrides),
    buttonTextOverride: d(a) || d(n) || // constructor-specified buttonText lookup hash takes precedence
    t.overrides.buttonText,
    buttonTextDefault: d(r) || t.defaults.buttonText || d(Tt) || t.type,
    // not DRY
    buttonTitleOverride: g(a) || g(n) || t.overrides.buttonHint,
    buttonTitleDefault: g(r) || t.defaults.buttonHint || g(Tt)
    // will eventually fall back to buttonText
  };
}
let kl = {};
function NC(t) {
  let e = JSON.stringify(t), n = kl[e];
  return n === void 0 && (n = L(t), kl[e] = n), n;
}
function PC(t, e) {
  switch (e.type) {
    case "CHANGE_VIEW_TYPE":
      t = e.viewType;
  }
  return t;
}
function jC(t, e) {
  switch (e.type) {
    case "CHANGE_DATE":
      return e.dateMarker;
    default:
      return t;
  }
}
function qC(t, e, n) {
  let a = t.initialDate;
  return a != null ? e.createMarker(a) : n.getDateMarker();
}
function FC(t, e) {
  switch (e.type) {
    case "SET_OPTION":
      return Object.assign(Object.assign({}, t), { [e.optionName]: e.rawOptionValue });
    default:
      return t;
  }
}
function UC(t, e, n, a) {
  let r;
  switch (e.type) {
    case "CHANGE_VIEW_TYPE":
      return a.build(e.dateMarker || n);
    case "CHANGE_DATE":
      return a.build(e.dateMarker);
    case "PREV":
      if (r = a.buildPrev(t, n), r.isValid)
        return r;
      break;
    case "NEXT":
      if (r = a.buildNext(t, n), r.isValid)
        return r;
      break;
  }
  return t;
}
function WC(t, e, n) {
  let a = e ? e.activeRange : null;
  return Kc({}, XC(t, n), a, n);
}
function GC(t, e, n, a) {
  let r = n ? n.activeRange : null;
  switch (e.type) {
    case "ADD_EVENT_SOURCES":
      return Kc(t, e.sources, r, a);
    case "REMOVE_EVENT_SOURCE":
      return QC(t, e.sourceId);
    case "PREV":
    // TODO: how do we track all actions that affect dateProfile :(
    case "NEXT":
    case "CHANGE_DATE":
    case "CHANGE_VIEW_TYPE":
      return n ? Xc(t, r, a) : t;
    case "FETCH_EVENT_SOURCES":
      return p2(t, e.sourceIds ? (
        // why no type?
        lc(e.sourceIds)
      ) : Jc(t, a), r, e.isRefetch || !1, a);
    case "RECEIVE_EVENTS":
    case "RECEIVE_EVENT_ERROR":
      return KC(t, e.sourceId, e.fetchId, e.fetchRange);
    case "REMOVE_ALL_EVENT_SOURCES":
      return {};
    default:
      return t;
  }
}
function $C(t, e, n) {
  let a = e ? e.activeRange : null;
  return p2(t, Jc(t, n), a, !0, n);
}
function Zc(t) {
  for (let e in t)
    if (t[e].isFetching)
      return !0;
  return !1;
}
function Kc(t, e, n, a) {
  let r = {};
  for (let o of e)
    r[o.sourceId] = o;
  return n && (r = Xc(r, n, a)), Object.assign(Object.assign({}, t), r);
}
function QC(t, e) {
  return Ge(t, (n) => n.sourceId !== e);
}
function Xc(t, e, n) {
  return p2(t, Ge(t, (a) => YC(a, e, n)), e, !1, n);
}
function YC(t, e, n) {
  return e1(t, n) ? !n.options.lazyFetching || !t.fetchRange || t.isFetching || // always cancel outdated in-progress fetches
  e.start < t.fetchRange.start || e.end > t.fetchRange.end : !t.latestFetchId;
}
function p2(t, e, n, a, r) {
  let o = {};
  for (let i in t) {
    let l = t[i];
    e[i] ? o[i] = ZC(l, n, a, r) : o[i] = l;
  }
  return o;
}
function ZC(t, e, n, a) {
  let { options: r, calendarApi: o } = a, i = a.pluginHooks.eventSourceDefs[t.sourceDefId], l = Je();
  return i.fetch({
    eventSource: t,
    range: e,
    isRefetch: n,
    context: a
  }, (s) => {
    let { rawEvents: u } = s;
    r.eventSourceSuccess && (u = r.eventSourceSuccess.call(o, u, s.response) || u), t.success && (u = t.success.call(o, u, s.response) || u), a.dispatch({
      type: "RECEIVE_EVENTS",
      sourceId: t.sourceId,
      fetchId: l,
      fetchRange: e,
      rawEvents: u
    });
  }, (s) => {
    let u = !1;
    r.eventSourceFailure && (r.eventSourceFailure.call(o, s), u = !0), t.failure && (t.failure(s), u = !0), u || console.warn(s.message, s), a.dispatch({
      type: "RECEIVE_EVENT_ERROR",
      sourceId: t.sourceId,
      fetchId: l,
      fetchRange: e,
      error: s
    });
  }), Object.assign(Object.assign({}, t), { isFetching: !0, latestFetchId: l });
}
function KC(t, e, n, a) {
  let r = t[e];
  return r && // not already removed
  n === r.latestFetchId ? Object.assign(Object.assign({}, t), { [e]: Object.assign(Object.assign({}, r), { isFetching: !1, fetchRange: a }) }) : t;
}
function Jc(t, e) {
  return Ge(t, (n) => e1(n, e));
}
function XC(t, e) {
  let n = yc(e), a = [].concat(t.eventSources || []), r = [];
  t.initialEvents && a.unshift(t.initialEvents), t.events && a.unshift(t.events);
  for (let o of a) {
    let i = wc(o, e, n);
    i && r.push(i);
  }
  return r;
}
function e1(t, e) {
  return !e.pluginHooks.eventSourceDefs[t.sourceDefId].ignoreRange;
}
function JC(t, e) {
  switch (e.type) {
    case "UNSELECT_DATES":
      return null;
    case "SELECT_DATES":
      return e.selection;
    default:
      return t;
  }
}
function eA(t, e) {
  switch (e.type) {
    case "UNSELECT_EVENT":
      return "";
    case "SELECT_EVENT":
      return e.eventInstanceId;
    default:
      return t;
  }
}
function tA(t, e) {
  let n;
  switch (e.type) {
    case "UNSET_EVENT_DRAG":
      return null;
    case "SET_EVENT_DRAG":
      return n = e.state, {
        affectedEvents: n.affectedEvents,
        mutatedEvents: n.mutatedEvents,
        isEvent: n.isEvent
      };
    default:
      return t;
  }
}
function nA(t, e) {
  let n;
  switch (e.type) {
    case "UNSET_EVENT_RESIZE":
      return null;
    case "SET_EVENT_RESIZE":
      return n = e.state, {
        affectedEvents: n.affectedEvents,
        mutatedEvents: n.mutatedEvents,
        isEvent: n.isEvent
      };
    default:
      return t;
  }
}
function aA(t, e, n, a, r) {
  let o = t.headerToolbar ? zl(t.headerToolbar, t, e, n, a, r) : null, i = t.footerToolbar ? zl(t.footerToolbar, t, e, n, a, r) : null;
  return { header: o, footer: i };
}
function zl(t, e, n, a, r, o) {
  let i = {}, l = [], s = !1;
  for (let u in t) {
    let d = t[u], g = rA(d, e, n, a, r, o);
    i[u] = g.widgets, l.push(...g.viewsWithButtons), s = s || g.hasTitle;
  }
  return { sectionWidgets: i, viewsWithButtons: l, hasTitle: s };
}
function rA(t, e, n, a, r, o) {
  let i = e.direction === "rtl", l = e.customButtons || {}, s = n.buttonText || {}, u = e.buttonText || {}, d = n.buttonHints || {}, g = e.buttonHints || {}, v = t ? t.split(" ") : [], p = [], w = !1;
  return { widgets: v.map((y) => y.split(",").map((A) => {
    if (A === "title")
      return w = !0, { buttonName: A };
    let E, S, M, P, z, T;
    if (E = l[A])
      M = (R) => {
        E.click && E.click.call(R.target, R, R.target);
      }, (P = a.getCustomButtonIconClass(E)) || (P = a.getIconClass(A, i)) || (z = E.text), T = E.hint || E.text;
    else if (S = r[A]) {
      p.push(A), M = () => {
        o.changeView(A);
      }, (z = S.buttonTextOverride) || (P = a.getIconClass(A, i)) || (z = S.buttonTextDefault);
      let R = S.buttonTextOverride || S.buttonTextDefault;
      T = Dt(
        S.buttonTitleOverride || S.buttonTitleDefault || e.viewHint,
        [R, A],
        // view-name = buttonName
        R
      );
    } else if (o[A])
      if (M = () => {
        o[A]();
      }, (z = s[A]) || (P = a.getIconClass(A, i)) || (z = u[A]), A === "prevYear" || A === "nextYear") {
        let R = A === "prevYear" ? "prev" : "next";
        T = Dt(d[R] || g[R], [
          u.year || "year",
          "year"
        ], u[A]);
      } else
        T = (R) => Dt(d[A] || g[A], [
          u[R] || R,
          R
        ], u[A]);
    return { buttonName: A, buttonClick: M, buttonIcon: P, buttonText: z, buttonHint: T };
  })), viewsWithButtons: p, hasTitle: w };
}
class oA {
  constructor(e, n, a) {
    this.type = e, this.getCurrentData = n, this.dateEnv = a;
  }
  get calendar() {
    return this.getCurrentData().calendarApi;
  }
  get title() {
    return this.getCurrentData().viewTitle;
  }
  get activeStart() {
    return this.dateEnv.toDate(this.getCurrentData().dateProfile.activeRange.start);
  }
  get activeEnd() {
    return this.dateEnv.toDate(this.getCurrentData().dateProfile.activeRange.end);
  }
  get currentStart() {
    return this.dateEnv.toDate(this.getCurrentData().dateProfile.currentRange.start);
  }
  get currentEnd() {
    return this.dateEnv.toDate(this.getCurrentData().dateProfile.currentRange.end);
  }
  getOption(e) {
    return this.getCurrentData().options[e];
  }
}
let iA = {
  ignoreRange: !0,
  parseMeta(t) {
    return Array.isArray(t.events) ? t.events : null;
  },
  fetch(t, e) {
    e({
      rawEvents: t.eventSource.meta
    });
  }
};
const lA = ke({
  name: "array-event-source",
  eventSourceDefs: [iA]
});
let sA = {
  parseMeta(t) {
    return typeof t.events == "function" ? t.events : null;
  },
  fetch(t, e, n) {
    const { dateEnv: a } = t.context, r = t.eventSource.meta;
    mb(r.bind(null, Dc(t.range, a)), (o) => e({ rawEvents: o }), n);
  }
};
const cA = ke({
  name: "func-event-source",
  eventSourceDefs: [sA]
}), dA = {
  method: String,
  extraParams: b,
  startParam: String,
  endParam: String,
  timeZoneParam: String
};
let uA = {
  parseMeta(t) {
    return t.url && (t.format === "json" || !t.format) ? {
      url: t.url,
      format: "json",
      method: (t.method || "GET").toUpperCase(),
      extraParams: t.extraParams,
      startParam: t.startParam,
      endParam: t.endParam,
      timeZoneParam: t.timeZoneParam
    } : null;
  },
  fetch(t, e, n) {
    const { meta: a } = t.eventSource, r = hA(a, t.range, t.context);
    hb(a.method, a.url, r).then(([o, i]) => {
      e({ rawEvents: o, response: i });
    }, n);
  }
};
const mA = ke({
  name: "json-event-source",
  eventSourceRefiners: dA,
  eventSourceDefs: [uA]
});
function hA(t, e, n) {
  let { dateEnv: a, options: r } = n, o, i, l, s, u = {};
  return o = t.startParam, o == null && (o = r.startParam), i = t.endParam, i == null && (i = r.endParam), l = t.timeZoneParam, l == null && (l = r.timeZoneParam), typeof t.extraParams == "function" ? s = t.extraParams() : s = t.extraParams || {}, Object.assign(u, s), u[o] = a.formatIso(e.start), u[i] = a.formatIso(e.end), a.timeZone !== "local" && (u[l] = a.timeZone), u;
}
const fA = {
  daysOfWeek: b,
  startTime: L,
  endTime: L,
  duration: L,
  startRecur: b,
  endRecur: b
};
let pA = {
  parse(t, e) {
    if (t.daysOfWeek || t.startTime || t.endTime || t.startRecur || t.endRecur) {
      let n = {
        daysOfWeek: t.daysOfWeek || null,
        startTime: t.startTime || null,
        endTime: t.endTime || null,
        startRecur: t.startRecur ? e.createMarker(t.startRecur) : null,
        endRecur: t.endRecur ? e.createMarker(t.endRecur) : null,
        dateEnv: e
      }, a;
      return t.duration && (a = t.duration), !a && t.startTime && t.endTime && (a = Aw(t.endTime, t.startTime)), {
        allDayGuess: !t.startTime && !t.endTime,
        duration: a,
        typeData: n
        // doesn't need endTime anymore but oh well
      };
    }
    return null;
  },
  expand(t, e, n) {
    let a = gt(e, { start: t.startRecur, end: t.endRecur });
    return a ? vA(t.daysOfWeek, t.startTime, t.dateEnv, n, a) : [];
  }
};
const gA = ke({
  name: "simple-recurring-event",
  recurringTypes: [pA],
  eventRefiners: fA
});
function vA(t, e, n, a, r) {
  let o = t ? lc(t) : null, i = G(r.start), l = r.end, s = [];
  for (e && (e.milliseconds < 0 ? l = X(l, 1) : e.milliseconds >= 1e3 * 60 * 60 * 24 && (i = X(i, -1))); i < l; ) {
    let u;
    (!o || o[i.getUTCDay()]) && (e ? u = a.add(i, e) : u = i, s.push(a.createMarker(n.toDate(u)))), i = X(i, 1);
  }
  return s;
}
const _A = ke({
  name: "change-handler",
  optionChangeHandlers: {
    events(t, e) {
      Vl([t], e);
    },
    eventSources: Vl
  }
});
function Vl(t, e) {
  let n = e2(e.getCurrentData().eventSources);
  if (n.length === 1 && t.length === 1 && Array.isArray(n[0]._raw) && Array.isArray(t[0])) {
    e.dispatch({
      type: "RESET_RAW_EVENTS",
      sourceId: n[0].sourceId,
      rawEvents: t[0]
    });
    return;
  }
  let a = [];
  for (let r of t) {
    let o = !1;
    for (let i = 0; i < n.length; i += 1)
      if (n[i]._raw === r) {
        n.splice(i, 1), o = !0;
        break;
      }
    o || a.push(r);
  }
  for (let r of n)
    e.dispatch({
      type: "REMOVE_EVENT_SOURCE",
      sourceId: r.sourceId
    });
  for (let r of a)
    e.calendarApi.addEventSource(r);
}
function wA(t, e) {
  e.emitter.trigger("datesSet", Object.assign(Object.assign({}, Dc(t.activeRange, e.dateEnv)), { view: e.viewApi }));
}
function yA(t, e) {
  let { emitter: n } = e;
  n.hasHandlers("eventsSet") && n.trigger("eventsSet", qe(t, e));
}
const bA = [
  lA,
  cA,
  mA,
  gA,
  _A,
  ke({
    name: "misc",
    isLoadingFuncs: [
      (t) => Zc(t.eventSources)
    ],
    propSetHandlers: {
      dateProfile: wA,
      eventStore: yA
    }
  })
];
class CA {
  constructor(e, n) {
    this.runTaskOption = e, this.drainedOption = n, this.queue = [], this.delayedRunner = new Go(this.drain.bind(this));
  }
  request(e, n) {
    this.queue.push(e), this.delayedRunner.request(n);
  }
  pause(e) {
    this.delayedRunner.pause(e);
  }
  resume(e, n) {
    this.delayedRunner.resume(e, n);
  }
  drain() {
    let { queue: e } = this;
    for (; e.length; ) {
      let n = [], a;
      for (; a = e.shift(); )
        this.runTask(a), n.push(a);
      this.drained(n);
    }
  }
  runTask(e) {
    this.runTaskOption && this.runTaskOption(e);
  }
  drained(e) {
    this.drainedOption && this.drainedOption(e);
  }
}
function AA(t, e, n) {
  let a;
  return /^(year|month)$/.test(t.currentRangeUnit) ? a = t.currentRange : a = t.activeRange, n.formatRange(a.start, a.end, K(e.titleFormat || xA(t)), {
    isEndExclusive: t.isRangeAllDay,
    defaultSeparator: e.titleRangeSeparator
  });
}
function xA(t) {
  let { currentRangeUnit: e } = t;
  if (e === "year")
    return { year: "numeric" };
  if (e === "month")
    return { year: "numeric", month: "long" };
  let n = _n(t.currentRange.start, t.currentRange.end);
  return n !== null && n > 1 ? { year: "numeric", month: "short", day: "numeric" } : { year: "numeric", month: "long", day: "numeric" };
}
class Ol {
  constructor() {
    this.resetListeners = /* @__PURE__ */ new Set();
  }
  handleInput(e, n) {
    const a = this.dateEnv;
    if (e !== a && (typeof n == "function" ? this.nowFn = n : a || (this.nowAnchorDate = e.toDate(n ? e.createMarker(n) : e.createNowMarker()), this.nowAnchorQueried = Date.now()), this.dateEnv = e, a))
      for (const r of this.resetListeners.values())
        r();
  }
  getDateMarker() {
    return this.nowAnchorDate ? this.dateEnv.timestampToMarker(this.nowAnchorDate.valueOf() + (Date.now() - this.nowAnchorQueried)) : this.dateEnv.createMarker(this.nowFn());
  }
  addResetListener(e) {
    this.resetListeners.add(e);
  }
  removeResetListener(e) {
    this.resetListeners.delete(e);
  }
}
class EA {
  constructor(e) {
    this.computeCurrentViewData = O(this._computeCurrentViewData), this.organizeRawLocales = O(MC), this.buildLocale = O(Qc), this.buildPluginHooks = HC(), this.buildDateEnv = O(SA), this.buildTheme = O(MA), this.parseToolbars = O(aA), this.buildViewSpecs = O(BC), this.buildDateProfileGenerator = sn(DA), this.buildViewApi = O(TA), this.buildViewUiProps = sn(IA), this.buildEventUiBySource = O(RA, pe), this.buildEventUiBases = O(HA), this.parseContextBusinessHours = sn(kA), this.buildTitle = O(AA), this.nowManager = new Ol(), this.emitter = new jn(), this.actionRunner = new CA(this._handleAction.bind(this), this.updateData.bind(this)), this.currentCalendarOptionsInput = {}, this.currentCalendarOptionsRefined = {}, this.currentViewOptionsInput = {}, this.currentViewOptionsRefined = {}, this.currentCalendarOptionsRefiners = {}, this.optionsForRefining = [], this.optionsForHandling = [], this.getCurrentData = () => this.data, this.dispatch = (v) => {
      this.actionRunner.request(v);
    }, this.props = e, this.actionRunner.pause(), this.nowManager = new Ol();
    let n = {}, a = this.computeOptionsData(e.optionOverrides, n, e.calendarApi), r = a.calendarOptions.initialView || a.pluginHooks.initialView, o = this.computeCurrentViewData(r, a, e.optionOverrides, n);
    e.calendarApi.currentDataManager = this, this.emitter.setThisContext(e.calendarApi), this.emitter.setOptions(o.options);
    let i = {
      nowManager: this.nowManager,
      dateEnv: a.dateEnv,
      options: a.calendarOptions,
      pluginHooks: a.pluginHooks,
      calendarApi: e.calendarApi,
      dispatch: this.dispatch,
      emitter: this.emitter,
      getCurrentData: this.getCurrentData
    }, l = qC(a.calendarOptions, a.dateEnv, this.nowManager), s = o.dateProfileGenerator.build(l);
    Re(s.activeRange, l) || (l = s.currentRange.start);
    for (let v of a.pluginHooks.contextInit)
      v(i);
    let u = WC(a.calendarOptions, s, i), d = {
      dynamicOptionOverrides: n,
      currentViewType: r,
      currentDate: l,
      dateProfile: s,
      businessHours: this.parseContextBusinessHours(i),
      eventSources: u,
      eventUiBases: {},
      eventStore: fe(),
      renderableEventStore: fe(),
      dateSelection: null,
      eventSelection: "",
      eventDrag: null,
      eventResize: null,
      selectionConfig: this.buildViewUiProps(i).selectionConfig
    }, g = Object.assign(Object.assign({}, i), d);
    for (let v of a.pluginHooks.reducers)
      Object.assign(d, v(null, null, g));
    io(d, i) && this.emitter.trigger("loading", !0), this.state = d, this.updateData(), this.actionRunner.resume();
  }
  resetOptions(e, n) {
    let { props: a } = this;
    n === void 0 ? a.optionOverrides = e : (a.optionOverrides = Object.assign(Object.assign({}, a.optionOverrides || {}), e), this.optionsForRefining.push(...n)), (n === void 0 || n.length) && this.actionRunner.request({
      type: "NOTHING"
    });
  }
  _handleAction(e) {
    let { props: n, state: a, emitter: r } = this, o = FC(a.dynamicOptionOverrides, e), i = this.computeOptionsData(n.optionOverrides, o, n.calendarApi), l = PC(a.currentViewType, e), s = this.computeCurrentViewData(l, i, n.optionOverrides, o);
    n.calendarApi.currentDataManager = this, r.setThisContext(n.calendarApi), r.setOptions(s.options);
    let u = {
      nowManager: this.nowManager,
      dateEnv: i.dateEnv,
      options: i.calendarOptions,
      pluginHooks: i.pluginHooks,
      calendarApi: n.calendarApi,
      dispatch: this.dispatch,
      emitter: r,
      getCurrentData: this.getCurrentData
    }, { currentDate: d, dateProfile: g } = a;
    this.data && this.data.dateProfileGenerator !== s.dateProfileGenerator && (g = s.dateProfileGenerator.build(d)), d = jC(d, e), g = UC(g, e, d, s.dateProfileGenerator), (e.type === "PREV" || // TODO: move this logic into DateProfileGenerator
    e.type === "NEXT" || // "
    !Re(g.currentRange, d)) && (d = g.currentRange.start);
    let v = GC(a.eventSources, e, g, u), p = Ly(a.eventStore, e, v, g, u), _ = Zc(v) && !s.options.progressiveEventRendering && a.renderableEventStore || p, { eventUiSingleBase: y, selectionConfig: A } = this.buildViewUiProps(u), E = this.buildEventUiBySource(v), S = this.buildEventUiBases(_.defs, y, E), M = {
      dynamicOptionOverrides: o,
      currentViewType: l,
      currentDate: d,
      dateProfile: g,
      eventSources: v,
      eventStore: p,
      renderableEventStore: _,
      selectionConfig: A,
      eventUiBases: S,
      businessHours: this.parseContextBusinessHours(u),
      dateSelection: JC(a.dateSelection, e),
      eventSelection: eA(a.eventSelection, e),
      eventDrag: tA(a.eventDrag, e),
      eventResize: nA(a.eventResize, e)
    }, P = Object.assign(Object.assign({}, u), M);
    for (let R of i.pluginHooks.reducers)
      Object.assign(M, R(a, e, P));
    let z = io(a, u), T = io(M, u);
    !z && T ? r.trigger("loading", !0) : z && !T && r.trigger("loading", !1), this.state = M, n.onAction && n.onAction(e);
  }
  updateData() {
    let { props: e, state: n } = this, a = this.data, r = this.computeOptionsData(e.optionOverrides, n.dynamicOptionOverrides, e.calendarApi), o = this.computeCurrentViewData(n.currentViewType, r, e.optionOverrides, n.dynamicOptionOverrides), i = this.data = Object.assign(Object.assign(Object.assign({ nowManager: this.nowManager, viewTitle: this.buildTitle(n.dateProfile, o.options, r.dateEnv), calendarApi: e.calendarApi, dispatch: this.dispatch, emitter: this.emitter, getCurrentData: this.getCurrentData }, r), o), n), l = r.pluginHooks.optionChangeHandlers, s = a && a.calendarOptions, u = r.calendarOptions;
    if (s && s !== u) {
      s.timeZone !== u.timeZone && (n.eventSources = i.eventSources = $C(i.eventSources, n.dateProfile, i), n.eventStore = i.eventStore = Cl(i.eventStore, a.dateEnv, i.dateEnv), n.renderableEventStore = i.renderableEventStore = Cl(i.renderableEventStore, a.dateEnv, i.dateEnv));
      for (let d in l)
        (this.optionsForHandling.indexOf(d) !== -1 || s[d] !== u[d]) && l[d](u[d], i);
    }
    this.optionsForHandling = [], e.onData && e.onData(i);
  }
  computeOptionsData(e, n, a) {
    if (!this.optionsForRefining.length && e === this.stableOptionOverrides && n === this.stableDynamicOptionOverrides)
      return this.stableCalendarOptionsData;
    let { refinedOptions: r, pluginHooks: o, localeDefaults: i, availableLocaleData: l, extra: s } = this.processRawCalendarOptions(e, n);
    Bl(s);
    let u = this.buildDateEnv(r.timeZone, r.locale, r.weekNumberCalculation, r.firstDay, r.weekText, o, l, r.defaultRangeSeparator), d = this.buildViewSpecs(o.views, this.stableOptionOverrides, this.stableDynamicOptionOverrides, i), g = this.buildTheme(r, o), v = this.parseToolbars(r, this.stableOptionOverrides, g, d, a);
    return this.stableCalendarOptionsData = {
      calendarOptions: r,
      pluginHooks: o,
      dateEnv: u,
      viewSpecs: d,
      theme: g,
      toolbarConfig: v,
      localeDefaults: i,
      availableRawLocales: l.map
    };
  }
  // always called from behind a memoizer
  processRawCalendarOptions(e, n) {
    let { locales: a, locale: r } = Xr([
      Tt,
      e,
      n
    ]), o = this.organizeRawLocales(a), i = o.map, l = this.buildLocale(r || o.defaultCode, i).options, s = this.buildPluginHooks(e.plugins || [], bA), u = this.currentCalendarOptionsRefiners = Object.assign(Object.assign(Object.assign(Object.assign(Object.assign({}, pl), gl), vl), s.listenerRefiners), s.optionRefiners), d = {}, g = Xr([
      Tt,
      l,
      e,
      n
    ]), v = {}, p = this.currentCalendarOptionsInput, w = this.currentCalendarOptionsRefined, _ = !1;
    for (let y in g)
      this.optionsForRefining.indexOf(y) === -1 && (g[y] === p[y] || Le[y] && y in p && Le[y](p[y], g[y])) ? v[y] = w[y] : u[y] ? (v[y] = u[y](g[y]), _ = !0) : d[y] = p[y];
    return _ && (this.currentCalendarOptionsInput = g, this.currentCalendarOptionsRefined = v, this.stableOptionOverrides = e, this.stableDynamicOptionOverrides = n), this.optionsForHandling.push(...this.optionsForRefining), this.optionsForRefining = [], {
      rawOptions: this.currentCalendarOptionsInput,
      refinedOptions: this.currentCalendarOptionsRefined,
      pluginHooks: s,
      availableLocaleData: o,
      localeDefaults: l,
      extra: d
    };
  }
  _computeCurrentViewData(e, n, a, r) {
    let o = n.viewSpecs[e];
    if (!o)
      throw new Error(`viewType "${e}" is not available. Please make sure you've loaded all neccessary plugins`);
    let { refinedOptions: i, extra: l } = this.processRawViewOptions(o, n.pluginHooks, n.localeDefaults, a, r);
    Bl(l), this.nowManager.handleInput(n.dateEnv, i.now);
    let s = this.buildDateProfileGenerator({
      dateProfileGeneratorClass: o.optionDefaults.dateProfileGeneratorClass,
      nowManager: this.nowManager,
      duration: o.duration,
      durationUnit: o.durationUnit,
      usesMinMaxTime: o.optionDefaults.usesMinMaxTime,
      dateEnv: n.dateEnv,
      calendarApi: this.props.calendarApi,
      slotMinTime: i.slotMinTime,
      slotMaxTime: i.slotMaxTime,
      showNonCurrentDates: i.showNonCurrentDates,
      dayCount: i.dayCount,
      dateAlignment: i.dateAlignment,
      dateIncrement: i.dateIncrement,
      hiddenDays: i.hiddenDays,
      weekends: i.weekends,
      validRangeInput: i.validRange,
      visibleRangeInput: i.visibleRange,
      fixedWeekCount: i.fixedWeekCount
    }), u = this.buildViewApi(e, this.getCurrentData, n.dateEnv);
    return { viewSpec: o, options: i, dateProfileGenerator: s, viewApi: u };
  }
  processRawViewOptions(e, n, a, r, o) {
    let i = Xr([
      Tt,
      e.optionDefaults,
      a,
      r,
      e.optionOverrides,
      o
    ]), l = Object.assign(Object.assign(Object.assign(Object.assign(Object.assign(Object.assign({}, pl), gl), vl), ty), n.listenerRefiners), n.optionRefiners), s = {}, u = this.currentViewOptionsInput, d = this.currentViewOptionsRefined, g = !1, v = {};
    for (let p in i)
      i[p] === u[p] || Le[p] && Le[p](i[p], u[p]) ? s[p] = d[p] : (i[p] === this.currentCalendarOptionsInput[p] || Le[p] && Le[p](i[p], this.currentCalendarOptionsInput[p]) ? p in this.currentCalendarOptionsRefined && (s[p] = this.currentCalendarOptionsRefined[p]) : l[p] ? s[p] = l[p](i[p]) : v[p] = i[p], g = !0);
    return g && (this.currentViewOptionsInput = i, this.currentViewOptionsRefined = s), {
      rawOptions: this.currentViewOptionsInput,
      refinedOptions: this.currentViewOptionsRefined,
      extra: v
    };
  }
}
function SA(t, e, n, a, r, o, i, l) {
  let s = Qc(e || i.defaultCode, i.map);
  return new my({
    calendarSystem: "gregory",
    timeZone: t,
    namedTimeZoneImpl: o.namedTimeZonedImpl,
    locale: s,
    weekNumberCalculation: n,
    firstDay: a,
    weekText: r,
    cmdFormatter: o.cmdFormatter,
    defaultSeparator: l
  });
}
function MA(t, e) {
  let n = e.themeClasses[t.themeSystem] || ze;
  return new n(t);
}
function DA(t) {
  let e = t.dateProfileGeneratorClass || pc;
  return new e(t);
}
function TA(t, e, n) {
  return new oA(t, e, n);
}
function RA(t) {
  return et(t, (e) => e.ui);
}
function HA(t, e, n) {
  let a = { "": e };
  for (let r in t) {
    let o = t[r];
    o.sourceId && n[o.sourceId] && (a[r] = n[o.sourceId]);
  }
  return a;
}
function IA(t) {
  let { options: e } = t;
  return {
    eventUiSingleBase: xn({
      display: e.eventDisplay,
      editable: e.editable,
      startEditable: e.eventStartEditable,
      durationEditable: e.eventDurationEditable,
      constraint: e.eventConstraint,
      overlap: typeof e.eventOverlap == "boolean" ? e.eventOverlap : void 0,
      allow: e.eventAllow,
      backgroundColor: e.eventBackgroundColor,
      borderColor: e.eventBorderColor,
      textColor: e.eventTextColor,
      color: e.eventColor
      // classNames: options.eventClassNames // render hook will handle this
    }, t),
    selectionConfig: xn({
      constraint: e.selectConstraint,
      overlap: typeof e.selectOverlap == "boolean" ? e.selectOverlap : void 0,
      allow: e.selectAllow
    }, t)
  };
}
function io(t, e) {
  for (let n of e.pluginHooks.isLoadingFuncs)
    if (n(t))
      return !0;
  return !1;
}
function kA(t) {
  return $y(t.options.businessHours, t);
}
function Bl(t, e) {
  for (let n in t)
    console.warn(`Unknown option '${n}'`);
}
class zA extends Y {
  render() {
    let e = this.props.widgetGroups.map((n) => this.renderWidgetGroup(n));
    return C("div", { className: "fc-toolbar-chunk" }, ...e);
  }
  renderWidgetGroup(e) {
    let { props: n } = this, { theme: a } = this.context, r = [], o = !0;
    for (let i of e) {
      let { buttonName: l, buttonClick: s, buttonText: u, buttonIcon: d, buttonHint: g } = i;
      if (l === "title")
        o = !1, r.push(C("h2", { className: "fc-toolbar-title", id: n.titleId }, n.title));
      else {
        let v = l === n.activeButton, p = !n.isTodayEnabled && l === "today" || !n.isPrevEnabled && l === "prev" || !n.isNextEnabled && l === "next", w = [`fc-${l}-button`, a.getClass("button")];
        v && w.push(a.getClass("buttonActive")), r.push(C("button", { type: "button", title: typeof g == "function" ? g(n.navUnit) : g, disabled: p, "aria-pressed": v, className: w.join(" "), onClick: s }, u || (d ? C("span", { className: d, role: "img" }) : "")));
      }
    }
    if (r.length > 1) {
      let i = o && a.getClass("buttonGroup") || "";
      return C("div", { className: i }, ...r);
    }
    return r[0];
  }
}
class Ll extends Y {
  render() {
    let { model: e, extraClassName: n } = this.props, a = !1, r, o, i = e.sectionWidgets, l = i.center;
    return i.left ? (a = !0, r = i.left) : r = i.start, i.right ? (a = !0, o = i.right) : o = i.end, C(
      "div",
      { className: [
        n || "",
        "fc-toolbar",
        a ? "fc-toolbar-ltr" : ""
      ].join(" ") },
      this.renderSection("start", r || []),
      this.renderSection("center", l || []),
      this.renderSection("end", o || [])
    );
  }
  renderSection(e, n) {
    let { props: a } = this;
    return C(zA, { key: e, widgetGroups: n, title: a.title, navUnit: a.navUnit, activeButton: a.activeButton, isTodayEnabled: a.isTodayEnabled, isPrevEnabled: a.isPrevEnabled, isNextEnabled: a.isNextEnabled, titleId: a.titleId });
  }
}
class VA extends Y {
  constructor() {
    super(...arguments), this.state = {
      availableWidth: null
    }, this.handleEl = (e) => {
      this.el = e, we(this.props.elRef, e), this.updateAvailableWidth();
    }, this.handleResize = () => {
      this.updateAvailableWidth();
    };
  }
  render() {
    let { props: e, state: n } = this, { aspectRatio: a } = e, r = [
      "fc-view-harness",
      a || e.liquid || e.height ? "fc-view-harness-active" : "fc-view-harness-passive"
      // let the view do the height
    ], o = "", i = "";
    return a ? n.availableWidth !== null ? o = n.availableWidth / a : i = `${1 / a * 100}%` : o = e.height || "", C("div", { "aria-labelledby": e.labeledById, ref: this.handleEl, className: r.join(" "), style: { height: o, paddingBottom: i } }, e.children);
  }
  componentDidMount() {
    this.context.addResizeHandler(this.handleResize);
  }
  componentWillUnmount() {
    this.context.removeResizeHandler(this.handleResize);
  }
  updateAvailableWidth() {
    this.el && // needed. but why?
    this.props.aspectRatio && this.setState({ availableWidth: this.el.offsetWidth });
  }
}
class OA extends bt {
  constructor(e) {
    super(e), this.handleSegClick = (n, a) => {
      let { component: r } = this, { context: o } = r, i = vt(a);
      if (i && // might be the <div> surrounding the more link
      r.isValidSegDownEl(n.target)) {
        let l = ae(n.target, ".fc-event-forced-url"), s = l ? l.querySelector("a[href]").href : "";
        o.emitter.trigger("eventClick", {
          el: a,
          event: new $(r.context, i.eventRange.def, i.eventRange.instance),
          jsEvent: n,
          view: o.viewApi
        }), s && !n.defaultPrevented && (window.location.href = s);
      }
    }, this.destroy = ac(
      e.el,
      "click",
      ".fc-event",
      // on both fg and bg events
      this.handleSegClick
    );
  }
}
class BA extends bt {
  constructor(e) {
    super(e), this.handleEventElRemove = (n) => {
      n === this.currentSegEl && this.handleSegLeave(null, this.currentSegEl);
    }, this.handleSegEnter = (n, a) => {
      vt(a) && (this.currentSegEl = a, this.triggerEvent("eventMouseEnter", n, a));
    }, this.handleSegLeave = (n, a) => {
      this.currentSegEl && (this.currentSegEl = null, this.triggerEvent("eventMouseLeave", n, a));
    }, this.removeHoverListeners = sw(
      e.el,
      ".fc-event",
      // on both fg and bg events
      this.handleSegEnter,
      this.handleSegLeave
    );
  }
  destroy() {
    this.removeHoverListeners();
  }
  triggerEvent(e, n, a) {
    let { component: r } = this, { context: o } = r, i = vt(a);
    (!n || r.isValidSegDownEl(n.target)) && o.emitter.trigger(e, {
      el: a,
      event: new $(o, i.eventRange.def, i.eventRange.instance),
      jsEvent: n,
      view: o.viewApi
    });
  }
}
class LA extends nt {
  constructor() {
    super(...arguments), this.buildViewContext = O(py), this.buildViewPropTransformers = O(PA), this.buildToolbarProps = O(NA), this.headerRef = Ae(), this.footerRef = Ae(), this.interactionsStore = {}, this.state = {
      viewLabelId: Bn()
    }, this.registerInteractiveComponent = (e, n) => {
      let a = gb(e, n), i = [
        OA,
        BA
      ].concat(this.props.pluginHooks.componentInteractions).map((l) => new l(a));
      this.interactionsStore[e.uid] = i, wo[e.uid] = a;
    }, this.unregisterInteractiveComponent = (e) => {
      let n = this.interactionsStore[e.uid];
      if (n) {
        for (let a of n)
          a.destroy();
        delete this.interactionsStore[e.uid];
      }
      delete wo[e.uid];
    }, this.resizeRunner = new Go(() => {
      this.props.emitter.trigger("_resize", !0), this.props.emitter.trigger("windowResize", { view: this.props.viewApi });
    }), this.handleWindowResize = (e) => {
      let { options: n } = this.props;
      n.handleWindowResize && e.target === window && this.resizeRunner.request(n.windowResizeDelay);
    };
  }
  /*
  renders INSIDE of an outer div
  */
  render() {
    let { props: e } = this, { toolbarConfig: n, options: a } = e, r = !1, o = "", i;
    e.isHeightAuto || e.forPrint ? o = "" : a.height != null ? r = !0 : a.contentHeight != null ? o = a.contentHeight : i = Math.max(a.aspectRatio, 0.5);
    let l = this.buildViewContext(e.viewSpec, e.viewApi, e.options, e.dateProfileGenerator, e.dateEnv, e.nowManager, e.theme, e.pluginHooks, e.dispatch, e.getCurrentData, e.emitter, e.calendarApi, this.registerInteractiveComponent, this.unregisterInteractiveComponent), s = n.header && n.header.hasTitle ? this.state.viewLabelId : void 0;
    return C(
      tt.Provider,
      { value: l },
      C(qn, { unit: "day" }, (u) => {
        let d = this.buildToolbarProps(e.viewSpec, e.dateProfile, e.dateProfileGenerator, e.currentDate, u, e.viewTitle);
        return C(
          Z,
          null,
          n.header && C(Ll, Object.assign({ ref: this.headerRef, extraClassName: "fc-header-toolbar", model: n.header, titleId: s }, d)),
          C(
            VA,
            { liquid: r, height: o, aspectRatio: i, labeledById: s },
            this.renderView(e),
            this.buildAppendContent()
          ),
          n.footer && C(Ll, Object.assign({ ref: this.footerRef, extraClassName: "fc-footer-toolbar", model: n.footer, titleId: "" }, d))
        );
      })
    );
  }
  componentDidMount() {
    let { props: e } = this;
    this.calendarInteractions = e.pluginHooks.calendarInteractions.map((a) => new a(e)), window.addEventListener("resize", this.handleWindowResize);
    let { propSetHandlers: n } = e.pluginHooks;
    for (let a in n)
      n[a](e[a], e);
  }
  componentDidUpdate(e) {
    let { props: n } = this, { propSetHandlers: a } = n.pluginHooks;
    for (let r in a)
      n[r] !== e[r] && a[r](n[r], n);
  }
  componentWillUnmount() {
    window.removeEventListener("resize", this.handleWindowResize), this.resizeRunner.clear();
    for (let e of this.calendarInteractions)
      e.destroy();
    this.props.emitter.trigger("_unmount");
  }
  buildAppendContent() {
    let { props: e } = this, n = e.pluginHooks.viewContainerAppends.map((a) => a(e));
    return C(Z, {}, ...n);
  }
  renderView(e) {
    let { pluginHooks: n } = e, { viewSpec: a } = e, r = {
      dateProfile: e.dateProfile,
      businessHours: e.businessHours,
      eventStore: e.renderableEventStore,
      eventUiBases: e.eventUiBases,
      dateSelection: e.dateSelection,
      eventSelection: e.eventSelection,
      eventDrag: e.eventDrag,
      eventResize: e.eventResize,
      isHeightAuto: e.isHeightAuto,
      forPrint: e.forPrint
    }, o = this.buildViewPropTransformers(n.viewPropsTransformers);
    for (let l of o)
      Object.assign(r, l.transform(r, e));
    let i = a.component;
    return C(i, Object.assign({}, r));
  }
}
function NA(t, e, n, a, r, o) {
  let i = n.build(r, void 0, !1), l = n.buildPrev(e, a, !1), s = n.buildNext(e, a, !1);
  return {
    title: o,
    activeButton: t.type,
    navUnit: t.singleUnit,
    isTodayEnabled: i.isValid && !Re(e.currentRange, r),
    isPrevEnabled: l.isValid,
    isNextEnabled: s.isValid
  };
}
function PA(t) {
  return t.map((e) => new e());
}
class jA extends _b {
  constructor(e, n = {}) {
    super(), this.isRendering = !1, this.isRendered = !1, this.currentClassNames = [], this.customContentRenderId = 0, this.handleAction = (a) => {
      switch (a.type) {
        case "SET_EVENT_DRAG":
        case "SET_EVENT_RESIZE":
          this.renderRunner.tryDrain();
      }
    }, this.handleData = (a) => {
      this.currentData = a, this.renderRunner.request(a.calendarOptions.rerenderDelay);
    }, this.handleRenderRequest = () => {
      if (this.isRendering) {
        this.isRendered = !0;
        let { currentData: a } = this;
        Cn(() => {
          zt(C(pb, { options: a.calendarOptions, theme: a.theme, emitter: a.emitter }, (r, o, i, l) => (this.setClassNames(r), this.setHeight(o), C(
            uc.Provider,
            { value: this.customContentRenderId },
            C(LA, Object.assign({ isHeightAuto: i, forPrint: l }, a))
          ))), this.el);
        });
      } else this.isRendered && (this.isRendered = !1, zt(null, this.el), this.setClassNames([]), this.setHeight(""));
    }, J7(e), this.el = e, this.renderRunner = new Go(this.handleRenderRequest), new EA({
      optionOverrides: n,
      calendarApi: this,
      onAction: this.handleAction,
      onData: this.handleData
    });
  }
  render() {
    let e = this.isRendering;
    e ? this.customContentRenderId += 1 : this.isRendering = !0, this.renderRunner.request(), e && this.updateSize();
  }
  destroy() {
    this.isRendering && (this.isRendering = !1, this.renderRunner.request());
  }
  updateSize() {
    Cn(() => {
      super.updateSize();
    });
  }
  batchRendering(e) {
    this.renderRunner.pause("batchRendering"), e(), this.renderRunner.resume("batchRendering");
  }
  pauseRendering() {
    this.renderRunner.pause("pauseRendering");
  }
  resumeRendering() {
    this.renderRunner.resume("pauseRendering", !0);
  }
  resetOptions(e, n) {
    this.currentDataManager.resetOptions(e, n);
  }
  setClassNames(e) {
    if (!He(e, this.currentClassNames)) {
      let { classList: n } = this.el;
      for (let a of this.currentClassNames)
        n.remove(a);
      for (let a of e)
        n.add(a);
      this.currentClassNames = e;
    }
  }
  setHeight(e) {
    tc(this.el, "height", e);
  }
}
class qA extends at {
  constructor() {
    super(...arguments), this.headerElRef = Ae();
  }
  renderSimpleLayout(e, n) {
    let { props: a, context: r } = this, o = [], i = Tl(r.options);
    return e && o.push({
      type: "header",
      key: "header",
      isSticky: i,
      chunk: {
        elRef: this.headerElRef,
        tableClassName: "fc-col-header",
        rowContent: e
      }
    }), o.push({
      type: "body",
      key: "body",
      liquid: !0,
      chunk: { content: n }
    }), C(
      _l,
      { elClasses: ["fc-daygrid"], viewSpec: r.viewSpec },
      C(qc, { liquid: !a.isHeightAuto && !a.forPrint, collapsibleWidth: a.forPrint, cols: [], sections: o })
    );
  }
  renderHScrollLayout(e, n, a, r) {
    let o = this.context.pluginHooks.scrollGridImpl;
    if (!o)
      throw new Error("No ScrollGrid implementation");
    let { props: i, context: l } = this, s = !i.forPrint && Tl(l.options), u = !i.forPrint && sC(l.options), d = [];
    return e && d.push({
      type: "header",
      key: "header",
      isSticky: s,
      chunks: [{
        key: "main",
        elRef: this.headerElRef,
        tableClassName: "fc-col-header",
        rowContent: e
      }]
    }), d.push({
      type: "body",
      key: "body",
      liquid: !0,
      chunks: [{
        key: "main",
        content: n
      }]
    }), u && d.push({
      type: "footer",
      key: "footer",
      isSticky: !0,
      chunks: [{
        key: "main",
        content: lC
      }]
    }), C(
      _l,
      { elClasses: ["fc-daygrid"], viewSpec: l.viewSpec },
      C(o, { liquid: !i.isHeightAuto && !i.forPrint, forPrint: i.forPrint, collapsibleWidth: i.forPrint, colGroups: [{ cols: [{ span: a, minWidth: r }] }], sections: d })
    );
  }
}
function dn(t, e) {
  let n = [];
  for (let a = 0; a < e; a += 1)
    n[a] = [];
  for (let a of t)
    n[a.row].push(a);
  return n;
}
function nn(t, e) {
  let n = [];
  for (let a = 0; a < e; a += 1)
    n[a] = [];
  for (let a of t)
    n[a.firstCol].push(a);
  return n;
}
function Nl(t, e) {
  let n = [];
  if (t) {
    for (let a = 0; a < e; a += 1)
      n[a] = {
        affectedInstances: t.affectedInstances,
        isEvent: t.isEvent,
        segs: []
      };
    for (let a of t.segs)
      n[a.row].segs.push(a);
  } else
    for (let a = 0; a < e; a += 1)
      n[a] = null;
  return n;
}
const t1 = K({
  hour: "numeric",
  minute: "2-digit",
  omitZeroMinute: !0,
  meridiem: "narrow"
});
function n1(t) {
  let { display: e } = t.eventRange.ui;
  return e === "list-item" || e === "auto" && !t.eventRange.def.allDay && t.firstCol === t.lastCol && // can't be multi-day
  t.isStart && // "
  t.isEnd;
}
class a1 extends Y {
  render() {
    let { props: e } = this;
    return C(Fc, Object.assign({}, e, { elClasses: ["fc-daygrid-event", "fc-daygrid-block-event", "fc-h-event"], defaultTimeFormat: t1, defaultDisplayEventEnd: e.defaultDisplayEventEnd, disableResizing: !e.seg.eventRange.def.allDay }));
  }
}
class r1 extends Y {
  render() {
    let { props: e, context: n } = this, { options: a } = n, { seg: r } = e, o = a.eventTimeFormat || t1, i = Sc(r, o, n, !0, e.defaultDisplayEventEnd);
    return C(f2, Object.assign({}, e, { elTag: "a", elClasses: ["fc-daygrid-event", "fc-daygrid-dot-event"], elAttrs: Mc(e.seg, n), defaultGenerator: FA, timeText: i, isResizing: !1, isDateSelecting: !1 }));
  }
}
function FA(t) {
  return C(
    Z,
    null,
    C("div", { className: "fc-daygrid-event-dot", style: { borderColor: t.borderColor || t.backgroundColor } }),
    t.timeText && C("div", { className: "fc-event-time" }, t.timeText),
    C("div", { className: "fc-event-title" }, t.event.title || C(Z, null, " "))
  );
}
class UA extends Y {
  constructor() {
    super(...arguments), this.compileSegs = O(WA);
  }
  render() {
    let { props: e } = this, { allSegs: n, invisibleSegs: a } = this.compileSegs(e.singlePlacements);
    return C(yC, { elClasses: ["fc-daygrid-more-link"], dateProfile: e.dateProfile, todayRange: e.todayRange, allDayDate: e.allDayDate, moreCnt: e.moreCnt, allSegs: n, hiddenSegs: a, alignmentElRef: e.alignmentElRef, alignGridTop: e.alignGridTop, extraDateSpan: e.extraDateSpan, popoverContent: () => {
      let r = (e.eventDrag ? e.eventDrag.affectedInstances : null) || (e.eventResize ? e.eventResize.affectedInstances : null) || {};
      return C(Z, null, n.map((o) => {
        let i = o.eventRange.instance.instanceId;
        return C("div", { className: "fc-daygrid-event-harness", key: i, style: {
          visibility: r[i] ? "hidden" : ""
        } }, n1(o) ? C(r1, Object.assign({ seg: o, isDragging: !1, isSelected: i === e.eventSelection, defaultDisplayEventEnd: !1 }, Rt(o, e.todayRange))) : C(a1, Object.assign({ seg: o, isDragging: !1, isResizing: !1, isDateSelecting: !1, isSelected: i === e.eventSelection, defaultDisplayEventEnd: !1 }, Rt(o, e.todayRange))));
      }));
    } });
  }
}
function WA(t) {
  let e = [], n = [];
  for (let a of t)
    e.push(a.seg), a.isVisible || n.push(a.seg);
  return { allSegs: e, invisibleSegs: n };
}
const GA = K({ week: "narrow" });
class $A extends at {
  constructor() {
    super(...arguments), this.rootElRef = Ae(), this.state = {
      dayNumberId: Bn()
    }, this.handleRootEl = (e) => {
      we(this.rootElRef, e), we(this.props.elRef, e);
    };
  }
  render() {
    let { context: e, props: n, state: a, rootElRef: r } = this, { options: o, dateEnv: i } = e, { date: l, dateProfile: s } = n;
    const u = n.showDayNumber && YA(l, s.currentRange, i);
    return C(Uc, { elTag: "td", elRef: this.handleRootEl, elClasses: [
      "fc-daygrid-day",
      ...n.extraClassNames || []
    ], elAttrs: Object.assign(Object.assign(Object.assign({}, n.extraDataAttrs), n.showDayNumber ? { "aria-labelledby": a.dayNumberId } : {}), { role: "gridcell" }), defaultGenerator: QA, date: l, dateProfile: s, todayRange: n.todayRange, showDayNumber: n.showDayNumber, isMonthStart: u, extraRenderProps: n.extraRenderProps }, (d, g) => C(
      "div",
      { ref: n.innerElRef, className: "fc-daygrid-day-frame fc-scrollgrid-sync-inner", style: { minHeight: n.minHeight } },
      n.showWeekNumber && C(gC, { elTag: "a", elClasses: ["fc-daygrid-week-number"], elAttrs: yo(e, l, "week"), date: l, defaultFormat: GA }),
      !g.isDisabled && (n.showDayNumber || Wc(o) || n.forceDayTop) ? C(
        "div",
        { className: "fc-daygrid-day-top" },
        C(d, { elTag: "a", elClasses: [
          "fc-daygrid-day-number",
          u && "fc-daygrid-month-start"
        ], elAttrs: Object.assign(Object.assign({}, yo(e, l)), { id: a.dayNumberId }) })
      ) : n.showDayNumber ? (
        // for creating correct amount of space (see issue #7162)
        C(
          "div",
          { className: "fc-daygrid-day-top", style: { visibility: "hidden" } },
          C("a", { className: "fc-daygrid-day-number" }, " ")
        )
      ) : void 0,
      C(
        "div",
        { className: "fc-daygrid-day-events", ref: n.fgContentElRef },
        n.fgContent,
        C(
          "div",
          { className: "fc-daygrid-day-bottom", style: { marginTop: n.moreMarginTop } },
          C(UA, { allDayDate: l, singlePlacements: n.singlePlacements, moreCnt: n.moreCnt, alignmentElRef: r, alignGridTop: !n.showDayNumber, extraDateSpan: n.extraDateSpan, dateProfile: n.dateProfile, eventSelection: n.eventSelection, eventDrag: n.eventDrag, eventResize: n.eventResize, todayRange: n.todayRange })
        )
      ),
      C("div", { className: "fc-daygrid-day-bg" }, n.bgContent)
    ));
  }
}
function QA(t) {
  return t.dayNumberText || C(Z, null, " ");
}
function YA(t, e, n) {
  const { start: a, end: r } = e, o = Ie(r, -1), i = n.getYear(a), l = n.getMonth(a), s = n.getYear(o), u = n.getMonth(o);
  return !(i === s && l === u) && // first date in current view?
  (t.valueOf() === a.valueOf() || // a month-start that's within the current range?
  n.getDay(t) === 1 && t.valueOf() < r.valueOf());
}
function o1(t) {
  return t.eventRange.instance.instanceId + ":" + t.firstCol;
}
function i1(t) {
  return o1(t) + ":" + t.lastCol;
}
function ZA(t, e, n, a, r, o, i) {
  let l = new JA((A) => {
    let E = t[A.index].eventRange.instance.instanceId + ":" + A.span.start + ":" + (A.span.end - 1);
    return r[E] || 1;
  });
  l.allowReslicing = !0, l.strictOrder = a, e === !0 || n === !0 ? (l.maxCoord = o, l.hiddenConsumes = !0) : typeof e == "number" ? l.maxStackCnt = e : typeof n == "number" && (l.maxStackCnt = n, l.hiddenConsumes = !0);
  let s = [], u = [];
  for (let A = 0; A < t.length; A += 1) {
    let E = t[A], S = i1(E);
    r[S] != null ? s.push({
      index: A,
      span: {
        start: E.firstCol,
        end: E.lastCol + 1
      }
    }) : u.push(E);
  }
  let d = l.addSegs(s), g = l.toRects(), { singleColPlacements: v, multiColPlacements: p, leftoverMargins: w } = KA(g, t, i), _ = [], y = [];
  for (let A of u) {
    p[A.firstCol].push({
      seg: A,
      isVisible: !1,
      isAbsolute: !0,
      absoluteTop: 0,
      marginTop: 0
    });
    for (let E = A.firstCol; E <= A.lastCol; E += 1)
      v[E].push({
        seg: mt(A, E, E + 1, i),
        isVisible: !1,
        isAbsolute: !1,
        absoluteTop: 0,
        marginTop: 0
      });
  }
  for (let A = 0; A < i.length; A += 1)
    _.push(0);
  for (let A of d) {
    let E = t[A.index], S = A.span;
    p[S.start].push({
      seg: mt(E, S.start, S.end, i),
      isVisible: !1,
      isAbsolute: !0,
      absoluteTop: 0,
      marginTop: 0
    });
    for (let M = S.start; M < S.end; M += 1)
      _[M] += 1, v[M].push({
        seg: mt(E, M, M + 1, i),
        isVisible: !1,
        isAbsolute: !1,
        absoluteTop: 0,
        marginTop: 0
      });
  }
  for (let A = 0; A < i.length; A += 1)
    y.push(w[A]);
  return { singleColPlacements: v, multiColPlacements: p, moreCnts: _, moreMarginTops: y };
}
function KA(t, e, n) {
  let a = XA(t, n.length), r = [], o = [], i = [];
  for (let l = 0; l < n.length; l += 1) {
    let s = a[l], u = [], d = 0, g = 0;
    for (let p of s) {
      let w = e[p.index];
      u.push({
        seg: mt(w, l, l + 1, n),
        isVisible: !0,
        isAbsolute: !1,
        absoluteTop: p.levelCoord,
        marginTop: p.levelCoord - d
      }), d = p.levelCoord + p.thickness;
    }
    let v = [];
    d = 0, g = 0;
    for (let p of s) {
      let w = e[p.index], _ = p.span.end - p.span.start > 1, y = p.span.start === l;
      g += p.levelCoord - d, d = p.levelCoord + p.thickness, _ ? (g += p.thickness, y && v.push({
        seg: mt(w, p.span.start, p.span.end, n),
        isVisible: !0,
        isAbsolute: !0,
        absoluteTop: p.levelCoord,
        marginTop: 0
      })) : y && (v.push({
        seg: mt(w, p.span.start, p.span.end, n),
        isVisible: !0,
        isAbsolute: !1,
        absoluteTop: p.levelCoord,
        marginTop: g
        // claim the margin
      }), g = 0);
    }
    r.push(u), o.push(v), i.push(g);
  }
  return { singleColPlacements: r, multiColPlacements: o, leftoverMargins: i };
}
function XA(t, e) {
  let n = [];
  for (let a = 0; a < e; a += 1)
    n.push([]);
  for (let a of t)
    for (let r = a.span.start; r < a.span.end; r += 1)
      n[r].push(a);
  return n;
}
function mt(t, e, n, a) {
  if (t.firstCol === e && t.lastCol === n - 1)
    return t;
  let r = t.eventRange, o = r.range, i = gt(o, {
    start: a[e].date,
    end: X(a[n - 1].date, 1)
  });
  return Object.assign(Object.assign({}, t), { firstCol: e, lastCol: n - 1, eventRange: {
    def: r.def,
    ui: Object.assign(Object.assign({}, r.ui), { durationEditable: !1 }),
    instance: r.instance,
    range: i
  }, isStart: t.isStart && i.start.valueOf() === o.start.valueOf(), isEnd: t.isEnd && i.end.valueOf() === o.end.valueOf() });
}
class JA extends zb {
  constructor() {
    super(...arguments), this.hiddenConsumes = !1, this.forceHidden = {};
  }
  addSegs(e) {
    const n = super.addSegs(e), { entriesByLevel: a } = this, r = (o) => !this.forceHidden[Ht(o)];
    for (let o = 0; o < a.length; o += 1)
      a[o] = a[o].filter(r);
    return n;
  }
  handleInvalidInsertion(e, n, a) {
    const { entriesByLevel: r, forceHidden: o } = this, { touchingEntry: i, touchingLevel: l, touchingLateral: s } = e;
    if (this.hiddenConsumes && i) {
      const u = Ht(i);
      if (!o[u])
        if (this.allowReslicing) {
          const d = Object.assign(Object.assign({}, i), { span: Vc(i.span, n.span) }), g = Ht(d);
          o[g] = !0, r[l][s] = d, a.push(d), this.splitEntry(i, n, a);
        } else
          o[u] = !0, a.push(i);
    }
    super.handleInvalidInsertion(e, n, a);
  }
}
class l1 extends at {
  constructor() {
    super(...arguments), this.cellElRefs = new je(), this.frameElRefs = new je(), this.fgElRefs = new je(), this.segHarnessRefs = new je(), this.rootElRef = Ae(), this.state = {
      framePositions: null,
      maxContentHeight: null,
      segHeights: {}
    }, this.handleResize = (e) => {
      e && this.updateSizing(!0);
    };
  }
  render() {
    let { props: e, state: n, context: a } = this, { options: r } = a, o = e.cells.length, i = nn(e.businessHourSegs, o), l = nn(e.bgEventSegs, o), s = nn(this.getHighlightSegs(), o), u = nn(this.getMirrorSegs(), o), { singleColPlacements: d, multiColPlacements: g, moreCnts: v, moreMarginTops: p } = ZA(Xy(e.fgEventSegs, r.eventOrder), e.dayMaxEvents, e.dayMaxEventRows, r.eventOrderStrict, n.segHeights, n.maxContentHeight, e.cells), w = (
      // TODO: messy way to compute this
      e.eventDrag && e.eventDrag.affectedInstances || e.eventResize && e.eventResize.affectedInstances || {}
    );
    return C(
      "tr",
      { ref: this.rootElRef, role: "row" },
      e.renderIntro && e.renderIntro(),
      e.cells.map((_, y) => {
        let A = this.renderFgSegs(y, e.forPrint ? d[y] : g[y], e.todayRange, w), E = this.renderFgSegs(y, ex(u[y], g), e.todayRange, {}, !!e.eventDrag, !!e.eventResize, !1);
        return C($A, { key: _.key, elRef: this.cellElRefs.createRef(_.key), innerElRef: this.frameElRefs.createRef(_.key), dateProfile: e.dateProfile, date: _.date, showDayNumber: e.showDayNumbers, showWeekNumber: e.showWeekNumbers && y === 0, forceDayTop: e.showWeekNumbers, todayRange: e.todayRange, eventSelection: e.eventSelection, eventDrag: e.eventDrag, eventResize: e.eventResize, extraRenderProps: _.extraRenderProps, extraDataAttrs: _.extraDataAttrs, extraClassNames: _.extraClassNames, extraDateSpan: _.extraDateSpan, moreCnt: v[y], moreMarginTop: p[y], singlePlacements: d[y], fgContentElRef: this.fgElRefs.createRef(_.key), fgContent: (
          // Fragment scopes the keys
          C(
            Z,
            null,
            C(Z, null, A),
            C(Z, null, E)
          )
        ), bgContent: (
          // Fragment scopes the keys
          C(
            Z,
            null,
            this.renderFillSegs(s[y], "highlight"),
            this.renderFillSegs(i[y], "non-business"),
            this.renderFillSegs(l[y], "bg-event")
          )
        ), minHeight: e.cellMinHeight });
      })
    );
  }
  componentDidMount() {
    this.updateSizing(!0), this.context.addResizeHandler(this.handleResize);
  }
  componentDidUpdate(e, n) {
    let a = this.props;
    this.updateSizing(!pe(e, a));
  }
  componentWillUnmount() {
    this.context.removeResizeHandler(this.handleResize);
  }
  getHighlightSegs() {
    let { props: e } = this;
    return e.eventDrag && e.eventDrag.segs.length ? e.eventDrag.segs : e.eventResize && e.eventResize.segs.length ? e.eventResize.segs : e.dateSelectionSegs;
  }
  getMirrorSegs() {
    let { props: e } = this;
    return e.eventResize && e.eventResize.segs.length ? e.eventResize.segs : [];
  }
  renderFgSegs(e, n, a, r, o, i, l) {
    let { context: s } = this, { eventSelection: u } = this.props, { framePositions: d } = this.state, g = this.props.cells.length === 1, v = o || i || l, p = [];
    if (d)
      for (let w of n) {
        let { seg: _ } = w, { instanceId: y } = _.eventRange.instance, A = w.isVisible && !r[y], E = w.isAbsolute, S = "", M = "";
        E && (s.isRtl ? (M = 0, S = d.lefts[_.lastCol] - d.lefts[_.firstCol]) : (S = 0, M = d.rights[_.firstCol] - d.rights[_.lastCol])), p.push(C("div", { className: "fc-daygrid-event-harness" + (E ? " fc-daygrid-event-harness-abs" : ""), key: o1(_), ref: v ? null : this.segHarnessRefs.createRef(i1(_)), style: {
          visibility: A ? "" : "hidden",
          marginTop: E ? "" : w.marginTop,
          top: E ? w.absoluteTop : "",
          left: S,
          right: M
        } }, n1(_) ? C(r1, Object.assign({ seg: _, isDragging: o, isSelected: y === u, defaultDisplayEventEnd: g }, Rt(_, a))) : C(a1, Object.assign({ seg: _, isDragging: o, isResizing: i, isDateSelecting: l, isSelected: y === u, defaultDisplayEventEnd: g }, Rt(_, a)))));
      }
    return p;
  }
  renderFillSegs(e, n) {
    let { isRtl: a } = this.context, { todayRange: r } = this.props, { framePositions: o } = this.state, i = [];
    if (o)
      for (let l of e) {
        let s = a ? {
          right: 0,
          left: o.lefts[l.lastCol] - o.lefts[l.firstCol]
        } : {
          left: 0,
          right: o.rights[l.firstCol] - o.rights[l.lastCol]
        };
        i.push(C("div", { key: rb(l.eventRange), className: "fc-daygrid-bg-harness", style: s }, n === "bg-event" ? C(hC, Object.assign({ seg: l }, Rt(l, r))) : pC(n)));
      }
    return C(Z, {}, ...i);
  }
  updateSizing(e) {
    let { props: n, state: a, frameElRefs: r } = this;
    if (!n.forPrint && n.clientWidth !== null) {
      if (e) {
        let s = n.cells.map((u) => r.currentMap[u.key]);
        if (s.length) {
          let u = this.rootElRef.current, d = new Sn(
            u,
            s,
            !0,
            // isHorizontal
            !1
          );
          (!a.framePositions || !a.framePositions.similarTo(d)) && this.setState({
            framePositions: new Sn(
              u,
              s,
              !0,
              // isHorizontal
              !1
            )
          });
        }
      }
      const o = this.state.segHeights, i = this.querySegHeights(), l = n.dayMaxEvents === !0 || n.dayMaxEventRows === !0;
      this.safeSetState({
        // HACK to prevent oscillations of events being shown/hidden from max-event-rows
        // Essentially, once you compute an element's height, never null-out.
        // TODO: always display all events, as visibility:hidden?
        segHeights: Object.assign(Object.assign({}, o), i),
        maxContentHeight: l ? this.computeMaxContentHeight() : null
      });
    }
  }
  querySegHeights() {
    let e = this.segHarnessRefs.currentMap, n = {};
    for (let a in e) {
      let r = Math.round(e[a].getBoundingClientRect().height);
      n[a] = Math.max(n[a] || 0, r);
    }
    return n;
  }
  computeMaxContentHeight() {
    let e = this.props.cells[0].key, n = this.cellElRefs.currentMap[e], a = this.fgElRefs.currentMap[e];
    return n.getBoundingClientRect().bottom - a.getBoundingClientRect().top;
  }
  getCellEls() {
    let e = this.cellElRefs.currentMap;
    return this.props.cells.map((n) => e[n.key]);
  }
}
l1.addStateEquality({
  segHeights: pe
});
function ex(t, e) {
  if (!t.length)
    return [];
  let n = tx(e);
  return t.map((a) => ({
    seg: a,
    isVisible: !0,
    isAbsolute: !0,
    absoluteTop: n[a.eventRange.instance.instanceId],
    marginTop: 0
  }));
}
function tx(t) {
  let e = {};
  for (let n of t)
    for (let a of n)
      e[a.seg.eventRange.instance.instanceId] = a.absoluteTop;
  return e;
}
class nx extends at {
  constructor() {
    super(...arguments), this.splitBusinessHourSegs = O(dn), this.splitBgEventSegs = O(ax), this.splitFgEventSegs = O(dn), this.splitDateSelectionSegs = O(dn), this.splitEventDrag = O(Nl), this.splitEventResize = O(Nl), this.rowRefs = new je();
  }
  render() {
    let { props: e, context: n } = this, a = e.cells.length, r = this.splitBusinessHourSegs(e.businessHourSegs, a), o = this.splitBgEventSegs(e.bgEventSegs, a), i = this.splitFgEventSegs(e.fgEventSegs, a), l = this.splitDateSelectionSegs(e.dateSelectionSegs, a), s = this.splitEventDrag(e.eventDrag, a), u = this.splitEventResize(e.eventResize, a), d = a >= 7 && e.clientWidth ? e.clientWidth / n.options.aspectRatio / 6 : null;
    return C(qn, { unit: "day" }, (g, v) => C(Z, null, e.cells.map((p, w) => C(l1, {
      ref: this.rowRefs.createRef(w),
      key: p.length ? p[0].date.toISOString() : w,
      showDayNumbers: a > 1,
      showWeekNumbers: e.showWeekNumbers,
      todayRange: v,
      dateProfile: e.dateProfile,
      cells: p,
      renderIntro: e.renderRowIntro,
      businessHourSegs: r[w],
      eventSelection: e.eventSelection,
      bgEventSegs: o[w],
      fgEventSegs: i[w],
      dateSelectionSegs: l[w],
      eventDrag: s[w],
      eventResize: u[w],
      dayMaxEvents: e.dayMaxEvents,
      dayMaxEventRows: e.dayMaxEventRows,
      clientWidth: e.clientWidth,
      clientHeight: e.clientHeight,
      cellMinHeight: d,
      forPrint: e.forPrint
    }))));
  }
  componentDidMount() {
    this.registerInteractiveComponent();
  }
  componentDidUpdate() {
    this.registerInteractiveComponent();
  }
  registerInteractiveComponent() {
    if (!this.rootEl) {
      const e = this.rowRefs.currentMap[0].getCellEls()[0], n = e ? e.closest(".fc-daygrid-body") : null;
      n && (this.rootEl = n, this.context.registerInteractiveComponent(this, {
        el: n,
        isHitComboAllowed: this.props.isHitComboAllowed
      }));
    }
  }
  componentWillUnmount() {
    this.rootEl && (this.context.unregisterInteractiveComponent(this), this.rootEl = null);
  }
  // Hit System
  // ----------------------------------------------------------------------------------------------------
  prepareHits() {
    this.rowPositions = new Sn(
      this.rootEl,
      this.rowRefs.collect().map((e) => e.getCellEls()[0]),
      // first cell el in each row. TODO: not optimal
      !1,
      !0
    ), this.colPositions = new Sn(
      this.rootEl,
      this.rowRefs.currentMap[0].getCellEls(),
      // cell els in first row
      !0,
      // horizontal
      !1
    );
  }
  queryHit(e, n) {
    let { colPositions: a, rowPositions: r } = this, o = a.leftToIndex(e), i = r.topToIndex(n);
    if (i != null && o != null) {
      let l = this.props.cells[i][o];
      return {
        dateProfile: this.props.dateProfile,
        dateSpan: Object.assign({ range: this.getCellRange(i, o), allDay: !0 }, l.extraDateSpan),
        dayEl: this.getCellEl(i, o),
        rect: {
          left: a.lefts[o],
          right: a.rights[o],
          top: r.tops[i],
          bottom: r.bottoms[i]
        },
        layer: 0
      };
    }
    return null;
  }
  getCellEl(e, n) {
    return this.rowRefs.currentMap[e].getCellEls()[n];
  }
  getCellRange(e, n) {
    let a = this.props.cells[e][n].date, r = X(a, 1);
    return { start: a, end: r };
  }
}
function ax(t, e) {
  return dn(t.filter(rx), e);
}
function rx(t) {
  return t.eventRange.def.allDay;
}
class ox extends at {
  constructor() {
    super(...arguments), this.elRef = Ae(), this.needsScrollReset = !1;
  }
  render() {
    let { props: e } = this, { dayMaxEventRows: n, dayMaxEvents: a, expandRows: r } = e, o = a === !0 || n === !0;
    o && !r && (o = !1, n = null, a = null);
    let i = [
      "fc-daygrid-body",
      o ? "fc-daygrid-body-balanced" : "fc-daygrid-body-unbalanced",
      r ? "" : "fc-daygrid-body-natural"
      // will height of one row depend on the others?
    ];
    return C(
      "div",
      { ref: this.elRef, className: i.join(" "), style: {
        // these props are important to give this wrapper correct dimensions for interactions
        // TODO: if we set it here, can we avoid giving to inner tables?
        width: e.clientWidth,
        minWidth: e.tableMinWidth
      } },
      C(
        "table",
        { role: "presentation", className: "fc-scrollgrid-sync-table", style: {
          width: e.clientWidth,
          minWidth: e.tableMinWidth,
          height: r ? e.clientHeight : ""
        } },
        e.colGroupNode,
        C(
          "tbody",
          { role: "presentation" },
          C(nx, { dateProfile: e.dateProfile, cells: e.cells, renderRowIntro: e.renderRowIntro, showWeekNumbers: e.showWeekNumbers, clientWidth: e.clientWidth, clientHeight: e.clientHeight, businessHourSegs: e.businessHourSegs, bgEventSegs: e.bgEventSegs, fgEventSegs: e.fgEventSegs, dateSelectionSegs: e.dateSelectionSegs, eventSelection: e.eventSelection, eventDrag: e.eventDrag, eventResize: e.eventResize, dayMaxEvents: a, dayMaxEventRows: n, forPrint: e.forPrint, isHitComboAllowed: e.isHitComboAllowed })
        )
      )
    );
  }
  componentDidMount() {
    this.requestScrollReset();
  }
  componentDidUpdate(e) {
    e.dateProfile !== this.props.dateProfile ? this.requestScrollReset() : this.flushScrollReset();
  }
  requestScrollReset() {
    this.needsScrollReset = !0, this.flushScrollReset();
  }
  flushScrollReset() {
    if (this.needsScrollReset && this.props.clientWidth) {
      const e = ix(this.elRef.current, this.props.dateProfile);
      if (e) {
        const n = e.closest(".fc-daygrid-body"), a = n.closest(".fc-scroller"), r = e.getBoundingClientRect().top - n.getBoundingClientRect().top;
        a.scrollTop = r ? r + 1 : 0;
      }
      this.needsScrollReset = !1;
    }
  }
}
function ix(t, e) {
  let n;
  return e.currentRangeUnit.match(/year|month/) && (n = t.querySelector(`[data-date="${Nw(e.currentDate)}-01"]`)), n || (n = t.querySelector(`[data-date="${Zo(e.currentDate)}"]`)), n;
}
class lx extends Ub {
  constructor() {
    super(...arguments), this.forceDayIfListItem = !0;
  }
  sliceRange(e, n) {
    return n.sliceRange(e);
  }
}
class sx extends at {
  constructor() {
    super(...arguments), this.slicer = new lx(), this.tableRef = Ae();
  }
  render() {
    let { props: e, context: n } = this;
    return C(ox, Object.assign({ ref: this.tableRef }, this.slicer.sliceProps(e, e.dateProfile, e.nextDayThreshold, n, e.dayTableModel), { dateProfile: e.dateProfile, cells: e.dayTableModel.cells, colGroupNode: e.colGroupNode, tableMinWidth: e.tableMinWidth, renderRowIntro: e.renderRowIntro, dayMaxEvents: e.dayMaxEvents, dayMaxEventRows: e.dayMaxEventRows, showWeekNumbers: e.showWeekNumbers, expandRows: e.expandRows, headerAlignElRef: e.headerAlignElRef, clientWidth: e.clientWidth, clientHeight: e.clientHeight, forPrint: e.forPrint }));
  }
}
class cx extends qA {
  constructor() {
    super(...arguments), this.buildDayTableModel = O(dx), this.headerRef = Ae(), this.tableRef = Ae();
  }
  render() {
    let { options: e, dateProfileGenerator: n } = this.context, { props: a } = this, r = this.buildDayTableModel(a.dateProfile, n), o = e.dayHeaders && C(Pb, { ref: this.headerRef, dateProfile: a.dateProfile, dates: r.headerDates, datesRepDistinctDays: r.rowCnt === 1 }), i = (l) => C(sx, { ref: this.tableRef, dateProfile: a.dateProfile, dayTableModel: r, businessHours: a.businessHours, dateSelection: a.dateSelection, eventStore: a.eventStore, eventUiBases: a.eventUiBases, eventSelection: a.eventSelection, eventDrag: a.eventDrag, eventResize: a.eventResize, nextDayThreshold: e.nextDayThreshold, colGroupNode: l.tableColGroupNode, tableMinWidth: l.tableMinWidth, dayMaxEvents: e.dayMaxEvents, dayMaxEventRows: e.dayMaxEventRows, showWeekNumbers: e.weekNumbers, expandRows: !a.isHeightAuto, headerAlignElRef: this.headerElRef, clientWidth: l.clientWidth, clientHeight: l.clientHeight, forPrint: a.forPrint });
    return e.dayMinWidth ? this.renderHScrollLayout(o, i, r.colCnt, e.dayMinWidth) : this.renderSimpleLayout(o, i);
  }
}
function dx(t, e) {
  let n = new qb(t.renderRange, e);
  return new Fb(n, /year|month|week/.test(t.currentRangeUnit));
}
class ux extends pc {
  // Computes the date range that will be rendered
  buildRenderRange(e, n, a) {
    let r = super.buildRenderRange(e, n, a), { props: o } = this;
    return mx({
      currentRange: r,
      snapToWeek: /^(year|month)$/.test(n),
      fixedWeekCount: o.fixedWeekCount,
      dateEnv: o.dateEnv
    });
  }
}
function mx(t) {
  let { dateEnv: e, currentRange: n } = t, { start: a, end: r } = n, o;
  if (t.snapToWeek && (a = e.startOfWeek(a), o = e.startOfWeek(r), o.valueOf() !== r.valueOf() && (r = dl(o, 1))), t.fixedWeekCount) {
    let i = e.startOfWeek(e.startOfMonth(X(n.end, -1))), l = Math.ceil(
      // could be partial weeks due to hiddenDays
      Mw(i, r)
    );
    r = dl(r, 6 - l);
  }
  return { start: a, end: r };
}
var hx = ':root{--fc-daygrid-event-dot-width:8px}.fc-daygrid-day-events:after,.fc-daygrid-day-events:before,.fc-daygrid-day-frame:after,.fc-daygrid-day-frame:before,.fc-daygrid-event-harness:after,.fc-daygrid-event-harness:before{clear:both;content:"";display:table}.fc .fc-daygrid-body{position:relative;z-index:1}.fc .fc-daygrid-day.fc-day-today{background-color:var(--fc-today-bg-color)}.fc .fc-daygrid-day-frame{min-height:100%;position:relative}.fc .fc-daygrid-day-top{display:flex;flex-direction:row-reverse}.fc .fc-day-other .fc-daygrid-day-top{opacity:.3}.fc .fc-daygrid-day-number{padding:4px;position:relative;z-index:4}.fc .fc-daygrid-month-start{font-size:1.1em;font-weight:700}.fc .fc-daygrid-day-events{margin-top:1px}.fc .fc-daygrid-body-balanced .fc-daygrid-day-events{left:0;position:absolute;right:0}.fc .fc-daygrid-body-unbalanced .fc-daygrid-day-events{min-height:2em;position:relative}.fc .fc-daygrid-body-natural .fc-daygrid-day-events{margin-bottom:1em}.fc .fc-daygrid-event-harness{position:relative}.fc .fc-daygrid-event-harness-abs{left:0;position:absolute;right:0;top:0}.fc .fc-daygrid-bg-harness{bottom:0;position:absolute;top:0}.fc .fc-daygrid-day-bg .fc-non-business{z-index:1}.fc .fc-daygrid-day-bg .fc-bg-event{z-index:2}.fc .fc-daygrid-day-bg .fc-highlight{z-index:3}.fc .fc-daygrid-event{margin-top:1px;z-index:6}.fc .fc-daygrid-event.fc-event-mirror{z-index:7}.fc .fc-daygrid-day-bottom{font-size:.85em;margin:0 2px}.fc .fc-daygrid-day-bottom:after,.fc .fc-daygrid-day-bottom:before{clear:both;content:"";display:table}.fc .fc-daygrid-more-link{border-radius:3px;cursor:pointer;line-height:1;margin-top:1px;max-width:100%;overflow:hidden;padding:2px;position:relative;white-space:nowrap;z-index:4}.fc .fc-daygrid-more-link:hover{background-color:rgba(0,0,0,.1)}.fc .fc-daygrid-week-number{background-color:var(--fc-neutral-bg-color);color:var(--fc-neutral-text-color);min-width:1.5em;padding:2px;position:absolute;text-align:center;top:0;z-index:5}.fc .fc-more-popover .fc-popover-body{min-width:220px;padding:10px}.fc-direction-ltr .fc-daygrid-event.fc-event-start,.fc-direction-rtl .fc-daygrid-event.fc-event-end{margin-left:2px}.fc-direction-ltr .fc-daygrid-event.fc-event-end,.fc-direction-rtl .fc-daygrid-event.fc-event-start{margin-right:2px}.fc-direction-ltr .fc-daygrid-more-link{float:left}.fc-direction-ltr .fc-daygrid-week-number{border-radius:0 0 3px 0;left:0}.fc-direction-rtl .fc-daygrid-more-link{float:right}.fc-direction-rtl .fc-daygrid-week-number{border-radius:0 0 0 3px;right:0}.fc-liquid-hack .fc-daygrid-day-frame{position:static}.fc-daygrid-event{border-radius:3px;font-size:var(--fc-small-font-size);position:relative;white-space:nowrap}.fc-daygrid-block-event .fc-event-time{font-weight:700}.fc-daygrid-block-event .fc-event-time,.fc-daygrid-block-event .fc-event-title{padding:1px}.fc-daygrid-dot-event{align-items:center;display:flex;padding:2px 0}.fc-daygrid-dot-event .fc-event-title{flex-grow:1;flex-shrink:1;font-weight:700;min-width:0;overflow:hidden}.fc-daygrid-dot-event.fc-event-mirror,.fc-daygrid-dot-event:hover{background:rgba(0,0,0,.1)}.fc-daygrid-dot-event.fc-event-selected:before{bottom:-10px;top:-10px}.fc-daygrid-event-dot{border:calc(var(--fc-daygrid-event-dot-width)/2) solid var(--fc-event-border-color);border-radius:calc(var(--fc-daygrid-event-dot-width)/2);box-sizing:content-box;height:0;margin:0 4px;width:0}.fc-direction-ltr .fc-daygrid-event .fc-event-time{margin-right:3px}.fc-direction-rtl .fc-daygrid-event .fc-event-time{margin-left:3px}';
Xs(hx);
var fx = ke({
  name: "@fullcalendar/daygrid",
  initialView: "dayGridMonth",
  views: {
    dayGrid: {
      component: cx,
      dateProfileGeneratorClass: ux
    },
    dayGridDay: {
      type: "dayGrid",
      duration: { days: 1 }
    },
    dayGridWeek: {
      type: "dayGrid",
      duration: { weeks: 1 }
    },
    dayGridMonth: {
      type: "dayGrid",
      duration: { months: 1 },
      fixedWeekCount: !0
    },
    dayGridYear: {
      type: "dayGrid",
      duration: { years: 1 }
    }
  }
});
h2.touchMouseIgnoreWait = 500;
let Co = 0, Mn = 0, Ao = !1;
class s1 {
  constructor(e) {
    this.subjectEl = null, this.selector = "", this.handleSelector = "", this.shouldIgnoreMove = !1, this.shouldWatchScroll = !0, this.isDragging = !1, this.isTouchDragging = !1, this.wasTouchScroll = !1, this.handleMouseDown = (n) => {
      if (!this.shouldIgnoreMouse() && px(n) && this.tryStart(n)) {
        let a = this.createEventFromMouse(n, !0);
        this.emitter.trigger("pointerdown", a), this.initScrollWatch(a), this.shouldIgnoreMove || document.addEventListener("mousemove", this.handleMouseMove), document.addEventListener("mouseup", this.handleMouseUp);
      }
    }, this.handleMouseMove = (n) => {
      let a = this.createEventFromMouse(n);
      this.recordCoords(a), this.emitter.trigger("pointermove", a);
    }, this.handleMouseUp = (n) => {
      document.removeEventListener("mousemove", this.handleMouseMove), document.removeEventListener("mouseup", this.handleMouseUp), this.emitter.trigger("pointerup", this.createEventFromMouse(n)), this.cleanup();
    }, this.handleTouchStart = (n) => {
      if (this.tryStart(n)) {
        this.isTouchDragging = !0;
        let a = this.createEventFromTouch(n, !0);
        this.emitter.trigger("pointerdown", a), this.initScrollWatch(a);
        let r = n.target;
        this.shouldIgnoreMove || r.addEventListener("touchmove", this.handleTouchMove), r.addEventListener("touchend", this.handleTouchEnd), r.addEventListener("touchcancel", this.handleTouchEnd), window.addEventListener("scroll", this.handleTouchScroll, !0);
      }
    }, this.handleTouchMove = (n) => {
      let a = this.createEventFromTouch(n);
      this.recordCoords(a), this.emitter.trigger("pointermove", a);
    }, this.handleTouchEnd = (n) => {
      if (this.isDragging) {
        let a = n.target;
        a.removeEventListener("touchmove", this.handleTouchMove), a.removeEventListener("touchend", this.handleTouchEnd), a.removeEventListener("touchcancel", this.handleTouchEnd), window.removeEventListener("scroll", this.handleTouchScroll, !0), this.emitter.trigger("pointerup", this.createEventFromTouch(n)), this.cleanup(), this.isTouchDragging = !1, gx();
      }
    }, this.handleTouchScroll = () => {
      this.wasTouchScroll = !0;
    }, this.handleScroll = (n) => {
      if (!this.shouldIgnoreMove) {
        let a = window.scrollX - this.prevScrollX + this.prevPageX, r = window.scrollY - this.prevScrollY + this.prevPageY;
        this.emitter.trigger("pointermove", {
          origEvent: n,
          isTouch: this.isTouchDragging,
          subjectEl: this.subjectEl,
          pageX: a,
          pageY: r,
          deltaX: a - this.origPageX,
          deltaY: r - this.origPageY
        });
      }
    }, this.containerEl = e, this.emitter = new jn(), e.addEventListener("mousedown", this.handleMouseDown), e.addEventListener("touchstart", this.handleTouchStart, { passive: !0 }), vx();
  }
  destroy() {
    this.containerEl.removeEventListener("mousedown", this.handleMouseDown), this.containerEl.removeEventListener("touchstart", this.handleTouchStart, { passive: !0 }), _x();
  }
  tryStart(e) {
    let n = this.querySubjectEl(e), a = e.target;
    return n && (!this.handleSelector || ae(a, this.handleSelector)) ? (this.subjectEl = n, this.isDragging = !0, this.wasTouchScroll = !1, !0) : !1;
  }
  cleanup() {
    Ao = !1, this.isDragging = !1, this.subjectEl = null, this.destroyScrollWatch();
  }
  querySubjectEl(e) {
    return this.selector ? ae(e.target, this.selector) : this.containerEl;
  }
  shouldIgnoreMouse() {
    return Co || this.isTouchDragging;
  }
  // can be called by user of this class, to cancel touch-based scrolling for the current drag
  cancelTouchScroll() {
    this.isDragging && (Ao = !0);
  }
  // Scrolling that simulates pointermoves
  // ----------------------------------------------------------------------------------------------------
  initScrollWatch(e) {
    this.shouldWatchScroll && (this.recordCoords(e), window.addEventListener("scroll", this.handleScroll, !0));
  }
  recordCoords(e) {
    this.shouldWatchScroll && (this.prevPageX = e.pageX, this.prevPageY = e.pageY, this.prevScrollX = window.scrollX, this.prevScrollY = window.scrollY);
  }
  destroyScrollWatch() {
    this.shouldWatchScroll && window.removeEventListener("scroll", this.handleScroll, !0);
  }
  // Event Normalization
  // ----------------------------------------------------------------------------------------------------
  createEventFromMouse(e, n) {
    let a = 0, r = 0;
    return n ? (this.origPageX = e.pageX, this.origPageY = e.pageY) : (a = e.pageX - this.origPageX, r = e.pageY - this.origPageY), {
      origEvent: e,
      isTouch: !1,
      subjectEl: this.subjectEl,
      pageX: e.pageX,
      pageY: e.pageY,
      deltaX: a,
      deltaY: r
    };
  }
  createEventFromTouch(e, n) {
    let a = e.touches, r, o, i = 0, l = 0;
    return a && a.length ? (r = a[0].pageX, o = a[0].pageY) : (r = e.pageX, o = e.pageY), n ? (this.origPageX = r, this.origPageY = o) : (i = r - this.origPageX, l = o - this.origPageY), {
      origEvent: e,
      isTouch: !0,
      subjectEl: this.subjectEl,
      pageX: r,
      pageY: o,
      deltaX: i,
      deltaY: l
    };
  }
}
function px(t) {
  return t.button === 0 && !t.ctrlKey;
}
function gx() {
  Co += 1, setTimeout(() => {
    Co -= 1;
  }, h2.touchMouseIgnoreWait);
}
function vx() {
  Mn += 1, Mn === 1 && window.addEventListener("touchmove", c1, { passive: !1 });
}
function _x() {
  Mn -= 1, Mn || window.removeEventListener("touchmove", c1, { passive: !1 });
}
function c1(t) {
  Ao && t.preventDefault();
}
class wx {
  constructor() {
    this.isVisible = !1, this.sourceEl = null, this.mirrorEl = null, this.sourceElRect = null, this.parentNode = document.body, this.zIndex = 9999, this.revertDuration = 0;
  }
  start(e, n, a) {
    this.sourceEl = e, this.sourceElRect = this.sourceEl.getBoundingClientRect(), this.origScreenX = n - window.scrollX, this.origScreenY = a - window.scrollY, this.deltaX = 0, this.deltaY = 0, this.updateElPosition();
  }
  handleMove(e, n) {
    this.deltaX = e - window.scrollX - this.origScreenX, this.deltaY = n - window.scrollY - this.origScreenY, this.updateElPosition();
  }
  // can be called before start
  setIsVisible(e) {
    e ? this.isVisible || (this.mirrorEl && (this.mirrorEl.style.display = ""), this.isVisible = e, this.updateElPosition()) : this.isVisible && (this.mirrorEl && (this.mirrorEl.style.display = "none"), this.isVisible = e);
  }
  // always async
  stop(e, n) {
    let a = () => {
      this.cleanup(), n();
    };
    e && this.mirrorEl && this.isVisible && this.revertDuration && // if 0, transition won't work
    (this.deltaX || this.deltaY) ? this.doRevertAnimation(a, this.revertDuration) : setTimeout(a, 0);
  }
  doRevertAnimation(e, n) {
    let a = this.mirrorEl, r = this.sourceEl.getBoundingClientRect();
    a.style.transition = "top " + n + "ms,left " + n + "ms", Mt(a, {
      left: r.left,
      top: r.top
    }), cw(a, () => {
      a.style.transition = "", e();
    });
  }
  cleanup() {
    this.mirrorEl && ($o(this.mirrorEl), this.mirrorEl = null), this.sourceEl = null;
  }
  updateElPosition() {
    this.sourceEl && this.isVisible && Mt(this.getMirrorEl(), {
      left: this.sourceElRect.left + this.deltaX,
      top: this.sourceElRect.top + this.deltaY
    });
  }
  getMirrorEl() {
    let e = this.sourceElRect, n = this.mirrorEl;
    return n || (n = this.mirrorEl = this.sourceEl.cloneNode(!0), n.style.userSelect = "none", n.style.webkitUserSelect = "none", n.style.pointerEvents = "none", n.classList.add("fc-event-dragging"), Mt(n, {
      position: "fixed",
      zIndex: this.zIndex,
      visibility: "",
      boxSizing: "border-box",
      width: e.right - e.left,
      height: e.bottom - e.top,
      right: "auto",
      bottom: "auto",
      margin: 0
    }), this.parentNode.appendChild(n)), n;
  }
}
class d1 extends m2 {
  constructor(e, n) {
    super(), this.handleScroll = () => {
      this.scrollTop = this.scrollController.getScrollTop(), this.scrollLeft = this.scrollController.getScrollLeft(), this.handleScrollChange();
    }, this.scrollController = e, this.doesListening = n, this.scrollTop = this.origScrollTop = e.getScrollTop(), this.scrollLeft = this.origScrollLeft = e.getScrollLeft(), this.scrollWidth = e.getScrollWidth(), this.scrollHeight = e.getScrollHeight(), this.clientWidth = e.getClientWidth(), this.clientHeight = e.getClientHeight(), this.clientRect = this.computeClientRect(), this.doesListening && this.getEventTarget().addEventListener("scroll", this.handleScroll);
  }
  destroy() {
    this.doesListening && this.getEventTarget().removeEventListener("scroll", this.handleScroll);
  }
  getScrollTop() {
    return this.scrollTop;
  }
  getScrollLeft() {
    return this.scrollLeft;
  }
  setScrollTop(e) {
    this.scrollController.setScrollTop(e), this.doesListening || (this.scrollTop = Math.max(Math.min(e, this.getMaxScrollTop()), 0), this.handleScrollChange());
  }
  setScrollLeft(e) {
    this.scrollController.setScrollLeft(e), this.doesListening || (this.scrollLeft = Math.max(Math.min(e, this.getMaxScrollLeft()), 0), this.handleScrollChange());
  }
  getClientWidth() {
    return this.clientWidth;
  }
  getClientHeight() {
    return this.clientHeight;
  }
  getScrollWidth() {
    return this.scrollWidth;
  }
  getScrollHeight() {
    return this.scrollHeight;
  }
  handleScrollChange() {
  }
}
class u1 extends d1 {
  constructor(e, n) {
    super(new Ib(e), n);
  }
  getEventTarget() {
    return this.scrollController.el;
  }
  computeClientRect() {
    return Rb(this.scrollController.el);
  }
}
class yx extends d1 {
  constructor(e) {
    super(new kb(), e);
  }
  getEventTarget() {
    return window;
  }
  computeClientRect() {
    return {
      left: this.scrollLeft,
      right: this.scrollLeft + this.clientWidth,
      top: this.scrollTop,
      bottom: this.scrollTop + this.clientHeight
    };
  }
  // the window is the only scroll object that changes it's rectangle relative
  // to the document's topleft as it scrolls
  handleScrollChange() {
    this.clientRect = this.computeClientRect();
  }
}
const Pl = typeof performance == "function" ? performance.now : Date.now;
class bx {
  constructor() {
    this.isEnabled = !0, this.scrollQuery = [window, ".fc-scroller"], this.edgeThreshold = 50, this.maxVelocity = 300, this.pointerScreenX = null, this.pointerScreenY = null, this.isAnimating = !1, this.scrollCaches = null, this.everMovedUp = !1, this.everMovedDown = !1, this.everMovedLeft = !1, this.everMovedRight = !1, this.animate = () => {
      if (this.isAnimating) {
        let e = this.computeBestEdge(this.pointerScreenX + window.scrollX, this.pointerScreenY + window.scrollY);
        if (e) {
          let n = Pl();
          this.handleSide(e, (n - this.msSinceRequest) / 1e3), this.requestAnimation(n);
        } else
          this.isAnimating = !1;
      }
    };
  }
  start(e, n, a) {
    this.isEnabled && (this.scrollCaches = this.buildCaches(a), this.pointerScreenX = null, this.pointerScreenY = null, this.everMovedUp = !1, this.everMovedDown = !1, this.everMovedLeft = !1, this.everMovedRight = !1, this.handleMove(e, n));
  }
  handleMove(e, n) {
    if (this.isEnabled) {
      let a = e - window.scrollX, r = n - window.scrollY, o = this.pointerScreenY === null ? 0 : r - this.pointerScreenY, i = this.pointerScreenX === null ? 0 : a - this.pointerScreenX;
      o < 0 ? this.everMovedUp = !0 : o > 0 && (this.everMovedDown = !0), i < 0 ? this.everMovedLeft = !0 : i > 0 && (this.everMovedRight = !0), this.pointerScreenX = a, this.pointerScreenY = r, this.isAnimating || (this.isAnimating = !0, this.requestAnimation(Pl()));
    }
  }
  stop() {
    if (this.isEnabled) {
      this.isAnimating = !1;
      for (let e of this.scrollCaches)
        e.destroy();
      this.scrollCaches = null;
    }
  }
  requestAnimation(e) {
    this.msSinceRequest = e, requestAnimationFrame(this.animate);
  }
  handleSide(e, n) {
    let { scrollCache: a } = e, { edgeThreshold: r } = this, o = r - e.distance, i = (
      // the closer to the edge, the faster we scroll
      o * o / (r * r) * // quadratic
      this.maxVelocity * n
    ), l = 1;
    switch (e.name) {
      case "left":
        l = -1;
      // falls through
      case "right":
        a.setScrollLeft(a.getScrollLeft() + i * l);
        break;
      case "top":
        l = -1;
      // falls through
      case "bottom":
        a.setScrollTop(a.getScrollTop() + i * l);
        break;
    }
  }
  // left/top are relative to document topleft
  computeBestEdge(e, n) {
    let { edgeThreshold: a } = this, r = null, o = this.scrollCaches || [];
    for (let i of o) {
      let l = i.clientRect, s = e - l.left, u = l.right - e, d = n - l.top, g = l.bottom - n;
      s >= 0 && u >= 0 && d >= 0 && g >= 0 && (d <= a && this.everMovedUp && i.canScrollUp() && (!r || r.distance > d) && (r = { scrollCache: i, name: "top", distance: d }), g <= a && this.everMovedDown && i.canScrollDown() && (!r || r.distance > g) && (r = { scrollCache: i, name: "bottom", distance: g }), s <= a && this.everMovedLeft && i.canScrollLeft() && (!r || r.distance > s) && (r = { scrollCache: i, name: "left", distance: s }), u <= a && this.everMovedRight && i.canScrollRight() && (!r || r.distance > u) && (r = { scrollCache: i, name: "right", distance: u }));
    }
    return r;
  }
  buildCaches(e) {
    return this.queryScrollEls(e).map((n) => n === window ? new yx(!1) : new u1(n, !1));
  }
  queryScrollEls(e) {
    let n = [];
    for (let a of this.scrollQuery)
      typeof a == "object" ? n.push(a) : n.push(...Array.prototype.slice.call(e.getRootNode().querySelectorAll(a)));
    return n;
  }
}
class qt extends Vb {
  constructor(e, n) {
    super(e), this.containerEl = e, this.delay = null, this.minDistance = 0, this.touchScrollAllowed = !0, this.mirrorNeedsRevert = !1, this.isInteracting = !1, this.isDragging = !1, this.isDelayEnded = !1, this.isDistanceSurpassed = !1, this.delayTimeoutId = null, this.onPointerDown = (r) => {
      this.isDragging || (this.isInteracting = !0, this.isDelayEnded = !1, this.isDistanceSurpassed = !1, dw(document.body), mw(document.body), r.isTouch || r.origEvent.preventDefault(), this.emitter.trigger("pointerdown", r), this.isInteracting && // not destroyed via pointerdown handler
      !this.pointer.shouldIgnoreMove && (this.mirror.setIsVisible(!1), this.mirror.start(r.subjectEl, r.pageX, r.pageY), this.startDelay(r), this.minDistance || this.handleDistanceSurpassed(r)));
    }, this.onPointerMove = (r) => {
      if (this.isInteracting) {
        if (this.emitter.trigger("pointermove", r), !this.isDistanceSurpassed) {
          let o = this.minDistance, i, { deltaX: l, deltaY: s } = r;
          i = l * l + s * s, i >= o * o && this.handleDistanceSurpassed(r);
        }
        this.isDragging && (r.origEvent.type !== "scroll" && (this.mirror.handleMove(r.pageX, r.pageY), this.autoScroller.handleMove(r.pageX, r.pageY)), this.emitter.trigger("dragmove", r));
      }
    }, this.onPointerUp = (r) => {
      this.isInteracting && (this.isInteracting = !1, uw(document.body), hw(document.body), this.emitter.trigger("pointerup", r), this.isDragging && (this.autoScroller.stop(), this.tryStopDrag(r)), this.delayTimeoutId && (clearTimeout(this.delayTimeoutId), this.delayTimeoutId = null));
    };
    let a = this.pointer = new s1(e);
    a.emitter.on("pointerdown", this.onPointerDown), a.emitter.on("pointermove", this.onPointerMove), a.emitter.on("pointerup", this.onPointerUp), n && (a.selector = n), this.mirror = new wx(), this.autoScroller = new bx();
  }
  destroy() {
    this.pointer.destroy(), this.onPointerUp({});
  }
  startDelay(e) {
    typeof this.delay == "number" ? this.delayTimeoutId = setTimeout(() => {
      this.delayTimeoutId = null, this.handleDelayEnd(e);
    }, this.delay) : this.handleDelayEnd(e);
  }
  handleDelayEnd(e) {
    this.isDelayEnded = !0, this.tryStartDrag(e);
  }
  handleDistanceSurpassed(e) {
    this.isDistanceSurpassed = !0, this.tryStartDrag(e);
  }
  tryStartDrag(e) {
    this.isDelayEnded && this.isDistanceSurpassed && (!this.pointer.wasTouchScroll || this.touchScrollAllowed) && (this.isDragging = !0, this.mirrorNeedsRevert = !1, this.autoScroller.start(e.pageX, e.pageY, this.containerEl), this.emitter.trigger("dragstart", e), this.touchScrollAllowed === !1 && this.pointer.cancelTouchScroll());
  }
  tryStopDrag(e) {
    this.mirror.stop(this.mirrorNeedsRevert, this.stopDrag.bind(this, e));
  }
  stopDrag(e) {
    this.isDragging = !1, this.emitter.trigger("dragend", e);
  }
  // fill in the implementations...
  setIgnoreMove(e) {
    this.pointer.shouldIgnoreMove = e;
  }
  setMirrorIsVisible(e) {
    this.mirror.setIsVisible(e);
  }
  setMirrorNeedsRevert(e) {
    this.mirrorNeedsRevert = e;
  }
  setAutoScrollEnabled(e) {
    this.autoScroller.isEnabled = e;
  }
}
class Cx {
  constructor(e) {
    this.el = e, this.origRect = u2(e), this.scrollCaches = zc(e).map((n) => new u1(n, !0));
  }
  destroy() {
    for (let e of this.scrollCaches)
      e.destroy();
  }
  computeLeft() {
    let e = this.origRect.left;
    for (let n of this.scrollCaches)
      e += n.origScrollLeft - n.getScrollLeft();
    return e;
  }
  computeTop() {
    let e = this.origRect.top;
    for (let n of this.scrollCaches)
      e += n.origScrollTop - n.getScrollTop();
    return e;
  }
  isWithinClipping(e, n) {
    let a = { left: e, top: n };
    for (let r of this.scrollCaches)
      if (!Ax(r.getEventTarget()) && !wb(a, r.clientRect))
        return !1;
    return !0;
  }
}
function Ax(t) {
  let e = t.tagName;
  return e === "HTML" || e === "BODY";
}
class Fn {
  constructor(e, n) {
    this.useSubjectCenter = !1, this.requireInitial = !0, this.disablePointCheck = !1, this.initialHit = null, this.movingHit = null, this.finalHit = null, this.handlePointerDown = (a) => {
      let { dragging: r } = this;
      this.initialHit = null, this.movingHit = null, this.finalHit = null, this.prepareHits(), this.processFirstCoord(a), this.initialHit || !this.requireInitial ? (r.setIgnoreMove(!1), this.emitter.trigger("pointerdown", a)) : r.setIgnoreMove(!0);
    }, this.handleDragStart = (a) => {
      this.emitter.trigger("dragstart", a), this.handleMove(a, !0);
    }, this.handleDragMove = (a) => {
      this.emitter.trigger("dragmove", a), this.handleMove(a);
    }, this.handlePointerUp = (a) => {
      this.releaseHits(), this.emitter.trigger("pointerup", a);
    }, this.handleDragEnd = (a) => {
      this.movingHit && this.emitter.trigger("hitupdate", null, !0, a), this.finalHit = this.movingHit, this.movingHit = null, this.emitter.trigger("dragend", a);
    }, this.droppableStore = n, e.emitter.on("pointerdown", this.handlePointerDown), e.emitter.on("dragstart", this.handleDragStart), e.emitter.on("dragmove", this.handleDragMove), e.emitter.on("pointerup", this.handlePointerUp), e.emitter.on("dragend", this.handleDragEnd), this.dragging = e, this.emitter = new jn();
  }
  // sets initialHit
  // sets coordAdjust
  processFirstCoord(e) {
    let n = { left: e.pageX, top: e.pageY }, a = n, r = e.subjectEl, o;
    r instanceof HTMLElement && (o = u2(r), a = yb(a, o));
    let i = this.initialHit = this.queryHitForOffset(a.left, a.top);
    if (i) {
      if (this.useSubjectCenter && o) {
        let l = Hc(o, i.rect);
        l && (a = bb(l));
      }
      this.coordAdjust = Cb(a, n);
    } else
      this.coordAdjust = { left: 0, top: 0 };
  }
  handleMove(e, n) {
    let a = this.queryHitForOffset(e.pageX + this.coordAdjust.left, e.pageY + this.coordAdjust.top);
    (n || !Un(this.movingHit, a)) && (this.movingHit = a, this.emitter.trigger("hitupdate", a, !1, e));
  }
  prepareHits() {
    this.offsetTrackers = et(this.droppableStore, (e) => (e.component.prepareHits(), new Cx(e.el)));
  }
  releaseHits() {
    let { offsetTrackers: e } = this;
    for (let n in e)
      e[n].destroy();
    this.offsetTrackers = {};
  }
  queryHitForOffset(e, n) {
    let { droppableStore: a, offsetTrackers: r } = this, o = null;
    for (let i in a) {
      let l = a[i].component, s = r[i];
      if (s && // wasn't destroyed mid-drag
      s.isWithinClipping(e, n)) {
        let u = s.computeLeft(), d = s.computeTop(), g = e - u, v = n - d, { origRect: p } = s, w = p.right - p.left, _ = p.bottom - p.top;
        if (
          // must be within the element's bounds
          g >= 0 && g < w && v >= 0 && v < _
        ) {
          let y = l.queryHit(g, v, w, _);
          y && // make sure the hit is within activeRange, meaning it's not a dead cell
          Nn(y.dateProfile.activeRange, y.dateSpan.range) && // Ensure the component we are querying for the hit is accessibly my the pointer
          // Prevents obscured calendars (ex: under a modal dialog) from accepting hit
          // https://github.com/fullcalendar/fullcalendar/issues/5026
          (this.disablePointCheck || s.el.contains(s.el.getRootNode().elementFromPoint(
            // add-back origins to get coordinate relative to top-left of window viewport
            g + u - window.scrollX,
            v + d - window.scrollY
          ))) && (!o || y.layer > o.layer) && (y.componentId = i, y.context = l.context, y.rect.left += u, y.rect.right += u, y.rect.top += d, y.rect.bottom += d, o = y);
        }
      }
    }
    return o;
  }
}
function Un(t, e) {
  return !t && !e ? !0 : !!t != !!e ? !1 : sb(t.dateSpan, e.dateSpan);
}
function m1(t, e) {
  let n = {};
  for (let a of e.pluginHooks.datePointTransforms)
    Object.assign(n, a(t, e));
  return Object.assign(n, xx(t, e.dateEnv)), n;
}
function xx(t, e) {
  return {
    date: e.toDate(t.range.start),
    dateStr: e.formatIso(t.range.start, { omitTime: t.allDay }),
    allDay: t.allDay
  };
}
class Ex extends bt {
  constructor(e) {
    super(e), this.handlePointerDown = (a) => {
      let { dragging: r } = this, o = a.origEvent.target;
      r.setIgnoreMove(!this.component.isValidDateDownEl(o));
    }, this.handleDragEnd = (a) => {
      let { component: r } = this, { pointer: o } = this.dragging;
      if (!o.wasTouchScroll) {
        let { initialHit: i, finalHit: l } = this.hitDragging;
        if (i && l && Un(i, l)) {
          let { context: s } = r, u = Object.assign(Object.assign({}, m1(i.dateSpan, s)), { dayEl: i.dayEl, jsEvent: a.origEvent, view: s.viewApi || s.calendarApi.view });
          s.emitter.trigger("dateClick", u);
        }
      }
    }, this.dragging = new qt(e.el), this.dragging.autoScroller.isEnabled = !1;
    let n = this.hitDragging = new Fn(this.dragging, c2(e));
    n.emitter.on("pointerdown", this.handlePointerDown), n.emitter.on("dragend", this.handleDragEnd);
  }
  destroy() {
    this.dragging.destroy();
  }
}
class Sx extends bt {
  constructor(e) {
    super(e), this.dragSelection = null, this.handlePointerDown = (i) => {
      let { component: l, dragging: s } = this, { options: u } = l.context, d = u.selectable && l.isValidDateDownEl(i.origEvent.target);
      s.setIgnoreMove(!d), s.delay = i.isTouch ? Mx(l) : null;
    }, this.handleDragStart = (i) => {
      this.component.context.calendarApi.unselect(i);
    }, this.handleHitUpdate = (i, l) => {
      let { context: s } = this.component, u = null, d = !1;
      if (i) {
        let g = this.hitDragging.initialHit;
        i.componentId === g.componentId && this.isHitComboAllowed && !this.isHitComboAllowed(g, i) || (u = Dx(g, i, s.pluginHooks.dateSelectionTransformers)), (!u || !Wb(u, i.dateProfile, s)) && (d = !0, u = null);
      }
      u ? s.dispatch({ type: "SELECT_DATES", selection: u }) : l || s.dispatch({ type: "UNSELECT_DATES" }), d ? Qo() : Yo(), l || (this.dragSelection = u);
    }, this.handlePointerUp = (i) => {
      this.dragSelection && (Ac(this.dragSelection, i, this.component.context), this.dragSelection = null);
    };
    let { component: n } = e, { options: a } = n.context, r = this.dragging = new qt(e.el);
    r.touchScrollAllowed = !1, r.minDistance = a.selectMinDistance || 0, r.autoScroller.isEnabled = a.dragScroll;
    let o = this.hitDragging = new Fn(this.dragging, c2(e));
    o.emitter.on("pointerdown", this.handlePointerDown), o.emitter.on("dragstart", this.handleDragStart), o.emitter.on("hitupdate", this.handleHitUpdate), o.emitter.on("pointerup", this.handlePointerUp);
  }
  destroy() {
    this.dragging.destroy();
  }
}
function Mx(t) {
  let { options: e } = t.context, n = e.selectLongPressDelay;
  return n == null && (n = e.longPressDelay), n;
}
function Dx(t, e, n) {
  let a = t.dateSpan, r = e.dateSpan, o = [
    a.range.start,
    a.range.end,
    r.range.start,
    r.range.end
  ];
  o.sort(_w);
  let i = {};
  for (let l of n) {
    let s = l(t, e);
    if (s === !1)
      return null;
    s && Object.assign(i, s);
  }
  return i.range = { start: o[0], end: o[3] }, i.allDay = a.allDay, i;
}
class Ft extends bt {
  constructor(e) {
    super(e), this.subjectEl = null, this.subjectSeg = null, this.isDragging = !1, this.eventRange = null, this.relevantEvents = null, this.receivingContext = null, this.validMutation = null, this.mutatedRelevantEvents = null, this.handlePointerDown = (i) => {
      let l = i.origEvent.target, { component: s, dragging: u } = this, { mirror: d } = u, { options: g } = s.context, v = s.context;
      this.subjectEl = i.subjectEl;
      let p = this.subjectSeg = vt(i.subjectEl), _ = (this.eventRange = p.eventRange).instance.instanceId;
      this.relevantEvents = o2(v.getCurrentData().eventStore, _), u.minDistance = i.isTouch ? 0 : g.eventDragMinDistance, u.delay = // only do a touch delay if touch and this event hasn't been selected yet
      i.isTouch && _ !== s.props.eventSelection ? Rx(s) : null, g.fixedMirrorParent ? d.parentNode = g.fixedMirrorParent : d.parentNode = ae(l, ".fc"), d.revertDuration = g.dragRevertDuration;
      let y = s.isValidSegDownEl(l) && !ae(l, ".fc-event-resizer");
      u.setIgnoreMove(!y), this.isDragging = y && i.subjectEl.classList.contains("fc-event-draggable");
    }, this.handleDragStart = (i) => {
      let l = this.component.context, s = this.eventRange, u = s.instance.instanceId;
      i.isTouch ? u !== this.component.props.eventSelection && l.dispatch({ type: "SELECT_EVENT", eventInstanceId: u }) : l.dispatch({ type: "UNSELECT_EVENT" }), this.isDragging && (l.calendarApi.unselect(i), l.emitter.trigger("eventDragStart", {
        el: this.subjectEl,
        event: new $(l, s.def, s.instance),
        jsEvent: i.origEvent,
        view: l.viewApi
      }));
    }, this.handleHitUpdate = (i, l) => {
      if (!this.isDragging)
        return;
      let s = this.relevantEvents, u = this.hitDragging.initialHit, d = this.component.context, g = null, v = null, p = null, w = !1, _ = {
        affectedEvents: s,
        mutatedEvents: fe(),
        isEvent: !0
      };
      if (i) {
        g = i.context;
        let y = g.options;
        d === g || y.editable && y.droppable ? (v = Tx(u, i, this.eventRange.instance.range.start, g.getCurrentData().pluginHooks.eventDragMutationMassagers), v && (p = s2(s, g.getCurrentData().eventUiBases, v, g), _.mutatedEvents = p, Lc(_, i.dateProfile, g) || (w = !0, v = null, p = null, _.mutatedEvents = fe()))) : g = null;
      }
      this.displayDrag(g, _), w ? Qo() : Yo(), l || (d === g && // TODO: write test for this
      Un(u, i) && (v = null), this.dragging.setMirrorNeedsRevert(!v), this.dragging.setMirrorIsVisible(!i || !this.subjectEl.getRootNode().querySelector(".fc-event-mirror")), this.receivingContext = g, this.validMutation = v, this.mutatedRelevantEvents = p);
    }, this.handlePointerUp = () => {
      this.isDragging || this.cleanup();
    }, this.handleDragEnd = (i) => {
      if (this.isDragging) {
        let l = this.component.context, s = l.viewApi, { receivingContext: u, validMutation: d } = this, g = this.eventRange.def, v = this.eventRange.instance, p = new $(l, g, v), w = this.relevantEvents, _ = this.mutatedRelevantEvents, { finalHit: y } = this.hitDragging;
        if (this.clearDrag(), l.emitter.trigger("eventDragStop", {
          el: this.subjectEl,
          event: p,
          jsEvent: i.origEvent,
          view: s
        }), d) {
          if (u === l) {
            let A = new $(l, _.defs[g.defId], v ? _.instances[v.instanceId] : null);
            l.dispatch({
              type: "MERGE_EVENTS",
              eventStore: _
            });
            let E = {
              oldEvent: p,
              event: A,
              relatedEvents: qe(_, l, v),
              revert() {
                l.dispatch({
                  type: "MERGE_EVENTS",
                  eventStore: w
                  // the pre-change data
                });
              }
            }, S = {};
            for (let M of l.getCurrentData().pluginHooks.eventDropTransformers)
              Object.assign(S, M(d, l));
            l.emitter.trigger("eventDrop", Object.assign(Object.assign(Object.assign({}, E), S), { el: i.subjectEl, delta: d.datesDelta, jsEvent: i.origEvent, view: s })), l.emitter.trigger("eventChange", E);
          } else if (u) {
            let A = {
              event: p,
              relatedEvents: qe(w, l, v),
              revert() {
                l.dispatch({
                  type: "MERGE_EVENTS",
                  eventStore: w
                });
              }
            };
            l.emitter.trigger("eventLeave", Object.assign(Object.assign({}, A), { draggedEl: i.subjectEl, view: s })), l.dispatch({
              type: "REMOVE_EVENTS",
              eventStore: w
            }), l.emitter.trigger("eventRemove", A);
            let E = _.defs[g.defId], S = _.instances[v.instanceId], M = new $(u, E, S);
            u.dispatch({
              type: "MERGE_EVENTS",
              eventStore: _
            });
            let P = {
              event: M,
              relatedEvents: qe(_, u, S),
              revert() {
                u.dispatch({
                  type: "REMOVE_EVENTS",
                  eventStore: _
                });
              }
            };
            u.emitter.trigger("eventAdd", P), i.isTouch && u.dispatch({
              type: "SELECT_EVENT",
              eventInstanceId: v.instanceId
            }), u.emitter.trigger("drop", Object.assign(Object.assign({}, m1(y.dateSpan, u)), { draggedEl: i.subjectEl, jsEvent: i.origEvent, view: y.context.viewApi })), u.emitter.trigger("eventReceive", Object.assign(Object.assign({}, P), { draggedEl: i.subjectEl, view: y.context.viewApi }));
          }
        } else
          l.emitter.trigger("_noEventDrop");
      }
      this.cleanup();
    };
    let { component: n } = this, { options: a } = n.context, r = this.dragging = new qt(e.el);
    r.pointer.selector = Ft.SELECTOR, r.touchScrollAllowed = !1, r.autoScroller.isEnabled = a.dragScroll;
    let o = this.hitDragging = new Fn(this.dragging, wo);
    o.useSubjectCenter = e.useEventCenter, o.emitter.on("pointerdown", this.handlePointerDown), o.emitter.on("dragstart", this.handleDragStart), o.emitter.on("hitupdate", this.handleHitUpdate), o.emitter.on("pointerup", this.handlePointerUp), o.emitter.on("dragend", this.handleDragEnd);
  }
  destroy() {
    this.dragging.destroy();
  }
  // render a drag state on the next receivingCalendar
  displayDrag(e, n) {
    let a = this.component.context, r = this.receivingContext;
    r && r !== e && (r === a ? r.dispatch({
      type: "SET_EVENT_DRAG",
      state: {
        affectedEvents: n.affectedEvents,
        mutatedEvents: fe(),
        isEvent: !0
      }
    }) : r.dispatch({ type: "UNSET_EVENT_DRAG" })), e && e.dispatch({ type: "SET_EVENT_DRAG", state: n });
  }
  clearDrag() {
    let e = this.component.context, { receivingContext: n } = this;
    n && n.dispatch({ type: "UNSET_EVENT_DRAG" }), e !== n && e.dispatch({ type: "UNSET_EVENT_DRAG" });
  }
  cleanup() {
    this.subjectSeg = null, this.isDragging = !1, this.eventRange = null, this.relevantEvents = null, this.receivingContext = null, this.validMutation = null, this.mutatedRelevantEvents = null;
  }
}
Ft.SELECTOR = ".fc-event-draggable, .fc-event-resizable";
function Tx(t, e, n, a) {
  let r = t.dateSpan, o = e.dateSpan, i = r.range.start, l = o.range.start, s = {};
  r.allDay !== o.allDay && (s.allDay = o.allDay, s.hasEnd = e.context.options.allDayMaintainDuration, o.allDay ? i = G(n) : i = n);
  let u = st(i, l, t.context.dateEnv, t.componentId === e.componentId ? t.largeUnit : null);
  u.milliseconds && (s.allDay = !1);
  let d = {
    datesDelta: u,
    standardProps: s
  };
  for (let g of a)
    g(d, t, e);
  return d;
}
function Rx(t) {
  let { options: e } = t.context, n = e.eventLongPressDelay;
  return n == null && (n = e.longPressDelay), n;
}
class Hx extends bt {
  constructor(e) {
    super(e), this.draggingSegEl = null, this.draggingSeg = null, this.eventRange = null, this.relevantEvents = null, this.validMutation = null, this.mutatedRelevantEvents = null, this.handlePointerDown = (o) => {
      let { component: i } = this, l = this.querySegEl(o), s = vt(l), u = this.eventRange = s.eventRange;
      this.dragging.minDistance = i.context.options.eventDragMinDistance, this.dragging.setIgnoreMove(!this.component.isValidSegDownEl(o.origEvent.target) || o.isTouch && this.component.props.eventSelection !== u.instance.instanceId);
    }, this.handleDragStart = (o) => {
      let { context: i } = this.component, l = this.eventRange;
      this.relevantEvents = o2(i.getCurrentData().eventStore, this.eventRange.instance.instanceId);
      let s = this.querySegEl(o);
      this.draggingSegEl = s, this.draggingSeg = vt(s), i.calendarApi.unselect(), i.emitter.trigger("eventResizeStart", {
        el: s,
        event: new $(i, l.def, l.instance),
        jsEvent: o.origEvent,
        view: i.viewApi
      });
    }, this.handleHitUpdate = (o, i, l) => {
      let { context: s } = this.component, u = this.relevantEvents, d = this.hitDragging.initialHit, g = this.eventRange.instance, v = null, p = null, w = !1, _ = {
        affectedEvents: u,
        mutatedEvents: fe(),
        isEvent: !0
      };
      o && (o.componentId === d.componentId && this.isHitComboAllowed && !this.isHitComboAllowed(d, o) || (v = Ix(d, o, l.subjectEl.classList.contains("fc-event-resizer-start"), g.range))), v && (p = s2(u, s.getCurrentData().eventUiBases, v, s), _.mutatedEvents = p, Lc(_, o.dateProfile, s) || (w = !0, v = null, p = null, _.mutatedEvents = null)), p ? s.dispatch({
        type: "SET_EVENT_RESIZE",
        state: _
      }) : s.dispatch({ type: "UNSET_EVENT_RESIZE" }), w ? Qo() : Yo(), i || (v && Un(d, o) && (v = null), this.validMutation = v, this.mutatedRelevantEvents = p);
    }, this.handleDragEnd = (o) => {
      let { context: i } = this.component, l = this.eventRange.def, s = this.eventRange.instance, u = new $(i, l, s), d = this.relevantEvents, g = this.mutatedRelevantEvents;
      if (i.emitter.trigger("eventResizeStop", {
        el: this.draggingSegEl,
        event: u,
        jsEvent: o.origEvent,
        view: i.viewApi
      }), this.validMutation) {
        let v = new $(i, g.defs[l.defId], s ? g.instances[s.instanceId] : null);
        i.dispatch({
          type: "MERGE_EVENTS",
          eventStore: g
        });
        let p = {
          oldEvent: u,
          event: v,
          relatedEvents: qe(g, i, s),
          revert() {
            i.dispatch({
              type: "MERGE_EVENTS",
              eventStore: d
              // the pre-change events
            });
          }
        };
        i.emitter.trigger("eventResize", Object.assign(Object.assign({}, p), { el: this.draggingSegEl, startDelta: this.validMutation.startDelta || L(0), endDelta: this.validMutation.endDelta || L(0), jsEvent: o.origEvent, view: i.viewApi })), i.emitter.trigger("eventChange", p);
      } else
        i.emitter.trigger("_noEventResize");
      this.draggingSeg = null, this.relevantEvents = null, this.validMutation = null;
    };
    let { component: n } = e, a = this.dragging = new qt(e.el);
    a.pointer.selector = ".fc-event-resizer", a.touchScrollAllowed = !1, a.autoScroller.isEnabled = n.context.options.dragScroll;
    let r = this.hitDragging = new Fn(this.dragging, c2(e));
    r.emitter.on("pointerdown", this.handlePointerDown), r.emitter.on("dragstart", this.handleDragStart), r.emitter.on("hitupdate", this.handleHitUpdate), r.emitter.on("dragend", this.handleDragEnd);
  }
  destroy() {
    this.dragging.destroy();
  }
  querySegEl(e) {
    return ae(e.subjectEl, ".fc-event");
  }
}
function Ix(t, e, n, a) {
  let r = t.context.dateEnv, o = t.dateSpan.range.start, i = e.dateSpan.range.start, l = st(o, i, r, t.largeUnit);
  if (n) {
    if (r.add(a.start, l) < a.end)
      return { startDelta: l };
  } else if (r.add(a.end, l) > a.start)
    return { endDelta: l };
  return null;
}
class kx {
  constructor(e) {
    this.context = e, this.isRecentPointerDateSelect = !1, this.matchesCancel = !1, this.matchesEvent = !1, this.onSelect = (a) => {
      a.jsEvent && (this.isRecentPointerDateSelect = !0);
    }, this.onDocumentPointerDown = (a) => {
      let r = this.context.options.unselectCancel, o = nc(a.origEvent);
      this.matchesCancel = !!ae(o, r), this.matchesEvent = !!ae(o, Ft.SELECTOR);
    }, this.onDocumentPointerUp = (a) => {
      let { context: r } = this, { documentPointer: o } = this, i = r.getCurrentData();
      if (!o.wasTouchScroll) {
        if (i.dateSelection && // an existing date selection?
        !this.isRecentPointerDateSelect) {
          let l = r.options.unselectAuto;
          l && (!l || !this.matchesCancel) && r.calendarApi.unselect(a);
        }
        i.eventSelection && // an existing event selected?
        !this.matchesEvent && r.dispatch({ type: "UNSELECT_EVENT" });
      }
      this.isRecentPointerDateSelect = !1;
    };
    let n = this.documentPointer = new s1(document);
    n.shouldIgnoreMove = !0, n.shouldWatchScroll = !1, n.emitter.on("pointerdown", this.onDocumentPointerDown), n.emitter.on("pointerup", this.onDocumentPointerUp), e.emitter.on("select", this.onSelect);
  }
  destroy() {
    this.context.emitter.off("select", this.onSelect), this.documentPointer.destroy();
  }
}
const zx = {
  fixedMirrorParent: b
}, Vx = {
  dateClick: b,
  eventDragStart: b,
  eventDragStop: b,
  eventDrop: b,
  eventResizeStart: b,
  eventResizeStop: b,
  eventResize: b,
  drop: b,
  eventReceive: b,
  eventLeave: b
};
h2.dataAttrPrefix = "";
var Ox = ke({
  name: "@fullcalendar/interaction",
  componentInteractions: [Ex, Sx, Ft, Hx],
  calendarInteractions: [kx],
  elementDraggingImpl: qt,
  optionRefiners: zx,
  listenerRefiners: Vx
});
const Bx = { id: "calendar" }, Lx = /* @__PURE__ */ f({
  __name: "index",
  props: {
    // 语言
    local: {
      type: String,
      default: "zh-cn"
    },
    // 视图模式
    initalView: {
      type: String,
      default: "dayGridMonth"
    },
    // 按钮文字
    buttonText: {
      type: Object,
      default: () => ({
        today: "今天",
        month: "月",
        week: "周",
        day: "日",
        prevYear: "上一年",
        nextYear: "下一年",
        prev: "上一月",
        next: "下一月"
      })
    },
    // 头部工具栏
    headerToolbar: {
      type: Object,
      default: () => ({
        start: "title",
        center: "",
        end: "prev today next"
      })
    },
    // 底部工具栏
    footerToolbar: {
      type: Object,
      default: () => ({})
    },
    // 事件源
    events: {
      type: Array,
      default: () => []
    },
    // 日历显示结束时间
    displayEventEnd: {
      type: Boolean,
      default: !1
    },
    // 自定义渲染日历内容
    eventContent: {
      type: Function
    }
  },
  emits: ["dateClick", "eventClick"],
  setup(t, { emit: e }) {
    let n = t, a = e, r = N(), o = () => {
      let i = document.getElementById("calendar");
      i && (r.value = new jA(i, {
        // 日历插件
        plugins: [fx, Ox],
        locale: n.local,
        initialView: n.initalView,
        buttonText: n.buttonText,
        headerToolbar: n.headerToolbar,
        footerToolbar: n.footerToolbar,
        eventSources: [
          {
            // 渲染日历的事件
            events(l, s) {
              n.events.length ? s(n.events) : s([]);
            }
          }
        ],
        // 点击日历上的某一天
        dateClick(l) {
          a("dateClick", l);
        },
        eventClick(l) {
          a("eventClick", l);
        },
        displayEventEnd: n.displayEventEnd,
        eventContent: n.eventContent
      }), r.value.render());
    };
    return Qe(() => {
      o();
    }), le(() => n.events, () => {
      o();
    }, { deep: !0 }), (i, l) => (m(), h("div", Bx));
  }
}), Nx = {
  install(t) {
    t.component("x-calendar", Lx);
  }
}, Px = {
  key: 0,
  style: { display: "flex" }
}, jx = {
  key: 1,
  class: "icons"
}, qx = { key: 1 }, Fx = /* @__PURE__ */ f({
  __name: "index",
  props: {
    // 表格的配置
    options: {
      type: Array,
      required: !0
    },
    // 表格数据
    data: {
      type: Array,
      required: !0
    },
    // 加载文案
    elementLoadingText: {
      type: String
    },
    // 加载图标名
    elementLoadingSpinner: {
      type: String
    },
    // 加载背景颜色
    elementLoadingBackground: {
      type: String
    },
    // 加载svg的配置
    elementLoadingSvg: {
      type: String
    },
    elementLoadingSvgViewBox: {
      type: String
    },
    // 可编辑单元格显示图标
    editIcon: {
      type: String,
      default: "edit"
    },
    // 是否可以编辑行
    isEditRow: {
      type: Boolean,
      default: !1
    },
    // 编辑行按钮的标识
    editRowIndex: {
      type: String,
      default: ""
    }
  },
  emits: ["confirm", "cancel", "update:editRowIndex"],
  setup(t, { emit: e }) {
    let n = t, a = e, r = I(() => n.options.filter((_) => !_.action)), o = I(() => n.options.find((_) => _.action)), i = I(() => !n.data || n.data.length == 0), l = N(""), s = N(hn(n.data)), u = N(n.editRowIndex);
    le(() => n.data, (_) => {
      s.value = hn(_), s.value.map((y) => {
        y.rowEdit = !1;
      });
    }, { deep: !0 }), le(() => n.editRowIndex, (_) => {
      _ && (u.value = _);
    }), Qe(() => {
      s.value.map((_) => {
        _.rowEdit = !1;
      });
    });
    let d = (_) => {
      l.value = _.$index + _.column.id, console.log(_.row), console.log(l.value);
    }, g = () => {
      l.value = "";
    }, v = (_) => {
      l.value = "", a("confirm", _);
    }, p = (_) => {
      l.value = "", a("cancel", _);
    }, w = (_, y) => {
      y.label === o.value.label && n.isEditRow && u.value === n.editRowIndex && (_.rowEdit = !_.rowEdit, s.value.map((A) => {
        A !== _ && (A.irowEdit = !1);
      }), _.rowEdit || a("update:editRowIndex", ""));
    };
    return (_, y) => {
      const A = q("el-input"), E = q("el-icon-check"), S = q("el-icon-close"), M = q("el-table-column"), P = q("el-table"), z = q1("loading");
      return xo((m(), B(P, {
        data: x(s),
        "element-loading-text": t.elementLoadingText,
        "element-loading-spinner": t.elementLoadingSpinner,
        "element-loading-background": t.elementLoadingBackground,
        "element-loading-svg": t.elementLoadingSvg,
        "element-loading-svg-view-box": t.elementLoadingSvgViewBox,
        onRowClick: x(w)
      }, {
        default: U(() => [
          (m(!0), h(
            ee,
            null,
            ue(x(r), (T, R) => (m(), B(M, {
              key: R,
              label: T.label,
              prop: T.prop,
              align: T.align,
              width: T.width
            }, {
              default: U((H) => [
                H.row.rowEdit ? (m(), B(A, {
                  key: 0,
                  size: "small",
                  modelValue: H.row[T.prop],
                  "onUpdate:modelValue": (Q) => H.row[T.prop] = Q
                }, null, 8, ["modelValue", "onUpdate:modelValue"])) : (m(), h(
                  ee,
                  { key: 1 },
                  [
                    H.$index + H.column.id === x(l) ? (m(), h("div", Px, [
                      F(A, {
                        size: "small",
                        modelValue: H.row[T.prop],
                        "onUpdate:modelValue": (Q) => H.row[T.prop] = Q
                      }, null, 8, ["modelValue", "onUpdate:modelValue"]),
                      c("div", {
                        onClick: y[0] || (y[0] = //@ts-ignore
                        (...Q) => x(g) && x(g)(...Q))
                      }, [
                        _.$slots.editCell ? de(_.$slots, "editCell", {
                          key: 0,
                          scope: H
                        }, void 0, !0) : (m(), h("div", jx, [
                          F(E, {
                            class: "check",
                            onClick: an((Q) => x(v)(H), ["stop"])
                          }, null, 8, ["onClick"]),
                          F(S, {
                            class: "close",
                            onClick: an((Q) => x(p)(H), ["stop"])
                          }, null, 8, ["onClick"])
                        ]))
                      ])
                    ])) : (m(), h(
                      ee,
                      { key: 1 },
                      [
                        T.slot ? de(_.$slots, T.slot, {
                          key: 0,
                          scope: H
                        }, void 0, !0) : (m(), h(
                          "span",
                          qx,
                          se(H.row[T.prop]),
                          1
                          /* TEXT */
                        )),
                        T.editable ? (m(), B(me(`el-icon-${x(ve)(t.editIcon)}`), {
                          key: 2,
                          onClick: an((Q) => x(d)(H), ["stop"]),
                          class: "edit"
                        }, null, 8, ["onClick"])) : J("v-if", !0)
                      ],
                      64
                      /* STABLE_FRAGMENT */
                    ))
                  ],
                  64
                  /* STABLE_FRAGMENT */
                ))
              ]),
              _: 2
              /* DYNAMIC */
            }, 1032, ["label", "prop", "align", "width"]))),
            128
            /* KEYED_FRAGMENT */
          )),
          F(M, {
            label: x(o).label,
            align: x(o).align,
            widht: x(o).width
          }, {
            default: U((T) => [
              T.row.rowEdit ? de(_.$slots, "editRow", { key: 0 }, void 0, !0) : de(_.$slots, "action", {
                key: 1,
                scope: T
              }, void 0, !0)
            ]),
            _: 3
            /* FORWARDED */
          }, 8, ["label", "align", "widht"])
        ]),
        _: 3
        /* FORWARDED */
      }, 8, ["data", "element-loading-text", "element-loading-spinner", "element-loading-background", "element-loading-svg", "element-loading-svg-view-box", "onRowClick"])), [
        [z, x(i)]
      ]);
    };
  }
}), Ux = /* @__PURE__ */ Ye(Fx, [["__scopeId", "data-v-5bd559a7"]]), Wx = {
  install(t) {
    t.component("x-table", Ux);
  }
}, Gx = [
  G1,
  S9,
  I9,
  V9,
  Q9,
  J9,
  t_,
  o_,
  d_,
  m_,
  I7,
  Nx,
  Wx
], Qx = {
  install(t) {
    Gx.map(
      (e) => t.use(e)
    );
  }
};
export {
  Qx as default
};
